espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** USB_OTGFS_GOTGCTL_REG register
 *  OTG Control and Status Register The OTG Control and Status register controls the
 *  behavior and reflects the status of the OTG function of the controller.
 */
#define USB_OTGFS_GOTGCTL_REG(i) (DR_REG_USB_BASE(i) + 0x0)
/** USB_OTGFS_GOTGCTL_SESREQSCS : RO; bitpos: [0]; default: 0;
 *  Mode: Device only
 *  Session Request Success (SesReqScs)
 *  The core sets this bit when a session request initiation is successful.
 *  - 1'b0: Session request failure
 *  - 1'b1: Session request success
 */
#define USB_OTGFS_GOTGCTL_SESREQSCS    (BIT(0))
#define USB_OTGFS_GOTGCTL_SESREQSCS_M  (USB_OTGFS_GOTGCTL_SESREQSCS_V << USB_OTGFS_GOTGCTL_SESREQSCS_S)
#define USB_OTGFS_GOTGCTL_SESREQSCS_V  0x00000001U
#define USB_OTGFS_GOTGCTL_SESREQSCS_S  0
/** USB_OTGFS_GOTGCTL_SESREQ : R/W; bitpos: [1]; default: 0;
 *  Mode: Device only
 *  Session Request (SesReq)
 *  The application sets this bit to initiate a session request on the USB. The
 *  application can clear this bit by writing a 0 when the Host Negotiation Success
 *  Status Change bit in the OTG Interrupt register (GOTGINT.HstNegSucStsChng) is SET.
 *  The core clears this bit when the HstNegSucStsChng bit is cleared.
 *  If you use the USB 1.1 Full-Speed Serial Transceiver interface to initiate the
 *  session request, the application must wait until the VBUS discharges to 0.2 V,
 *  after the B-Session Valid bit in this register (GOTGCTL.BSesVld) is cleared. This
 *  discharge time varies between different PHYs and can be obtained from the PHY
 *  vendor.
 *  - 1'b0: No session request
 *  - 1'b1: Session request
 */
#define USB_OTGFS_GOTGCTL_SESREQ    (BIT(1))
#define USB_OTGFS_GOTGCTL_SESREQ_M  (USB_OTGFS_GOTGCTL_SESREQ_V << USB_OTGFS_GOTGCTL_SESREQ_S)
#define USB_OTGFS_GOTGCTL_SESREQ_V  0x00000001U
#define USB_OTGFS_GOTGCTL_SESREQ_S  1
/** USB_OTGFS_GOTGCTL_VBVALIDOVEN : R/W; bitpos: [2]; default: 0;
 *  Mode: Host only
 *  VBUS Valid Override Enable (VbvalidOvEn)
 *  This bit is used to enable/disable the software to override the Bvalid signal using
 *  the GOTGCTL.VbvalidOvVal.
 *  - 1'b1 : Internally Bvalid received from the PHY is overridden with
 *  GOTGCTL.VbvalidOvVal.
 *  - 1'b0 : Override is disabled and bvalid signal from the respective PHY selected is
 *  used internally by the controller.
 */
#define USB_OTGFS_GOTGCTL_VBVALIDOVEN    (BIT(2))
#define USB_OTGFS_GOTGCTL_VBVALIDOVEN_M  (USB_OTGFS_GOTGCTL_VBVALIDOVEN_V << USB_OTGFS_GOTGCTL_VBVALIDOVEN_S)
#define USB_OTGFS_GOTGCTL_VBVALIDOVEN_V  0x00000001U
#define USB_OTGFS_GOTGCTL_VBVALIDOVEN_S  2
/** USB_OTGFS_GOTGCTL_VBVALIDOVVAL : R/W; bitpos: [3]; default: 0;
 *  Mode: Host only
 *  VBUS Valid OverrideValue (VbvalidOvVal)
 *  This bit is used to set Override value for vbusvalid signal when
 *  GOTGCTL.VbvalidOvEn is set.
 *  - 1'b0 : vbusvalid value is 1'b0 when GOTGCTL.VbvalidOvEn =1
 *  - 1'b1 : vbusvalid value is 1'b1 when GOTGCTL.VbvalidOvEn =1
 */
#define USB_OTGFS_GOTGCTL_VBVALIDOVVAL    (BIT(3))
#define USB_OTGFS_GOTGCTL_VBVALIDOVVAL_M  (USB_OTGFS_GOTGCTL_VBVALIDOVVAL_V << USB_OTGFS_GOTGCTL_VBVALIDOVVAL_S)
#define USB_OTGFS_GOTGCTL_VBVALIDOVVAL_V  0x00000001U
#define USB_OTGFS_GOTGCTL_VBVALIDOVVAL_S  3
/** USB_OTGFS_GOTGCTL_AVALIDOVEN : R/W; bitpos: [4]; default: 0;
 *  Mode: Host only
 *  A-Peripheral Session Valid Override Enable (AvalidOvEn)
 *  This bit is used to enable/disable the software to override the Avalid signal using
 *  the GOTGCTL.AvalidOvVal.
 *  - 1'b1: Internally Avalid received from the PHY is overridden with
 *  GOTGCTL.AvalidOvVal.
 *  - 1'b0: Override is disabled and avalid signal from the respective PHY selected is
 *  used internally by the core
 */
#define USB_OTGFS_GOTGCTL_AVALIDOVEN    (BIT(4))
#define USB_OTGFS_GOTGCTL_AVALIDOVEN_M  (USB_OTGFS_GOTGCTL_AVALIDOVEN_V << USB_OTGFS_GOTGCTL_AVALIDOVEN_S)
#define USB_OTGFS_GOTGCTL_AVALIDOVEN_V  0x00000001U
#define USB_OTGFS_GOTGCTL_AVALIDOVEN_S  4
/** USB_OTGFS_GOTGCTL_AVALIDOVVAL : R/W; bitpos: [5]; default: 0;
 *  Mode: Host only
 *  A-Peripheral Session Valid OverrideValue (AvalidOvVal)
 *  This bit is used to set Override value for Avalid signal when GOTGCTL.AvalidOvEn is
 *  set.
 *  - 1'b0 : Avalid value is 1'b0 when GOTGCTL.AvalidOvEn =1
 *  - 1'b1 : Avalid value is 1'b1 when GOTGCTL.AvalidOvEn =1
 */
#define USB_OTGFS_GOTGCTL_AVALIDOVVAL    (BIT(5))
#define USB_OTGFS_GOTGCTL_AVALIDOVVAL_M  (USB_OTGFS_GOTGCTL_AVALIDOVVAL_V << USB_OTGFS_GOTGCTL_AVALIDOVVAL_S)
#define USB_OTGFS_GOTGCTL_AVALIDOVVAL_V  0x00000001U
#define USB_OTGFS_GOTGCTL_AVALIDOVVAL_S  5
/** USB_OTGFS_GOTGCTL_BVALIDOVEN : R/W; bitpos: [6]; default: 0;
 *  Mode: Device only
 *  B-Peripheral Session Valid Override Value (BvalidOvEn)
 *  This bit is used to enable/disable the software to override the Bvalid signal using
 *  the GOTGCTL.BvalidOvVal.
 *  - 1'b1 : Internally Bvalid received from the PHY is overridden with
 *  GOTGCTL.BvalidOvVal.
 *  - 1'b0 : Override is disabled and bvalid signal from the respective PHY selected is
 *  used internally by the force
 */
#define USB_OTGFS_GOTGCTL_BVALIDOVEN    (BIT(6))
#define USB_OTGFS_GOTGCTL_BVALIDOVEN_M  (USB_OTGFS_GOTGCTL_BVALIDOVEN_V << USB_OTGFS_GOTGCTL_BVALIDOVEN_S)
#define USB_OTGFS_GOTGCTL_BVALIDOVEN_V  0x00000001U
#define USB_OTGFS_GOTGCTL_BVALIDOVEN_S  6
/** USB_OTGFS_GOTGCTL_BVALIDOVVAL : R/W; bitpos: [7]; default: 0;
 *  Mode: Device only
 *  B-Peripheral Session Valid OverrideValue (BvalidOvVal)
 *  This bit is used to set Override value for Bvalid signal when GOTGCTL.BvalidOvEn is
 *  set.
 *  - 1'b0 : Bvalid value is 1'b0 when GOTGCTL.BvalidOvEn =1
 *  - 1'b1 : Bvalid value is 1'b1 when GOTGCTL.BvalidOvEn =1
 */
#define USB_OTGFS_GOTGCTL_BVALIDOVVAL    (BIT(7))
#define USB_OTGFS_GOTGCTL_BVALIDOVVAL_M  (USB_OTGFS_GOTGCTL_BVALIDOVVAL_V << USB_OTGFS_GOTGCTL_BVALIDOVVAL_S)
#define USB_OTGFS_GOTGCTL_BVALIDOVVAL_V  0x00000001U
#define USB_OTGFS_GOTGCTL_BVALIDOVVAL_S  7
/** USB_OTGFS_GOTGCTL_HSTNEGSCS : RO; bitpos: [8]; default: 0;
 *  Mode: HNP-capable Device
 *  Host Negotiation Success (HstNegScs)
 *  The controller sets this bit when host negotiation is successful. The controller
 *  clears this bit when the HNP Request (HNPReq) bit in this register is set.
 *  - 1'b0: Host negotiation failure
 *  - 1'b1: Host negotiation success
 */
#define USB_OTGFS_GOTGCTL_HSTNEGSCS    (BIT(8))
#define USB_OTGFS_GOTGCTL_HSTNEGSCS_M  (USB_OTGFS_GOTGCTL_HSTNEGSCS_V << USB_OTGFS_GOTGCTL_HSTNEGSCS_S)
#define USB_OTGFS_GOTGCTL_HSTNEGSCS_V  0x00000001U
#define USB_OTGFS_GOTGCTL_HSTNEGSCS_S  8
/** USB_OTGFS_GOTGCTL_HNPREQ : R/W; bitpos: [9]; default: 0;
 *  Mode: HNP Capable OTG Device
 *  HNP Request (HNPReq)
 *  The application sets this bit to initiate an HNP request to the connected USB host.
 *  The application can clear this bit by writing a 0 when the Host Negotiation Success
 *  Status Change bit in the OTG Interrupt register (GOTGINT.HstNegSucStsChng) is SET.
 *  The controller clears this bit when the HstNegSucStsChng bit is cleared.
 *  - 1'b0: No HNP request
 *  - 1'b1: HNP request
 */
#define USB_OTGFS_GOTGCTL_HNPREQ    (BIT(9))
#define USB_OTGFS_GOTGCTL_HNPREQ_M  (USB_OTGFS_GOTGCTL_HNPREQ_V << USB_OTGFS_GOTGCTL_HNPREQ_S)
#define USB_OTGFS_GOTGCTL_HNPREQ_V  0x00000001U
#define USB_OTGFS_GOTGCTL_HNPREQ_S  9
/** USB_OTGFS_GOTGCTL_HSTSETHNPEN : R/W; bitpos: [10]; default: 0;
 *  Mode: HNP Capable OTG Host
 *  Host Set HNP Enable (HstSetHNPEn)
 *  The application sets this bit when it has successfully enabled HNP (using the
 *  SetFeature.SetHNPEnable command) on the connected device.
 *  - 1'b0: Host Set HNP is not enabled
 *  - 1'b1: Host Set HNP is enabled
 */
#define USB_OTGFS_GOTGCTL_HSTSETHNPEN    (BIT(10))
#define USB_OTGFS_GOTGCTL_HSTSETHNPEN_M  (USB_OTGFS_GOTGCTL_HSTSETHNPEN_V << USB_OTGFS_GOTGCTL_HSTSETHNPEN_S)
#define USB_OTGFS_GOTGCTL_HSTSETHNPEN_V  0x00000001U
#define USB_OTGFS_GOTGCTL_HSTSETHNPEN_S  10
/** USB_OTGFS_GOTGCTL_DEVHNPEN : R/W; bitpos: [11]; default: 0;
 *  Mode: HNP Capable OTG Device
 *  Device HNP Enabled (DevHNPEn)
 *  The application sets this bit when it successfully receives a
 *  SetFeature.SetHNPEnable command from the connected USB host.
 *  - 1'b0: HNP is not enabled in the application
 *  - 1'b1: HNP is enabled in the application
 */
#define USB_OTGFS_GOTGCTL_DEVHNPEN    (BIT(11))
#define USB_OTGFS_GOTGCTL_DEVHNPEN_M  (USB_OTGFS_GOTGCTL_DEVHNPEN_V << USB_OTGFS_GOTGCTL_DEVHNPEN_S)
#define USB_OTGFS_GOTGCTL_DEVHNPEN_V  0x00000001U
#define USB_OTGFS_GOTGCTL_DEVHNPEN_S  11
/** USB_OTGFS_GOTGCTL_EHEN : R/W; bitpos: [12]; default: 0;
 *  Mode: SRP Capable Host
 *  Embedded Host Enable
 *  It is used to select between OTG A Device state Machine and Embedded Host state
 *  machine.
 *  - 1'b0: OTG A Device state machine is selected
 *  - 1'b1: Embedded Host State Machine is selected
 *  Note:
 *  This field is valid only in SRP-Capable OTG Mode (OTG_MODE=0,1).
 */
#define USB_OTGFS_GOTGCTL_EHEN    (BIT(12))
#define USB_OTGFS_GOTGCTL_EHEN_M  (USB_OTGFS_GOTGCTL_EHEN_V << USB_OTGFS_GOTGCTL_EHEN_S)
#define USB_OTGFS_GOTGCTL_EHEN_V  0x00000001U
#define USB_OTGFS_GOTGCTL_EHEN_S  12
/** USB_OTGFS_GOTGCTL_DBNCEFLTRBYPASS : R/W; bitpos: [15]; default: 0;
 *  Mode: Host and Device
 *  Debounce Filter Bypass
 *  Bypass Debounce filters for avalid, bvalid, vbusvalid, sessend, iddig signals when
 *  enabled.
 *  - 1'b0: Disabled
 *  - 1'b1: Enabled
 *
 *
 *  Note:  This register bit is valid only when debounce filters are present in core.
 */
#define USB_OTGFS_GOTGCTL_DBNCEFLTRBYPASS    (BIT(15))
#define USB_OTGFS_GOTGCTL_DBNCEFLTRBYPASS_M  (USB_OTGFS_GOTGCTL_DBNCEFLTRBYPASS_V << USB_OTGFS_GOTGCTL_DBNCEFLTRBYPASS_S)
#define USB_OTGFS_GOTGCTL_DBNCEFLTRBYPASS_V  0x00000001U
#define USB_OTGFS_GOTGCTL_DBNCEFLTRBYPASS_S  15
/** USB_OTGFS_GOTGCTL_CONIDSTS : RO; bitpos: [16]; default: 1;
 *  Mode: Host and Device
 *  Connector ID Status (ConIDSts)
 *  Indicates the connector ID status on a connect event.
 *  - 1'b0: The core is in A-Device mode.
 *  - 1'b1: The core is in B-Device mode.
 *
 *  Note:
 *  The reset value of this register field can be read only after the PHY clock is
 *  stable, or if IDDIG_FILTER is enabled, wait for the filter timer to expire to read
 *  the correct reset value which ever event is later.
 *  Reset:
 *  - 1'b0: in host only mode (OTG_MODE = 5 or 6)
 *  - 1'b1: in all other configurations
 */
#define USB_OTGFS_GOTGCTL_CONIDSTS    (BIT(16))
#define USB_OTGFS_GOTGCTL_CONIDSTS_M  (USB_OTGFS_GOTGCTL_CONIDSTS_V << USB_OTGFS_GOTGCTL_CONIDSTS_S)
#define USB_OTGFS_GOTGCTL_CONIDSTS_V  0x00000001U
#define USB_OTGFS_GOTGCTL_CONIDSTS_S  16
/** USB_OTGFS_GOTGCTL_DBNCTIME : RO; bitpos: [17]; default: 0;
 *  Mode: Host only
 *  Long/Short Debounce Time (DbncTime)
 *  Indicates the debounce time of a detected connection.
 *  - 1'b0: Long debounce time, used for physical connections (100 ms + 2.5 micro-sec)
 *  - 1'b1: Short debounce time, used for soft connections (2.5 micro-sec)
 */
#define USB_OTGFS_GOTGCTL_DBNCTIME    (BIT(17))
#define USB_OTGFS_GOTGCTL_DBNCTIME_M  (USB_OTGFS_GOTGCTL_DBNCTIME_V << USB_OTGFS_GOTGCTL_DBNCTIME_S)
#define USB_OTGFS_GOTGCTL_DBNCTIME_V  0x00000001U
#define USB_OTGFS_GOTGCTL_DBNCTIME_S  17
/** USB_OTGFS_GOTGCTL_ASESVLD : RO; bitpos: [18]; default: 0;
 *  Mode: Host only
 *  A-Session Valid (ASesVld)
 *  Indicates the Host mode transceiver status.
 *  - 1'b0: A-session is not valid
 *  - 1'b1: A-session is valid
 *  Note: If you do not enabled OTG features (such as SRP and HNP), the read reset
 *  value will be 1. The vbus assigns the values internally for non-SRP or non-HNP
 *  configurations.
 *  In case of OTG_MODE=0, the reset value of this bit is 1'b0.
 */
#define USB_OTGFS_GOTGCTL_ASESVLD    (BIT(18))
#define USB_OTGFS_GOTGCTL_ASESVLD_M  (USB_OTGFS_GOTGCTL_ASESVLD_V << USB_OTGFS_GOTGCTL_ASESVLD_S)
#define USB_OTGFS_GOTGCTL_ASESVLD_V  0x00000001U
#define USB_OTGFS_GOTGCTL_ASESVLD_S  18
/** USB_OTGFS_GOTGCTL_BSESVLD : RO; bitpos: [19]; default: 0;
 *  Mode: Device only
 *  B-Session Valid (BSesVld)
 *  Indicates the Device mode transceiver status.
 *  - 1'b0: B-session is not valid.
 *  - 1'b1: B-session is valid.
 *  In OTG mode, you can use this bit to determine if the device is connected or
 *  disconnected.
 *
 *  Note:
 *  - If you do not enable OTG features (such as SRP and HNP), the read reset value
 *  will be 1.The vbus assigns the values internally for non- SRP or non-HNP
 *  configurations.
 *  - In case of OTG_MODE=0, the reset value of this bit is 1'b0.
 *  - The reset value of this register field can be read only after the PHY clock is
 *  stable, or if IDDIG_FILTER is enabled, wait for the filter timer to expire to read
 *  the correct reset value which ever event is later.
 */
#define USB_OTGFS_GOTGCTL_BSESVLD    (BIT(19))
#define USB_OTGFS_GOTGCTL_BSESVLD_M  (USB_OTGFS_GOTGCTL_BSESVLD_V << USB_OTGFS_GOTGCTL_BSESVLD_S)
#define USB_OTGFS_GOTGCTL_BSESVLD_V  0x00000001U
#define USB_OTGFS_GOTGCTL_BSESVLD_S  19
/** USB_OTGFS_GOTGCTL_OTGVER : R/W; bitpos: [20]; default: 0;
 *  OTG Version (OTGVer)
 *  Indicates the OTG revision.
 *  - 1'b0: OTG Version 1.3. In this version the core supports Data line pulsing and
 *  VBus pulsing for SRP.
 *  - 1'b1: OTG Version 2.0. In this version the core supports only Data line pulsing
 *  for SRP.
 */
#define USB_OTGFS_GOTGCTL_OTGVER    (BIT(20))
#define USB_OTGFS_GOTGCTL_OTGVER_M  (USB_OTGFS_GOTGCTL_OTGVER_V << USB_OTGFS_GOTGCTL_OTGVER_S)
#define USB_OTGFS_GOTGCTL_OTGVER_V  0x00000001U
#define USB_OTGFS_GOTGCTL_OTGVER_S  20
/** USB_OTGFS_GOTGCTL_CURMOD : RO; bitpos: [21]; default: 0;
 *  Current Mode of Operation (CurMod)
 *  Mode: Host and Device
 *  Indicates the current mode.
 *  - 1'b0: Device mode
 *  - 1'b1: Host mode
 *  Reset:
 *  - 1'b1 in Host-only mode (OTG_MODE=5 or 6)
 *  - 1'b0 in all other configurations
 *  Note: The reset value of this register field can be read only after the PHY clock
 *  is stable, or if IDDIG_FILTER is enabled, wait for the filter timer to expire to
 *  read the correct reset value which ever event is later.
 */
#define USB_OTGFS_GOTGCTL_CURMOD    (BIT(21))
#define USB_OTGFS_GOTGCTL_CURMOD_M  (USB_OTGFS_GOTGCTL_CURMOD_V << USB_OTGFS_GOTGCTL_CURMOD_S)
#define USB_OTGFS_GOTGCTL_CURMOD_V  0x00000001U
#define USB_OTGFS_GOTGCTL_CURMOD_S  21

/** USB_OTGFS_GOTGINT_REG register
 *  OTG Interrupt Register The application reads this register whenever there is an OTG
 *  interrupt and clears the bits in this register to clear the OTG interrupt.
 */
#define USB_OTGFS_GOTGINT_REG(i) (DR_REG_USB_BASE(i) + 0x4)
/** USB_OTGFS_GOTGINT_SESENDDET : R/W; bitpos: [2]; default: 0;
 *  Mode: Host and Device
 *  Session End Detected (SesEndDet)
 *  The controller sets this bit when the utmiotg_bvalid signal is deasserted. This bit
 *  can be set only by the core and the application should write 1 to clear it.
 */
#define USB_OTGFS_GOTGINT_SESENDDET    (BIT(2))
#define USB_OTGFS_GOTGINT_SESENDDET_M  (USB_OTGFS_GOTGINT_SESENDDET_V << USB_OTGFS_GOTGINT_SESENDDET_S)
#define USB_OTGFS_GOTGINT_SESENDDET_V  0x00000001U
#define USB_OTGFS_GOTGINT_SESENDDET_S  2
/** USB_OTGFS_GOTGINT_SESREQSUCSTSCHNG : R/W; bitpos: [8]; default: 0;
 *  Mode: Host and Device
 *  Session Request Success Status Change (SesReqSucStsChng)
 *  The core sets this bit on the success or failure of a session request. The
 *  application must read the Session Request Success bit in the OTG Control and Status
 *  register (GOTGCTL.SesReqScs) to check for success or failure. This bit can be set
 *  only by the core and the application should write 1 to clear it.
 */
#define USB_OTGFS_GOTGINT_SESREQSUCSTSCHNG    (BIT(8))
#define USB_OTGFS_GOTGINT_SESREQSUCSTSCHNG_M  (USB_OTGFS_GOTGINT_SESREQSUCSTSCHNG_V << USB_OTGFS_GOTGINT_SESREQSUCSTSCHNG_S)
#define USB_OTGFS_GOTGINT_SESREQSUCSTSCHNG_V  0x00000001U
#define USB_OTGFS_GOTGINT_SESREQSUCSTSCHNG_S  8
/** USB_OTGFS_GOTGINT_HSTNEGSUCSTSCHNG : R/W; bitpos: [9]; default: 0;
 *  Mode: Host and Device
 *  Host Negotiation Success Status Change (HstNegSucStsChng)
 *  The core sets this bit on the success or failure of a USB host negotiation request.
 *  The application must read the Host Negotiation Success bit of the OTG Control and
 *  Status register (GOTGCTL.HstNegScs) to check for success or failure. This bit can
 *  be set only by the core and the application should write 1 to clear it.
 */
#define USB_OTGFS_GOTGINT_HSTNEGSUCSTSCHNG    (BIT(9))
#define USB_OTGFS_GOTGINT_HSTNEGSUCSTSCHNG_M  (USB_OTGFS_GOTGINT_HSTNEGSUCSTSCHNG_V << USB_OTGFS_GOTGINT_HSTNEGSUCSTSCHNG_S)
#define USB_OTGFS_GOTGINT_HSTNEGSUCSTSCHNG_V  0x00000001U
#define USB_OTGFS_GOTGINT_HSTNEGSUCSTSCHNG_S  9
/** USB_OTGFS_GOTGINT_HSTNEGDET : R/W; bitpos: [17]; default: 0;
 *  Mode:Host and Device
 *  Host Negotiation Detected (HstNegDet)
 *  The core sets this bit when it detects a host negotiation request on the USB. This
 *  bit can be set only by the core and the application should write 1 to clear it.
 */
#define USB_OTGFS_GOTGINT_HSTNEGDET    (BIT(17))
#define USB_OTGFS_GOTGINT_HSTNEGDET_M  (USB_OTGFS_GOTGINT_HSTNEGDET_V << USB_OTGFS_GOTGINT_HSTNEGDET_S)
#define USB_OTGFS_GOTGINT_HSTNEGDET_V  0x00000001U
#define USB_OTGFS_GOTGINT_HSTNEGDET_S  17
/** USB_OTGFS_GOTGINT_ADEVTOUTCHG : R/W; bitpos: [18]; default: 0;
 *  Mode: Host and Device
 *  A-Device Timeout Change (ADevTOUTChg)
 *  The core sets this bit to indicate that the A-device has timed out while waiting
 *  for the B-device to connect.This bit can be set only by the core and the
 *  application should write 1 to clear it.
 */
#define USB_OTGFS_GOTGINT_ADEVTOUTCHG    (BIT(18))
#define USB_OTGFS_GOTGINT_ADEVTOUTCHG_M  (USB_OTGFS_GOTGINT_ADEVTOUTCHG_V << USB_OTGFS_GOTGINT_ADEVTOUTCHG_S)
#define USB_OTGFS_GOTGINT_ADEVTOUTCHG_V  0x00000001U
#define USB_OTGFS_GOTGINT_ADEVTOUTCHG_S  18
/** USB_OTGFS_GOTGINT_DBNCEDONE : R/W; bitpos: [19]; default: 0;
 *  Mode: Host only
 *  Debounce Done (DbnceDone)
 *  The core sets this bit when the debounce is completed after the device connect. The
 *  application can start driving USB reset after seeing this interrupt. This bit is
 *  only valid when the HNP Capable or SRP Capable bit is SET in the Core USB
 *  Configuration register (GUSBCFG.HNPCap or GUSBCFG.SRPCap, respectively). This bit
 *  can be set only by the core and the application should write 1 to clear it.
 */
#define USB_OTGFS_GOTGINT_DBNCEDONE    (BIT(19))
#define USB_OTGFS_GOTGINT_DBNCEDONE_M  (USB_OTGFS_GOTGINT_DBNCEDONE_V << USB_OTGFS_GOTGINT_DBNCEDONE_S)
#define USB_OTGFS_GOTGINT_DBNCEDONE_V  0x00000001U
#define USB_OTGFS_GOTGINT_DBNCEDONE_S  19

