espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_GAHBCFG_REG register
 *  AHB Configuration Register This register can be used to configure the core after
 *  power-on or a change in mode. This register mainly contains AHB system-related
 *  configuration parameters. Do not change this register after the initial
 *  programming. The application must program this register before starting any
 *  transactions on either the AHB or the USB.
 */
#define USB_OTGFS_GAHBCFG_REG(i) (DR_REG_USB_BASE(i) + 0x8)
/** USB_OTGFS_GAHBCFG_GLBLINTRMSK : R/W; bitpos: [0]; default: 0;
 *  Mode: Host and device
 *  Global Interrupt Mask (GlblIntrMsk)
 *  The application uses this bit to mask or unmask the interrupt line assertion to
 *  itself. Irrespective of this bit's setting, the interrupt status registers are
 *  updated by the controller.
 *  - 1'b0: Mask the interrupt assertion to the application.
 *  - 1'b1: Unmask the interrupt assertion to the application.
 */
#define USB_OTGFS_GAHBCFG_GLBLINTRMSK    (BIT(0))
#define USB_OTGFS_GAHBCFG_GLBLINTRMSK_M  (USB_OTGFS_GAHBCFG_GLBLINTRMSK_V << USB_OTGFS_GAHBCFG_GLBLINTRMSK_S)
#define USB_OTGFS_GAHBCFG_GLBLINTRMSK_V  0x00000001U
#define USB_OTGFS_GAHBCFG_GLBLINTRMSK_S  0
/** USB_OTGFS_GAHBCFG_HBSTLEN : R/W; bitpos: [4:1]; default: 0;
 *  Mode: Host and device
 *  Burst Length/Type (HBstLen)
 *  This field is used in both External and Internal DMA modes. In External DMA mode,
 *  these bits appear on dma_burst[3:0] ports, which can be used by an external wrapper
 *  to interface the External DMA Controller interface to Synopsis DW_ahb_dmac or ARM
 *  PrimeCell.
 *  External DMA Mode defines the DMA burst length in terms of 32-bit words:
 *  - 4'b0000: 1 word
 *  - 4'b0001: 4 words
 *  - 4'b0010: 8 words
 *  - 4'b0011: 16 words
 *  - 4'b0100: 32 words
 *  - 4'b0101: 64 words
 *  - 4'b0110: 128 words
 *  - 4'b0111: 256 words
 *  - Others: Reserved
 *  Internal DMA Mode AHB Master burst type:
 *  - 4'b0000 Single
 *  - 4'b0001 INCR
 *  - 4'b0011 INCR4
 *  - 4'b0101 INCR8
 *  - 4'b0111 INCR16
 *  - Others: Reserved
 */
#define USB_OTGFS_GAHBCFG_HBSTLEN    0x0000000FU
#define USB_OTGFS_GAHBCFG_HBSTLEN_M  (USB_OTGFS_GAHBCFG_HBSTLEN_V << USB_OTGFS_GAHBCFG_HBSTLEN_S)
#define USB_OTGFS_GAHBCFG_HBSTLEN_V  0x0000000FU
#define USB_OTGFS_GAHBCFG_HBSTLEN_S  1
/** USB_OTGFS_GAHBCFG_DMAEN : R/W; bitpos: [5]; default: 0;
 *  Mode: Host and device
 *  DMA Enable (DMAEn)
 *
 *  This bit is always 0 when Slave-Only mode has been selected.
 *
 *  Reset: 1'b0
 */
#define USB_OTGFS_GAHBCFG_DMAEN    (BIT(5))
#define USB_OTGFS_GAHBCFG_DMAEN_M  (USB_OTGFS_GAHBCFG_DMAEN_V << USB_OTGFS_GAHBCFG_DMAEN_S)
#define USB_OTGFS_GAHBCFG_DMAEN_V  0x00000001U
#define USB_OTGFS_GAHBCFG_DMAEN_S  5
/** USB_OTGFS_GAHBCFG_NPTXFEMPLVL : R/W; bitpos: [7]; default: 0;
 *  Mode: Host and device
 *  Non-Periodic TxFIFO Empty Level (NPTxFEmpLvl)
 *  This bit is used only in Slave mode. In host mode and with Shared FIFO with device
 *  mode, this bit indicates when the Non-Periodic TxFIFO Empty Interrupt bit in the
 *  Core Interrupt register (GINTSTS.NPTxFEmp) is triggered.
 *  With dedicated FIFO in device mode, this bit indicates when IN endpoint Transmit
 *  FIFO empty interrupt (DIEPINTn.TxFEmp) is triggered.
 *  Host mode and with Shared FIFO with device mode:
 *  - 1'b0: GINTSTS.NPTxFEmp interrupt indicates that the Non-Periodic TxFIFO is half
 *  empty
 *  - 1'b1: GINTSTS.NPTxFEmp interrupt indicates that the Non-Periodic TxFIFO is
 *  completely empty
 *  Dedicated FIFO in device mode:
 *  - 1'b0: DIEPINTn.TxFEmp interrupt indicates that the IN Endpoint TxFIFO is half
 *  empty
 *  - 1'b1: DIEPINTn.TxFEmp interrupt indicates that the IN Endpoint TxFIFO is
 *  completely empty
 */
#define USB_OTGFS_GAHBCFG_NPTXFEMPLVL    (BIT(7))
#define USB_OTGFS_GAHBCFG_NPTXFEMPLVL_M  (USB_OTGFS_GAHBCFG_NPTXFEMPLVL_V << USB_OTGFS_GAHBCFG_NPTXFEMPLVL_S)
#define USB_OTGFS_GAHBCFG_NPTXFEMPLVL_V  0x00000001U
#define USB_OTGFS_GAHBCFG_NPTXFEMPLVL_S  7
/** USB_OTGFS_GAHBCFG_PTXFEMPLVL : R/W; bitpos: [8]; default: 0;
 *  Mode: Host only
 *  Periodic TxFIFO Empty Level (PTxFEmpLvl)
 *  Indicates when the Periodic TxFIFO Empty Interrupt bit in the Core Interrupt
 *  register (GINTSTS.PTxFEmp) is triggered. This bit is used only in Slave mode.
 *  - 1'b0: GINTSTS.PTxFEmp interrupt indicates that the Periodic TxFIFO is half empty
 *  - 1'b1: GINTSTS.PTxFEmp interrupt indicates that the Periodic TxFIFO is completely
 *  empty
 */
#define USB_OTGFS_GAHBCFG_PTXFEMPLVL    (BIT(8))
#define USB_OTGFS_GAHBCFG_PTXFEMPLVL_M  (USB_OTGFS_GAHBCFG_PTXFEMPLVL_V << USB_OTGFS_GAHBCFG_PTXFEMPLVL_S)
#define USB_OTGFS_GAHBCFG_PTXFEMPLVL_V  0x00000001U
#define USB_OTGFS_GAHBCFG_PTXFEMPLVL_S  8
/** USB_OTGFS_GAHBCFG_REMMEMSUPP : R/W; bitpos: [21]; default: 0;
 *  Mode: Host and Device
 *  Remote Memory Support (RemMemSupp)
 *  This bit is programmed to enable the functionality to wait for the system DMA Done
 *  Signal for the DMA Write Transfers.
 *  - GAHBCFG.RemMemSupp=1
 *  The int_dma_req output signal is asserted when the DMA starts write transfer to the
 *  external memory. When the core is done with the Transfers it asserts int_dma_done
 *  signal to flag the completion of DMA writes from the controller. The core then
 *  waits for sys_dma_done signal from the system to proceed further and complete the
 *  Data Transfer corresponding to a particular Channel/Endpoint.
 *  - GAHBCFG.RemMemSupp=0
 *  The int_dma_req and int_dma_done signals are not asserted and the core proceeds
 *  with the assertion of the XferComp interrupt as soon as the DMA write transfer is
 *  done at the Core Boundary and it does not wait for the sys_dma_done signal to
 *  complete the DATA transfers.
 */
#define USB_OTGFS_GAHBCFG_REMMEMSUPP    (BIT(21))
#define USB_OTGFS_GAHBCFG_REMMEMSUPP_M  (USB_OTGFS_GAHBCFG_REMMEMSUPP_V << USB_OTGFS_GAHBCFG_REMMEMSUPP_S)
#define USB_OTGFS_GAHBCFG_REMMEMSUPP_V  0x00000001U
#define USB_OTGFS_GAHBCFG_REMMEMSUPP_S  21
/** USB_OTGFS_GAHBCFG_NOTIALLDMAWRIT : R/W; bitpos: [22]; default: 0;
 *  Mode: Host and Device
 *  Notify All DMA Write Transactions (NotiAllDmaWrit)
 *  This bit is programmed to enable the System DMA Done functionality for all the DMA
 *  write Transactions corresponding to the Channel/Endpoint. This bit is valid only
 *  when GAHBCFG.RemMemSupp is set to 1.
 *  - GAHBCFG.NotiAllDmaWrit = 1
 *  The core asserts int_dma_req for all the DMA write transactions on the AHB
 *  interface along with int_dma_done, chep_last_transact and chep_number signal
 *  information. The core waits for sys_dma_done signal for all the DMA write
 *  transactions in order to complete the transfer of a particular Channel/Endpoint.
 *  - GAHBCFG.NotiAllDmaWrit = 0
 *  The core asserts int_dma_req signal only for the last transaction of DMA write
 *  transfer corresponding to a particular Channel/Endpoint. Similarly, the core waits
 *  for sys_dma_done signal only for that transaction of DMA write to complete the
 *  transfer of a particular Channel/Endpoint.
 */
#define USB_OTGFS_GAHBCFG_NOTIALLDMAWRIT    (BIT(22))
#define USB_OTGFS_GAHBCFG_NOTIALLDMAWRIT_M  (USB_OTGFS_GAHBCFG_NOTIALLDMAWRIT_V << USB_OTGFS_GAHBCFG_NOTIALLDMAWRIT_S)
#define USB_OTGFS_GAHBCFG_NOTIALLDMAWRIT_V  0x00000001U
#define USB_OTGFS_GAHBCFG_NOTIALLDMAWRIT_S  22
/** USB_OTGFS_GAHBCFG_AHBSINGLE : R/W; bitpos: [23]; default: 0;
 *  Mode: Host and Device
 *  AHB Single Support (AHBSingle)
 *  This bit when programmed supports Single transfers for the remaining data in a
 *  transfer when the core is operating in DMA mode.
 *  - 1'b0: The remaining data in the transfer is sent using INCR burst size.
 *  - 1'b1: The remaining data in the transfer is sent using Single burst size.
 *  Note: If this feature is enabled, the AHB RETRY and SPLIT transfers still have INCR
 *  burst type. Enable this feature when the AHB Slave connected to the core does not
 *  support INCR burst (and when Split, and Retry transactions are not being used in
 *  the bus).
 */
#define USB_OTGFS_GAHBCFG_AHBSINGLE    (BIT(23))
#define USB_OTGFS_GAHBCFG_AHBSINGLE_M  (USB_OTGFS_GAHBCFG_AHBSINGLE_V << USB_OTGFS_GAHBCFG_AHBSINGLE_S)
#define USB_OTGFS_GAHBCFG_AHBSINGLE_V  0x00000001U
#define USB_OTGFS_GAHBCFG_AHBSINGLE_S  23
/** USB_OTGFS_GAHBCFG_INVDESCENDIANESS : R/W; bitpos: [24]; default: 0;
 *  Mode: Host and Device
 *  Invert Descriptor Endianness (InvDescEndianess)
 *  - 1'b0: Descriptor Endianness is same as AHB Master Endianness.
 *  - 1'b1:
 *  -- If the AHB Master endianness is Big Endian, the Descriptor Endianness is Little
 *  Endian.
 *  -- If the AHB Master endianness is Little Endian, the Descriptor Endianness is Big
 *  Endian.
 */
#define USB_OTGFS_GAHBCFG_INVDESCENDIANESS    (BIT(24))
#define USB_OTGFS_GAHBCFG_INVDESCENDIANESS_M  (USB_OTGFS_GAHBCFG_INVDESCENDIANESS_V << USB_OTGFS_GAHBCFG_INVDESCENDIANESS_S)
#define USB_OTGFS_GAHBCFG_INVDESCENDIANESS_V  0x00000001U
#define USB_OTGFS_GAHBCFG_INVDESCENDIANESS_S  24

/** USB_OTGFS_GUSBCFG_REG register
 *  USB Configuration Register This register can be used to configure the core after
 *  power-on or a changing to Host mode or Device mode. It contains USB and USB-PHY
 *  related configuration parameters. The application must program this register before
 *  starting any transactions on either the AHB or the USB. Do not make changes to this
 *  register after the initial programming.
 */
#define USB_OTGFS_GUSBCFG_REG(i) (DR_REG_USB_BASE(i) + 0xc)
/** USB_OTGFS_GUSBCFG_TOUTCAL : R/W; bitpos: [2:0]; default: 0;
 *  Mode: Host and Device
 *  HS/FS Timeout Calibration (TOutCal)
 *
 *  The number of PHY clocks that the application programs in this field is added to
 *  the high-speed/full-speed interpacket timeout duration in the core to account for
 *  any additional delays introduced by the PHY. This can be required, because the
 *  delay introduced by the PHY in generating the linestate condition can vary from one
 *  PHY to another.
 *
 *  The USB standard timeout value for high-speed operation is 736 to 816 (inclusive)
 *  bit times. The USB standard timeout value for full-speed operation is 16 to 18
 *  (inclusive) bit times. The application must program this field based on the speed
 *  of enumeration. The number of bit times added per PHY clock are as follows:
 *
 *  High-speed operation:
 *  - One 30-MHz PHY clock = 16 bit times
 *  - One 60-MHz PHY clock = 8 bit times
 *  Full-speed operation:
 *  - One 30-MHz PHY clock = 0.4 bit times
 *  - One 60-MHz PHY clock = 0.2 bit times
 *  - One 48-MHz PHY clock = 0.25 bit times
 */
#define USB_OTGFS_GUSBCFG_TOUTCAL    0x00000007U
#define USB_OTGFS_GUSBCFG_TOUTCAL_M  (USB_OTGFS_GUSBCFG_TOUTCAL_V << USB_OTGFS_GUSBCFG_TOUTCAL_S)
#define USB_OTGFS_GUSBCFG_TOUTCAL_V  0x00000007U
#define USB_OTGFS_GUSBCFG_TOUTCAL_S  0
/** USB_OTGFS_GUSBCFG_PHYIF : R/W; bitpos: [3]; default: 0;
 *  Mode: Host and Device
 *  PHY Interface (PHYIf)
 *  The application uses this bit to configure the core to support a UTMI+ PHY with an
 *  8- or 16-bit interface. When a ULPI PHY is chosen, this must be Set to 8-bit mode.
 *  - 1'b0: 8 bits
 *  - 1'b1: 16 bits
 *  This bit is writable only If UTMI+ and ULPI were selected. Otherwise, this bit
 *  returns the value for the power-on interface selected during configuration.
 */
#define USB_OTGFS_GUSBCFG_PHYIF    (BIT(3))
#define USB_OTGFS_GUSBCFG_PHYIF_M  (USB_OTGFS_GUSBCFG_PHYIF_V << USB_OTGFS_GUSBCFG_PHYIF_S)
#define USB_OTGFS_GUSBCFG_PHYIF_V  0x00000001U
#define USB_OTGFS_GUSBCFG_PHYIF_S  3
/** USB_OTGFS_GUSBCFG_FSINTF : R/W; bitpos: [5]; default: 0;
 *  Mode: Host and Device
 *  Full-Speed Serial Interface Select (FSIntf)
 *
 *  The application uses this bit to select either a unidirectional or bidirectional
 *  USB 1.1 full-speed serial transceiver interface.
 *  - 1'b0: 6-pin unidirectional full-speed serial interface
 *  - 1'b1: 3-pin bidirectional full-speed serial interface
 *  If a USB 1.1 Full-Speed Serial Transceiver interface was not selected, this bit is
 *  always 0, with Write Only access. If a USB 1.1 FS interface was selected, Then the
 *  application can Set this bit to select between the 3- and 6-pin interfaces, and
 *  access is Read and Write.
 *
 *  Note: For supporting the new 4-pin bi-directional interface, you need to select
 *  6-pin unidirectional FS serial mode, and add an external control to convert it to a
 *  4-pin interface.
 */
#define USB_OTGFS_GUSBCFG_FSINTF    (BIT(5))
#define USB_OTGFS_GUSBCFG_FSINTF_M  (USB_OTGFS_GUSBCFG_FSINTF_V << USB_OTGFS_GUSBCFG_FSINTF_S)
#define USB_OTGFS_GUSBCFG_FSINTF_V  0x00000001U
#define USB_OTGFS_GUSBCFG_FSINTF_S  5
/** USB_OTGFS_GUSBCFG_PHYSEL : RO; bitpos: [6]; default: 1;
 *  PHYSel
 *
 *  Mode: Host and Device
 *
 *  USB 2.0 High-Speed PHY or USB 1.1 Full-Speed Serial Transceiver Select (PHYSel)
 *  The application uses this bit to select either a high-speed UTMI+ or ULPI PHY, or a
 *  full-speed transceiver.
 *  - 1'b0: USB 2.0 high-speed UTMI+ or ULPI PHY
 *  - 1'b1: USB 1.1 full-speed serial transceiver
 *  If a USB 1.1 Full-Speed Serial Transceiver interface was not selected in, this bit
 *  is always 0, with Write Only access.
 *  If a high-speed PHY interface was not selected in, this bit is always 1, with Write
 *  Only access.
 *  If both interface types were selected (parameters have non-zero values), the
 *  application uses this bit to select which interface is active, and access is Read
 *  and Write.
 */
#define USB_OTGFS_GUSBCFG_PHYSEL    (BIT(6))
#define USB_OTGFS_GUSBCFG_PHYSEL_M  (USB_OTGFS_GUSBCFG_PHYSEL_V << USB_OTGFS_GUSBCFG_PHYSEL_S)
#define USB_OTGFS_GUSBCFG_PHYSEL_V  0x00000001U
#define USB_OTGFS_GUSBCFG_PHYSEL_S  6
/** USB_OTGFS_GUSBCFG_SRPCAP : R/W; bitpos: [8]; default: 0;
 *  Mode: Host and Device
 *  SRP-Capable (SRPCap)
 *  The application uses this bit to control the controller's SRP capabilities. If the
 *  core operates as a non-SRP-capable B-device, it cannot request the connected
 *  A-device (host) to
 *  activate VBUS and start a session.
 *  - 1'b0: SRP capability is not enabled.
 *  - 1'b1: SRP capability is enabled.
 *  If SRP functionality is disabled by the software, the OTG signals on the PHY domain
 *  must be tied to the appropriate values.
 */
#define USB_OTGFS_GUSBCFG_SRPCAP    (BIT(8))
#define USB_OTGFS_GUSBCFG_SRPCAP_M  (USB_OTGFS_GUSBCFG_SRPCAP_V << USB_OTGFS_GUSBCFG_SRPCAP_S)
#define USB_OTGFS_GUSBCFG_SRPCAP_V  0x00000001U
#define USB_OTGFS_GUSBCFG_SRPCAP_S  8
/** USB_OTGFS_GUSBCFG_HNPCAP : R/W; bitpos: [9]; default: 0;
 *  Mode: Host and Device
 *  HNP-Capable (HNPCap)
 *  The application uses this bit to control the controller's HNP capabilities.
 *  - 1'b0: HNP capability is not enabled.
 *  - 1'b1: HNP capability is enabled.
 *  If HNP functionality is disabled by the software, the OTG signals on the PHY domain
 *  must be tied to the appropriate values.
 */
#define USB_OTGFS_GUSBCFG_HNPCAP    (BIT(9))
#define USB_OTGFS_GUSBCFG_HNPCAP_M  (USB_OTGFS_GUSBCFG_HNPCAP_V << USB_OTGFS_GUSBCFG_HNPCAP_S)
#define USB_OTGFS_GUSBCFG_HNPCAP_V  0x00000001U
#define USB_OTGFS_GUSBCFG_HNPCAP_S  9
/** USB_OTGFS_GUSBCFG_USBTRDTIM : R/W; bitpos: [13:10]; default: 5;
 *  Mode: Device only
 *  USB Turnaround Time (USBTrdTim)
 *  Sets the turnaround time in PHY clocks. Specifies the response time for a MAC
 *  request to the Packet FIFO Controller (PFC) to fetch data from the DFIFO (SPRAM).
 *  This must be programmed to
 *  - 4'h5: When the MAC interface is 16-bit UTMI+ .
 *  - 4'h9: When the MAC interface is 8-bit UTMI+ .
 *  Note: The previous values are calculated for the minimum AHB frequency of 30 MHz.
 *  USB turnaround time is critical for certification where long cables and 5-Hubs are
 *  used. If you need the AHB to run at less than 30 MHz, and if USB turnaround time is
 *  not critical, these bits can be programmed to a larger value.
 */
#define USB_OTGFS_GUSBCFG_USBTRDTIM    0x0000000FU
#define USB_OTGFS_GUSBCFG_USBTRDTIM_M  (USB_OTGFS_GUSBCFG_USBTRDTIM_V << USB_OTGFS_GUSBCFG_USBTRDTIM_S)
#define USB_OTGFS_GUSBCFG_USBTRDTIM_V  0x0000000FU
#define USB_OTGFS_GUSBCFG_USBTRDTIM_S  10
/** USB_OTGFS_GUSBCFG_TERMSELDLPULSE : RO; bitpos: [22]; default: 0;
 *  Mode: Device only
 *  TermSel DLine Pulsing Selection (TermSelDLPulse)
 *  This bit selects utmi_termselect to drive data line pulse during SRP.
 *  - 1'b0: Data line pulsing using utmi_txvalid (Default).
 *  - 1'b1: Data line pulsing using utmi_termsel.
 */
#define USB_OTGFS_GUSBCFG_TERMSELDLPULSE    (BIT(22))
#define USB_OTGFS_GUSBCFG_TERMSELDLPULSE_M  (USB_OTGFS_GUSBCFG_TERMSELDLPULSE_V << USB_OTGFS_GUSBCFG_TERMSELDLPULSE_S)
#define USB_OTGFS_GUSBCFG_TERMSELDLPULSE_V  0x00000001U
#define USB_OTGFS_GUSBCFG_TERMSELDLPULSE_S  22
/** USB_OTGFS_GUSBCFG_IC_USBCAP : RO; bitpos: [26]; default: 0;
 *  Mode: Host and Device
 *  IC_USB-Capable (IC_USBCap)
 *  The application uses this bit to control the core's IC_USB capabilities.
 *  - 1'b0: IC_USB PHY Interface is not selected.
 *  - 1'b1: IC_USB PHY Interface is selected.
 *  This bit is writable only if OTG_ENABLE_IC_USB=1 and OTG_FSPHY_INTERFACE!=0.
 *  The reset value depends on the configuration parameter OTG_SELECT_IC_USB when
 *  OTG_ENABLE_IC_USB = 1. In all other cases, this bit is set to 1'b0 and the bit is
 *  read only.
 */
#define USB_OTGFS_GUSBCFG_IC_USBCAP    (BIT(26))
#define USB_OTGFS_GUSBCFG_IC_USBCAP_M  (USB_OTGFS_GUSBCFG_IC_USBCAP_V << USB_OTGFS_GUSBCFG_IC_USBCAP_S)
#define USB_OTGFS_GUSBCFG_IC_USBCAP_V  0x00000001U
#define USB_OTGFS_GUSBCFG_IC_USBCAP_S  26
/** USB_OTGFS_GUSBCFG_TXENDDELAY : R/W; bitpos: [28]; default: 0;
 *  Mode: Device only
 *  Tx End Delay (TxEndDelay)
 *  Writing 1'b1 to this bit enables the controller to follow the TxEndDelay timings as
 *  per UTMI+ specification 1.05 section 4.1.5 for opmode signal during remote wakeup.
 *  - 1'b0 : Normal Mode.
 *  - 1'b1 : Tx End delay.
 */
#define USB_OTGFS_GUSBCFG_TXENDDELAY    (BIT(28))
#define USB_OTGFS_GUSBCFG_TXENDDELAY_M  (USB_OTGFS_GUSBCFG_TXENDDELAY_V << USB_OTGFS_GUSBCFG_TXENDDELAY_S)
#define USB_OTGFS_GUSBCFG_TXENDDELAY_V  0x00000001U
#define USB_OTGFS_GUSBCFG_TXENDDELAY_S  28
/** USB_OTGFS_GUSBCFG_FORCEHSTMODE : R/W; bitpos: [29]; default: 0;
 *  Mode: Host and device
 *  Force Host Mode (ForceHstMode)
 *  Writing a 1 to this bit forces the core to host mode irrespective of utmiotg_iddig
 *  input pin.
 *  - 1'b0 : Normal Mode.
 *  - 1'b1 : Force Host Mode.
 *  After setting the force bit, the application must wait at least 25 ms before the
 *  change to take effect. When the simulation is in scale down mode, waiting for 500
 *  micro sec is sufficient. This bit is valid only when OTG_MODE = 0, 1 or 2. In all
 *  other cases, this bit reads 0.
 */
#define USB_OTGFS_GUSBCFG_FORCEHSTMODE    (BIT(29))
#define USB_OTGFS_GUSBCFG_FORCEHSTMODE_M  (USB_OTGFS_GUSBCFG_FORCEHSTMODE_V << USB_OTGFS_GUSBCFG_FORCEHSTMODE_S)
#define USB_OTGFS_GUSBCFG_FORCEHSTMODE_V  0x00000001U
#define USB_OTGFS_GUSBCFG_FORCEHSTMODE_S  29
/** USB_OTGFS_GUSBCFG_FORCEDEVMODE : R/W; bitpos: [30]; default: 0;
 *  Mode:Host and device
 *  Force Device Mode (ForceDevMode)
 *  Writing a 1 to this bit forces the controller to device mode irrespective of
 *  utmiotg_iddig input pin.
 *  - 1'b0 : Normal Mode.
 *  - 1'b1 : Force Device Mode.
 *  After setting the force bit, the application must wait at least 25 ms before the
 *  change to take effect. When the simulation is in scale down mode, waiting for 500
 *  micro sec is sufficient. This bit is valid only when OTG_MODE = 0, 1 or 2. In all
 *  other cases, this bit reads 0.
 */
#define USB_OTGFS_GUSBCFG_FORCEDEVMODE    (BIT(30))
#define USB_OTGFS_GUSBCFG_FORCEDEVMODE_M  (USB_OTGFS_GUSBCFG_FORCEDEVMODE_V << USB_OTGFS_GUSBCFG_FORCEDEVMODE_S)
#define USB_OTGFS_GUSBCFG_FORCEDEVMODE_V  0x00000001U
#define USB_OTGFS_GUSBCFG_FORCEDEVMODE_S  30
/** USB_OTGFS_GUSBCFG_CORRUPTTXPKT : R/W; bitpos: [31]; default: 0;
 *  Mode: Host and device
 *  Corrupt Tx packet (CorruptTxPkt)
 *  This bit is for debug purposes only. Never Set this bit to 1. The application
 *  should always write 1'b0 to this bit.
 */
#define USB_OTGFS_GUSBCFG_CORRUPTTXPKT    (BIT(31))
#define USB_OTGFS_GUSBCFG_CORRUPTTXPKT_M  (USB_OTGFS_GUSBCFG_CORRUPTTXPKT_V << USB_OTGFS_GUSBCFG_CORRUPTTXPKT_S)
#define USB_OTGFS_GUSBCFG_CORRUPTTXPKT_V  0x00000001U
#define USB_OTGFS_GUSBCFG_CORRUPTTXPKT_S  31

