espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_GINTMSK_REG register
 *  Interrupt Mask Register This register works with the Interrupt Register (GINTSTS)
 *  to interrupt the application. When an interrupt bit is masked, the interrupt
 *  associated with that bit is not generated. However, the GINTSTS register bit
 *  corresponding to that interrupt is still set.  Note: The fields of this register
 *  change depending on host or device mode.
 */
#define USB_OTGFS_GINTMSK_REG(i) (DR_REG_USB_BASE(i) + 0x18)
/** USB_OTGFS_GINTMSK_MODEMISMSK : R/W; bitpos: [1]; default: 0;
 *  Mode: Host and Device
 *  Mode Mismatch Interrupt Mask (ModeMisMsk)
 */
#define USB_OTGFS_GINTMSK_MODEMISMSK    (BIT(1))
#define USB_OTGFS_GINTMSK_MODEMISMSK_M  (USB_OTGFS_GINTMSK_MODEMISMSK_V << USB_OTGFS_GINTMSK_MODEMISMSK_S)
#define USB_OTGFS_GINTMSK_MODEMISMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_MODEMISMSK_S  1
/** USB_OTGFS_GINTMSK_OTGINTMSK : R/W; bitpos: [2]; default: 0;
 *  Mode: Host and Device
 *  OTG Interrupt Mask (OTGIntMsk)
 */
#define USB_OTGFS_GINTMSK_OTGINTMSK    (BIT(2))
#define USB_OTGFS_GINTMSK_OTGINTMSK_M  (USB_OTGFS_GINTMSK_OTGINTMSK_V << USB_OTGFS_GINTMSK_OTGINTMSK_S)
#define USB_OTGFS_GINTMSK_OTGINTMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_OTGINTMSK_S  2
/** USB_OTGFS_GINTMSK_SOFMSK : R/W; bitpos: [3]; default: 0;
 *  Mode: Host and Device
 *  Start of (micro)Frame Mask (SofMsk)
 */
#define USB_OTGFS_GINTMSK_SOFMSK    (BIT(3))
#define USB_OTGFS_GINTMSK_SOFMSK_M  (USB_OTGFS_GINTMSK_SOFMSK_V << USB_OTGFS_GINTMSK_SOFMSK_S)
#define USB_OTGFS_GINTMSK_SOFMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_SOFMSK_S  3
/** USB_OTGFS_GINTMSK_RXFLVLMSK : R/W; bitpos: [4]; default: 0;
 *  Mode: Host and Device
 *  Receive FIFO Non-Empty Mask (RxFLvlMsk)
 */
#define USB_OTGFS_GINTMSK_RXFLVLMSK    (BIT(4))
#define USB_OTGFS_GINTMSK_RXFLVLMSK_M  (USB_OTGFS_GINTMSK_RXFLVLMSK_V << USB_OTGFS_GINTMSK_RXFLVLMSK_S)
#define USB_OTGFS_GINTMSK_RXFLVLMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_RXFLVLMSK_S  4
/** USB_OTGFS_GINTMSK_NPTXFEMPMSK : R/W; bitpos: [5]; default: 0;
 *  Mode: Host and Device
 *  Non-periodic TxFIFO Empty Mask (NPTxFEmpMsk)
 */
#define USB_OTGFS_GINTMSK_NPTXFEMPMSK    (BIT(5))
#define USB_OTGFS_GINTMSK_NPTXFEMPMSK_M  (USB_OTGFS_GINTMSK_NPTXFEMPMSK_V << USB_OTGFS_GINTMSK_NPTXFEMPMSK_S)
#define USB_OTGFS_GINTMSK_NPTXFEMPMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_NPTXFEMPMSK_S  5
/** USB_OTGFS_GINTMSK_GINNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  Mode: Device only,
 *  Global Non-periodic IN NAK Effective Mask (GINNakEffMsk)
 */
#define USB_OTGFS_GINTMSK_GINNAKEFFMSK    (BIT(6))
#define USB_OTGFS_GINTMSK_GINNAKEFFMSK_M  (USB_OTGFS_GINTMSK_GINNAKEFFMSK_V << USB_OTGFS_GINTMSK_GINNAKEFFMSK_S)
#define USB_OTGFS_GINTMSK_GINNAKEFFMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_GINNAKEFFMSK_S  6
/** USB_OTGFS_GINTMSK_GOUTNAKEFFMSK : R/W; bitpos: [7]; default: 0;
 *  Mode: Device only
 *  Global OUT NAK Effective Mask (GOUTNakEffMsk)
 */
#define USB_OTGFS_GINTMSK_GOUTNAKEFFMSK    (BIT(7))
#define USB_OTGFS_GINTMSK_GOUTNAKEFFMSK_M  (USB_OTGFS_GINTMSK_GOUTNAKEFFMSK_V << USB_OTGFS_GINTMSK_GOUTNAKEFFMSK_S)
#define USB_OTGFS_GINTMSK_GOUTNAKEFFMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_GOUTNAKEFFMSK_S  7
/** USB_OTGFS_GINTMSK_ERLYSUSPMSK : R/W; bitpos: [10]; default: 0;
 *  Mode: Device only
 *  Early Suspend Mask (ErlySuspMsk)
 */
#define USB_OTGFS_GINTMSK_ERLYSUSPMSK    (BIT(10))
#define USB_OTGFS_GINTMSK_ERLYSUSPMSK_M  (USB_OTGFS_GINTMSK_ERLYSUSPMSK_V << USB_OTGFS_GINTMSK_ERLYSUSPMSK_S)
#define USB_OTGFS_GINTMSK_ERLYSUSPMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_ERLYSUSPMSK_S  10
/** USB_OTGFS_GINTMSK_USBSUSPMSK : R/W; bitpos: [11]; default: 0;
 *  Mode: Device only
 *  USB Suspend Mask (USBSuspMsk)
 */
#define USB_OTGFS_GINTMSK_USBSUSPMSK    (BIT(11))
#define USB_OTGFS_GINTMSK_USBSUSPMSK_M  (USB_OTGFS_GINTMSK_USBSUSPMSK_V << USB_OTGFS_GINTMSK_USBSUSPMSK_S)
#define USB_OTGFS_GINTMSK_USBSUSPMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_USBSUSPMSK_S  11
/** USB_OTGFS_GINTMSK_USBRSTMSK : R/W; bitpos: [12]; default: 0;
 *  Mode: Device only
 *  USB Reset Mask (USBRstMsk)
 */
#define USB_OTGFS_GINTMSK_USBRSTMSK    (BIT(12))
#define USB_OTGFS_GINTMSK_USBRSTMSK_M  (USB_OTGFS_GINTMSK_USBRSTMSK_V << USB_OTGFS_GINTMSK_USBRSTMSK_S)
#define USB_OTGFS_GINTMSK_USBRSTMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_USBRSTMSK_S  12
/** USB_OTGFS_GINTMSK_ENUMDONEMSK : R/W; bitpos: [13]; default: 0;
 *  Mode: Device only
 *  Enumeration Done Mask (EnumDoneMsk)
 */
#define USB_OTGFS_GINTMSK_ENUMDONEMSK    (BIT(13))
#define USB_OTGFS_GINTMSK_ENUMDONEMSK_M  (USB_OTGFS_GINTMSK_ENUMDONEMSK_V << USB_OTGFS_GINTMSK_ENUMDONEMSK_S)
#define USB_OTGFS_GINTMSK_ENUMDONEMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_ENUMDONEMSK_S  13
/** USB_OTGFS_GINTMSK_ISOOUTDROPMSK : R/W; bitpos: [14]; default: 0;
 *  Mode: Device only
 *  Isochronous OUT Packet Dropped Interrupt Mask (ISOOutDropMsk)
 */
#define USB_OTGFS_GINTMSK_ISOOUTDROPMSK    (BIT(14))
#define USB_OTGFS_GINTMSK_ISOOUTDROPMSK_M  (USB_OTGFS_GINTMSK_ISOOUTDROPMSK_V << USB_OTGFS_GINTMSK_ISOOUTDROPMSK_S)
#define USB_OTGFS_GINTMSK_ISOOUTDROPMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_ISOOUTDROPMSK_S  14
/** USB_OTGFS_GINTMSK_EOPFMSK : R/W; bitpos: [15]; default: 0;
 *  Mode: Device only
 *  End of Periodic Frame Interrupt Mask (EOPFMsk)
 */
#define USB_OTGFS_GINTMSK_EOPFMSK    (BIT(15))
#define USB_OTGFS_GINTMSK_EOPFMSK_M  (USB_OTGFS_GINTMSK_EOPFMSK_V << USB_OTGFS_GINTMSK_EOPFMSK_S)
#define USB_OTGFS_GINTMSK_EOPFMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_EOPFMSK_S  15
/** USB_OTGFS_GINTMSK_EPMISMSK : R/W; bitpos: [17]; default: 0;
 *  Mode: Device only
 *  Endpoint Mismatch Interrupt Mask (EPMisMsk)
 */
#define USB_OTGFS_GINTMSK_EPMISMSK    (BIT(17))
#define USB_OTGFS_GINTMSK_EPMISMSK_M  (USB_OTGFS_GINTMSK_EPMISMSK_V << USB_OTGFS_GINTMSK_EPMISMSK_S)
#define USB_OTGFS_GINTMSK_EPMISMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_EPMISMSK_S  17
/** USB_OTGFS_GINTMSK_IEPINTMSK : R/W; bitpos: [18]; default: 0;
 *  Mode: Device only
 *  IN Endpoints Interrupt Mask (IEPIntMsk)
 */
#define USB_OTGFS_GINTMSK_IEPINTMSK    (BIT(18))
#define USB_OTGFS_GINTMSK_IEPINTMSK_M  (USB_OTGFS_GINTMSK_IEPINTMSK_V << USB_OTGFS_GINTMSK_IEPINTMSK_S)
#define USB_OTGFS_GINTMSK_IEPINTMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_IEPINTMSK_S  18
/** USB_OTGFS_GINTMSK_OEPINTMSK : R/W; bitpos: [19]; default: 0;
 *  Mode: Device only
 *  OUT Endpoints Interrupt Mask (OEPIntMsk)
 */
#define USB_OTGFS_GINTMSK_OEPINTMSK    (BIT(19))
#define USB_OTGFS_GINTMSK_OEPINTMSK_M  (USB_OTGFS_GINTMSK_OEPINTMSK_V << USB_OTGFS_GINTMSK_OEPINTMSK_S)
#define USB_OTGFS_GINTMSK_OEPINTMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_OEPINTMSK_S  19
/** USB_OTGFS_GINTMSK_INCOMPLPMSK : R/W; bitpos: [21]; default: 0;
 *  Incomplete Periodic Transfer Mask (incomplPMsk)
 *  Mode: Host only
 *  Incomplete Isochronous OUT Transfer Interrupt Mask (incompISOOUTMsk)
 *  Mode: Device only
 */
#define USB_OTGFS_GINTMSK_INCOMPLPMSK    (BIT(21))
#define USB_OTGFS_GINTMSK_INCOMPLPMSK_M  (USB_OTGFS_GINTMSK_INCOMPLPMSK_V << USB_OTGFS_GINTMSK_INCOMPLPMSK_S)
#define USB_OTGFS_GINTMSK_INCOMPLPMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_INCOMPLPMSK_S  21
/** USB_OTGFS_GINTMSK_FETSUSPMSK : R/W; bitpos: [22]; default: 0;
 *  Mode: Device only
 *  Data Fetch Suspended Mask (FetSuspMsk)
 */
#define USB_OTGFS_GINTMSK_FETSUSPMSK    (BIT(22))
#define USB_OTGFS_GINTMSK_FETSUSPMSK_M  (USB_OTGFS_GINTMSK_FETSUSPMSK_V << USB_OTGFS_GINTMSK_FETSUSPMSK_S)
#define USB_OTGFS_GINTMSK_FETSUSPMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_FETSUSPMSK_S  22
/** USB_OTGFS_GINTMSK_RESETDETMSK : R/W; bitpos: [23]; default: 0;
 *  Mode: Device only
 *  Reset detected Interrupt Mask (ResetDetMsk)
 */
#define USB_OTGFS_GINTMSK_RESETDETMSK    (BIT(23))
#define USB_OTGFS_GINTMSK_RESETDETMSK_M  (USB_OTGFS_GINTMSK_RESETDETMSK_V << USB_OTGFS_GINTMSK_RESETDETMSK_S)
#define USB_OTGFS_GINTMSK_RESETDETMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_RESETDETMSK_S  23
/** USB_OTGFS_GINTMSK_PRTINTMSK : R/W; bitpos: [24]; default: 0;
 *  Mode: Host only
 *  Host Port Interrupt Mask (PrtIntMsk)
 */
#define USB_OTGFS_GINTMSK_PRTINTMSK    (BIT(24))
#define USB_OTGFS_GINTMSK_PRTINTMSK_M  (USB_OTGFS_GINTMSK_PRTINTMSK_V << USB_OTGFS_GINTMSK_PRTINTMSK_S)
#define USB_OTGFS_GINTMSK_PRTINTMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_PRTINTMSK_S  24
/** USB_OTGFS_GINTMSK_HCHINTMSK : R/W; bitpos: [25]; default: 0;
 *  Mode: Host only
 *  Host Channels Interrupt Mask (HChIntMsk)
 */
#define USB_OTGFS_GINTMSK_HCHINTMSK    (BIT(25))
#define USB_OTGFS_GINTMSK_HCHINTMSK_M  (USB_OTGFS_GINTMSK_HCHINTMSK_V << USB_OTGFS_GINTMSK_HCHINTMSK_S)
#define USB_OTGFS_GINTMSK_HCHINTMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_HCHINTMSK_S  25
/** USB_OTGFS_GINTMSK_PTXFEMPMSK : R/W; bitpos: [26]; default: 0;
 *  Mode: Host only
 *  Periodic TxFIFO Empty Mask (PTxFEmpMsk)
 */
#define USB_OTGFS_GINTMSK_PTXFEMPMSK    (BIT(26))
#define USB_OTGFS_GINTMSK_PTXFEMPMSK_M  (USB_OTGFS_GINTMSK_PTXFEMPMSK_V << USB_OTGFS_GINTMSK_PTXFEMPMSK_S)
#define USB_OTGFS_GINTMSK_PTXFEMPMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_PTXFEMPMSK_S  26
/** USB_OTGFS_GINTMSK_CONIDSTSCHNGMSK : R/W; bitpos: [28]; default: 0;
 *  Mode: Host and Device
 *  Connector ID Status Change Mask (ConIDStsChngMsk)
 */
#define USB_OTGFS_GINTMSK_CONIDSTSCHNGMSK    (BIT(28))
#define USB_OTGFS_GINTMSK_CONIDSTSCHNGMSK_M  (USB_OTGFS_GINTMSK_CONIDSTSCHNGMSK_V << USB_OTGFS_GINTMSK_CONIDSTSCHNGMSK_S)
#define USB_OTGFS_GINTMSK_CONIDSTSCHNGMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_CONIDSTSCHNGMSK_S  28
/** USB_OTGFS_GINTMSK_DISCONNINTMSK : R/W; bitpos: [29]; default: 0;
 *  Mode: Host and Device
 *  Disconnect Detected Interrupt Mask (DisconnIntMsk)
 */
#define USB_OTGFS_GINTMSK_DISCONNINTMSK    (BIT(29))
#define USB_OTGFS_GINTMSK_DISCONNINTMSK_M  (USB_OTGFS_GINTMSK_DISCONNINTMSK_V << USB_OTGFS_GINTMSK_DISCONNINTMSK_S)
#define USB_OTGFS_GINTMSK_DISCONNINTMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_DISCONNINTMSK_S  29
/** USB_OTGFS_GINTMSK_SESSREQINTMSK : R/W; bitpos: [30]; default: 0;
 *  Mode: Host and Device
 *  Session Request/New Session Detected Interrupt Mask (SessReqIntMsk)
 */
#define USB_OTGFS_GINTMSK_SESSREQINTMSK    (BIT(30))
#define USB_OTGFS_GINTMSK_SESSREQINTMSK_M  (USB_OTGFS_GINTMSK_SESSREQINTMSK_V << USB_OTGFS_GINTMSK_SESSREQINTMSK_S)
#define USB_OTGFS_GINTMSK_SESSREQINTMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_SESSREQINTMSK_S  30
/** USB_OTGFS_GINTMSK_WKUPINTMSK : R/W; bitpos: [31]; default: 0;
 *  Mode: Host and Device
 *  Resume/Remote Wakeup Detected Interrupt Mask (WkUpIntMsk)
 *  The WakeUp bit is used for LPM state wake up in a way similar to that of wake up in
 *  suspend state.
 */
#define USB_OTGFS_GINTMSK_WKUPINTMSK    (BIT(31))
#define USB_OTGFS_GINTMSK_WKUPINTMSK_M  (USB_OTGFS_GINTMSK_WKUPINTMSK_V << USB_OTGFS_GINTMSK_WKUPINTMSK_S)
#define USB_OTGFS_GINTMSK_WKUPINTMSK_V  0x00000001U
#define USB_OTGFS_GINTMSK_WKUPINTMSK_S  31

/** USB_OTGFS_GRXSTSR_REG register
 *  Receive Status Debug Read Register A read to the Receive Status Debug Read register
 *  returns the contents of the top of the Receive FIFO.  The receive status contents
 *  must be interpreted differently in Host and Device modes. The core ignores the
 *  receive status read when the receive FIFO is empty and returns a value of
 *  32'h0000_0000.  Note:  - Use of these fields vary based on whether the core is
 *  functioning as a host or a device.  - Do not read this register's reset value
 *  before configuring the core because the read value is 'X' in the simulation.
 */
#define USB_OTGFS_GRXSTSR_REG(i) (DR_REG_USB_BASE(i) + 0x1c)
/** USB_OTGFS_GRXSTSR_CHNUM : RO; bitpos: [3:0]; default: 0;
 *  Channel Number (ChNum)
 *  Mode: Host only
 *  Indicates the channel number to which the current received packet belongs.
 *  Endpoint Number (EPNum)
 *  Mode: Device only
 *  Indicates the endpoint number to which the current received packet belongs.
 */
#define USB_OTGFS_GRXSTSR_CHNUM    0x0000000FU
#define USB_OTGFS_GRXSTSR_CHNUM_M  (USB_OTGFS_GRXSTSR_CHNUM_V << USB_OTGFS_GRXSTSR_CHNUM_S)
#define USB_OTGFS_GRXSTSR_CHNUM_V  0x0000000FU
#define USB_OTGFS_GRXSTSR_CHNUM_S  0
/** USB_OTGFS_GRXSTSR_BCNT : RO; bitpos: [14:4]; default: 0;
 *  Byte Count (BCnt)
 *
 *  In host mode, indicates the byte count of the received IN data packet.
 *
 *  In device mode, indicates the byte count of the received data packet.
 */
#define USB_OTGFS_GRXSTSR_BCNT    0x000007FFU
#define USB_OTGFS_GRXSTSR_BCNT_M  (USB_OTGFS_GRXSTSR_BCNT_V << USB_OTGFS_GRXSTSR_BCNT_S)
#define USB_OTGFS_GRXSTSR_BCNT_V  0x000007FFU
#define USB_OTGFS_GRXSTSR_BCNT_S  4
/** USB_OTGFS_GRXSTSR_DPID : RO; bitpos: [16:15]; default: 0;
 *  Data PID (DPID)
 *
 *  In host mode, indicates the Data PID of the received packet. In device mode,
 *  indicates the Data PID of the received OUT data packet.
 *  - 2'b00: DATA0
 *  - 2'b10: DATA1
 *  - 2'b01: DATA2
 *  - 2'b11: MDATA
 *  Reset: 2'h0
 */
#define USB_OTGFS_GRXSTSR_DPID    0x00000003U
#define USB_OTGFS_GRXSTSR_DPID_M  (USB_OTGFS_GRXSTSR_DPID_V << USB_OTGFS_GRXSTSR_DPID_S)
#define USB_OTGFS_GRXSTSR_DPID_V  0x00000003U
#define USB_OTGFS_GRXSTSR_DPID_S  15
/** USB_OTGFS_GRXSTSR_PKTSTS : RO; bitpos: [20:17]; default: 0;
 *  Packet Status (PktSts) indicates the status of the received packet.
 *  In host mode,
 *  - 4'b0010: IN data packet received
 *  - 4'b0011: IN transfer completed (triggers an interrupt)
 *  - 4'b0101: Data toggle error (triggers an interrupt)
 *  - 4'b0111: Channel halted (triggers an interrupt)
 *  - Others: Reserved
 *  Reset:4'b0
 *
 *  In device mode,
 *  - 4'b0001: Global OUT NAK (triggers an interrupt)
 *  - 4'b0010: OUT data packet received
 *  - 4'b0011: OUT transfer completed (triggers an interrupt)
 *  - 4'b0100: SETUP transaction completed (triggers an interrupt)
 *  - 4'b0110: SETUP data packet received
 *  - Others: Reserved
 *  Reset:4'h0
 */
#define USB_OTGFS_GRXSTSR_PKTSTS    0x0000000FU
#define USB_OTGFS_GRXSTSR_PKTSTS_M  (USB_OTGFS_GRXSTSR_PKTSTS_V << USB_OTGFS_GRXSTSR_PKTSTS_S)
#define USB_OTGFS_GRXSTSR_PKTSTS_V  0x0000000FU
#define USB_OTGFS_GRXSTSR_PKTSTS_S  17
/** USB_OTGFS_GRXSTSR_FN : RO; bitpos: [24:21]; default: 0;
 *  Mode: Device only
 *  Frame Number (FN)
 *  This is the least significant 4 bits of the (micro)Frame number in which the packet
 *  is received on the USB. This field is supported only when isochronous OUT endpoints
 *  are supported.
 */
#define USB_OTGFS_GRXSTSR_FN    0x0000000FU
#define USB_OTGFS_GRXSTSR_FN_M  (USB_OTGFS_GRXSTSR_FN_V << USB_OTGFS_GRXSTSR_FN_S)
#define USB_OTGFS_GRXSTSR_FN_V  0x0000000FU
#define USB_OTGFS_GRXSTSR_FN_S  21

/** USB_OTGFS_GRXSTSP_REG register
 *  Receive Status Read/Pop Register A read to the Receive Status Read and Pop register
 *  returns the contents of the top of the Receive FIFO and additionally pops the top
 *  data entry out of the RxFIFO. The receive status contents must be interpreted
 *  differently in Host and Device modes. The core ignores the receive status pop/read
 *  when the receive FIFO is empty and returns a value of 32'h0000_0000. The
 *  application must only pop the Receive Status FIFO when the Receive FIFO Non-Empty
 *  bit of the Core Interrupt register (GINTSTS.RxFLvl) is asserted.  Note:  - Use of
 *  these fields vary based on whether the core is functioning as a host or a device.
 *  - Do not read this register's reset value before configuring the core because the
 *  read value is 'X' in the simulation.
 */
#define USB_OTGFS_GRXSTSP_REG(i) (DR_REG_USB_BASE(i) + 0x20)
/** USB_OTGFS_GRXSTSP_CHNUM : RO; bitpos: [3:0]; default: 0;
 *  Channel Number (ChNum)
 *  Mode: Host only
 *  Indicates the channel number to which the current received packet belongs.
 *  Endpoint Number (EPNum)
 *  Mode: Device only
 *  Indicates the endpoint number to which the current received packet belongs.
 */
#define USB_OTGFS_GRXSTSP_CHNUM    0x0000000FU
#define USB_OTGFS_GRXSTSP_CHNUM_M  (USB_OTGFS_GRXSTSP_CHNUM_V << USB_OTGFS_GRXSTSP_CHNUM_S)
#define USB_OTGFS_GRXSTSP_CHNUM_V  0x0000000FU
#define USB_OTGFS_GRXSTSP_CHNUM_S  0
/** USB_OTGFS_GRXSTSP_BCNT : RO; bitpos: [14:4]; default: 0;
 *  Byte Count (BCnt)
 *
 *  In host mode, indicates the byte count of the received IN data packet.
 *
 *  In device mode, indicates the byte count of the received data packet.
 */
#define USB_OTGFS_GRXSTSP_BCNT    0x000007FFU
#define USB_OTGFS_GRXSTSP_BCNT_M  (USB_OTGFS_GRXSTSP_BCNT_V << USB_OTGFS_GRXSTSP_BCNT_S)
#define USB_OTGFS_GRXSTSP_BCNT_V  0x000007FFU
#define USB_OTGFS_GRXSTSP_BCNT_S  4
/** USB_OTGFS_GRXSTSP_DPID : RO; bitpos: [16:15]; default: 0;
 *  Data PID (DPID)
 *
 *  In host mode, indicates the Data PID of the received packet. In device mode,
 *  indicates the Data PID of the received OUT data packet.
 *  - 2'b00: DATA0
 *  - 2'b10: DATA1
 *  - 2'b01: DATA2
 *  - 2'b11: MDATA
 *  Reset: 2'h0
 */
#define USB_OTGFS_GRXSTSP_DPID    0x00000003U
#define USB_OTGFS_GRXSTSP_DPID_M  (USB_OTGFS_GRXSTSP_DPID_V << USB_OTGFS_GRXSTSP_DPID_S)
#define USB_OTGFS_GRXSTSP_DPID_V  0x00000003U
#define USB_OTGFS_GRXSTSP_DPID_S  15
/** USB_OTGFS_GRXSTSP_PKTSTS : RO; bitpos: [20:17]; default: 0;
 *  Packet Status (PktSts) indicates the status of the received packet.
 *  In host mode,
 *  - 4'b0010: IN data packet received
 *  - 4'b0011: IN transfer completed (triggers an interrupt)
 *  - 4'b0101: Data toggle error (triggers an interrupt)
 *  - 4'b0111: Channel halted (triggers an interrupt)
 *  - Others: Reserved
 *  Reset:4'b0
 *
 *  In device mode,
 *  - 4'b0001: Global OUT NAK (triggers an interrupt)
 *  - 4'b0010: OUT data packet received
 *  - 4'b0011: OUT transfer completed (triggers an interrupt)
 *  - 4'b0100: SETUP transaction completed (triggers an interrupt)
 *  - 4'b0110: SETUP data packet received
 *  - Others: Reserved
 *  Reset:4'h0
 */
#define USB_OTGFS_GRXSTSP_PKTSTS    0x0000000FU
#define USB_OTGFS_GRXSTSP_PKTSTS_M  (USB_OTGFS_GRXSTSP_PKTSTS_V << USB_OTGFS_GRXSTSP_PKTSTS_S)
#define USB_OTGFS_GRXSTSP_PKTSTS_V  0x0000000FU
#define USB_OTGFS_GRXSTSP_PKTSTS_S  17
/** USB_OTGFS_GRXSTSP_FN : RO; bitpos: [24:21]; default: 0;
 *  Mode: Device only
 *  Frame Number (FN)
 *  This is the least significant 4 bits of the (micro)Frame number in which the packet
 *  is received on the USB. This field is supported only when isochronous OUT endpoints
 *  are supported.
 */
#define USB_OTGFS_GRXSTSP_FN    0x0000000FU
#define USB_OTGFS_GRXSTSP_FN_M  (USB_OTGFS_GRXSTSP_FN_V << USB_OTGFS_GRXSTSP_FN_S)
#define USB_OTGFS_GRXSTSP_FN_V  0x0000000FU
#define USB_OTGFS_GRXSTSP_FN_S  21

/** USB_OTGFS_GRXFSIZ_REG register
 *  Receive FIFO Size Register The application can program the RAM size that must be
 *  allocated to the RxFIFO.
 */
#define USB_OTGFS_GRXFSIZ_REG(i) (DR_REG_USB_BASE(i) + 0x24)
/** USB_OTGFS_GRXFSIZ_RXFDEP : R/W; bitpos: [8:0]; default: 256;
 *  Mode: Host and Device
 *  RxFIFO Depth (RxFDep)
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  The power-on reset value of this register is specified as the Largest Rx Data FIFO
 *  Depth during configuration.
 *  If Enable Dynamic FIFO Sizing is selected in coreConsultant, these flops are
 *  optimized, and reads return the power-on value.
 *  If Enable Dynamic FIFO Sizing is selected in coreConsultant, you can write a new
 *  value in this field. Programmed values must not exceed the power-on value.
 */
#define USB_OTGFS_GRXFSIZ_RXFDEP    0x000001FFU
#define USB_OTGFS_GRXFSIZ_RXFDEP_M  (USB_OTGFS_GRXFSIZ_RXFDEP_V << USB_OTGFS_GRXFSIZ_RXFDEP_S)
#define USB_OTGFS_GRXFSIZ_RXFDEP_V  0x000001FFU
#define USB_OTGFS_GRXFSIZ_RXFDEP_S  0

/** USB_OTGFS_GNPTXFSIZ_REG register
 *  Non-periodic Transmit FIFO Size Register The application can program the RAM size
 *  and the memory start address for the Non-periodic TxFIFO  Note: The fields of this
 *  register change depending on host or device mode.
 */
#define USB_OTGFS_GNPTXFSIZ_REG(i) (DR_REG_USB_BASE(i) + 0x28)
/** USB_OTGFS_GNPTXFSIZ_NPTXFSTADDR : R/W; bitpos: [8:0]; default: 256;
 *  Non-periodic Transmit RAM Start Address (NPTxFStAddr)
 *  For host mode, this field is always valid.
 *  This field contains the memory start address for Non-periodic Transmit FIFO RAM.
 *  - This field is determined during coreConsultant configuration by Enable Dynamic
 *  FIFO Sizing? (OTG_DFIFO_DYNAMIC):OTG_DFIFO_DYNAMIC = 0
 *  These flops are optimized, and reads return the power-on value.
 *  - OTG_DFIFO_DYNAMIC = 1 The application can write a new value in this field.
 *  Programmed values must not exceed the power-on value set in coreConsultant.
 *  Programmed values must not exceed the power-on value set in coreConsultant.
 *  The power-on reset value of this field is specified during coreConsultant
 *  configuration by Largest Rx Data FIFO Depth (parameter OTG_RX_DFIFO_DEPTH).
 */
#define USB_OTGFS_GNPTXFSIZ_NPTXFSTADDR    0x000001FFU
#define USB_OTGFS_GNPTXFSIZ_NPTXFSTADDR_M  (USB_OTGFS_GNPTXFSIZ_NPTXFSTADDR_V << USB_OTGFS_GNPTXFSIZ_NPTXFSTADDR_S)
#define USB_OTGFS_GNPTXFSIZ_NPTXFSTADDR_V  0x000001FFU
#define USB_OTGFS_GNPTXFSIZ_NPTXFSTADDR_S  0
/** USB_OTGFS_GNPTXFSIZ_NPTXFDEP : R/W; bitpos: [24:16]; default: 256;
 *  Mode: Host only
 *  Non-periodic TxFIFO Depth (NPTxFDep)
 *  For host mode, this field is always valid.
 *  For device mode, this field is valid only when OTG_EN_DED_TX_FIFO=0.
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  This attribute of field is determined during coreConsultant configuration by Enable
 *  Dynamic FIFO Sizing? (OTG_DFIFO_DYNAMIC):
 *  - OTG_DFIFO_DYNAMIC = 0: These flops are optimized, and reads return the power-on
 *  value.
 *  - OTG_DFIFO_DYNAMIC = 1: The application can write a new value in this field.
 *  Programmed values must not exceed the power-on value set in coreConsultant.
 *  The power-on reset value of this field is specified during coreConsultant
 *  configuration as Largest IN Endpoint FIFO 0 Depth (parameter
 *  OTG_TX_DINEP_DFIFO_DEPTH_0).
 */
#define USB_OTGFS_GNPTXFSIZ_NPTXFDEP    0x000001FFU
#define USB_OTGFS_GNPTXFSIZ_NPTXFDEP_M  (USB_OTGFS_GNPTXFSIZ_NPTXFDEP_V << USB_OTGFS_GNPTXFSIZ_NPTXFDEP_S)
#define USB_OTGFS_GNPTXFSIZ_NPTXFDEP_V  0x000001FFU
#define USB_OTGFS_GNPTXFSIZ_NPTXFDEP_S  16

