espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_GNPTXSTS_REG register
 *  Non-periodic Transmit FIFO/Queue Status Register In Device mode, this register is
 *  valid only in Shared FIFO operation. This read-only register contains the free
 *  space information for the Non-periodic TxFIFO and the Non-periodic Transmit Request
 *  Queue.
 */
#define USB_OTGFS_GNPTXSTS_REG(i) (DR_REG_USB_BASE(i) + 0x2c)
/** USB_OTGFS_GNPTXSTS_NPTXFSPCAVAIL : RO; bitpos: [15:0]; default: 256;
 *  Non-periodic TxFIFO Space Avail (NPTxFSpcAvail)
 *  Indicates the amount of free space available in the Non-periodic TxFIFO.
 *  Values are in terms of 32-bit words.
 *  - 16'h0: Non-periodic TxFIFO is full
 *  - 16'h1: 1 word available
 *  - 16'h2: 2 words available
 *  - 16'hn: n words available (where 0 <= n <= 32,768)
 *  - 16'h8000: 32,768 words available
 *  - Others: Reserved
 *  Reset: Configurable
 */
#define USB_OTGFS_GNPTXSTS_NPTXFSPCAVAIL    0x0000FFFFU
#define USB_OTGFS_GNPTXSTS_NPTXFSPCAVAIL_M  (USB_OTGFS_GNPTXSTS_NPTXFSPCAVAIL_V << USB_OTGFS_GNPTXSTS_NPTXFSPCAVAIL_S)
#define USB_OTGFS_GNPTXSTS_NPTXFSPCAVAIL_V  0x0000FFFFU
#define USB_OTGFS_GNPTXSTS_NPTXFSPCAVAIL_S  0
/** USB_OTGFS_GNPTXSTS_NPTXQSPCAVAIL : RO; bitpos: [23:16]; default: 4;
 *  Non-periodic Transmit Request Queue Space Available (NPTxQSpcAvail)
 *  Indicates the amount of free space available in the Non-periodic Transmit Request
 *  Queue. This queue holds both IN and OUT requests in Host mode. Device mode has only
 *  IN requests.
 *  - 8'h0: Non-periodic Transmit Request Queue is full
 *  - 8'h1: 1 location available
 *  - 8'h2: 2 locations available
 *  - n: n locations available (0 <= n <= 8)
 *  - Others: Reserved
 *  Reset: Configurable
 */
#define USB_OTGFS_GNPTXSTS_NPTXQSPCAVAIL    0x000000FFU
#define USB_OTGFS_GNPTXSTS_NPTXQSPCAVAIL_M  (USB_OTGFS_GNPTXSTS_NPTXQSPCAVAIL_V << USB_OTGFS_GNPTXSTS_NPTXQSPCAVAIL_S)
#define USB_OTGFS_GNPTXSTS_NPTXQSPCAVAIL_V  0x000000FFU
#define USB_OTGFS_GNPTXSTS_NPTXQSPCAVAIL_S  16
/** USB_OTGFS_GNPTXSTS_NPTXQTOP : RO; bitpos: [30:24]; default: 0;
 *  Top of the Non-periodic Transmit Request Queue (NPTxQTop)
 *  Entry in the Non-periodic Tx Request Queue that is currently being processed by the
 *  MAC.
 *
 *  - Bits [30:27]: Channel/endpoint number
 *  - Bits [26:25]:
 *  - 2'b00: IN/OUT token
 *  -- 2'b01: Zero-length transmit packet (device IN/host OUT)
 *  -- 2'b10: PING/CSPLIT token
 *  -- 2'b11: Channel halt command
 *  - Bit [24]: Terminate (last Entry for selected channel/endpoint)
 *  Reset: 7'h0
 */
#define USB_OTGFS_GNPTXSTS_NPTXQTOP    0x0000007FU
#define USB_OTGFS_GNPTXSTS_NPTXQTOP_M  (USB_OTGFS_GNPTXSTS_NPTXQTOP_V << USB_OTGFS_GNPTXSTS_NPTXQTOP_S)
#define USB_OTGFS_GNPTXSTS_NPTXQTOP_V  0x0000007FU
#define USB_OTGFS_GNPTXSTS_NPTXQTOP_S  24

/** USB_OTGFS_GSNPSID_REG register
 *  Synopsis ID Register  This read-only register contains the release number of the
 *  core being used.
 */
#define USB_OTGFS_GSNPSID_REG(i) (DR_REG_USB_BASE(i) + 0x40)
/** USB_OTGFS_GSNPSID_SYNOPSYSID : RO; bitpos: [31:0]; default: 1330921482;
 *  Release number of the controller being used currently.
 */
#define USB_OTGFS_GSNPSID_SYNOPSYSID    0xFFFFFFFFU
#define USB_OTGFS_GSNPSID_SYNOPSYSID_M  (USB_OTGFS_GSNPSID_SYNOPSYSID_V << USB_OTGFS_GSNPSID_SYNOPSYSID_S)
#define USB_OTGFS_GSNPSID_SYNOPSYSID_V  0xFFFFFFFFU
#define USB_OTGFS_GSNPSID_SYNOPSYSID_S  0

/** USB_OTGFS_GHWCFG1_REG register
 *  User Hardware Configuration 1 Register  This register contains the logical endpoint
 *  direction(s) selected using coreConsultant.
 */
#define USB_OTGFS_GHWCFG1_REG(i) (DR_REG_USB_BASE(i) + 0x44)
/** USB_OTGFS_GHWCFG1_EPDIR : RO; bitpos: [31:0]; default: 0;
 *  This 32-bit field uses two bits per
 *  endpoint to determine the endpoint direction.
 *
 *  Endpoint
 *  - Bits [31:30]: Endpoint 15 direction
 *  - Bits [29:28]: Endpoint 14 direction
 *  ...
 *  - Bits [3:2]: Endpoint 1 direction
 *  - Bits[1:0]: Endpoint 0 direction (always BIDIR)
 *  Direction
 *  - 2'b00: BIDIR (IN and OUT) endpoint
 *  - 2'b01: IN endpoint
 *  - 2'b10: OUT endpoint
 *  - 2'b11: Reserved
 *  Note: This field is configured using the OTG_EP_DIR_1(n) parameter.
 */
#define USB_OTGFS_GHWCFG1_EPDIR    0xFFFFFFFFU
#define USB_OTGFS_GHWCFG1_EPDIR_M  (USB_OTGFS_GHWCFG1_EPDIR_V << USB_OTGFS_GHWCFG1_EPDIR_S)
#define USB_OTGFS_GHWCFG1_EPDIR_V  0xFFFFFFFFU
#define USB_OTGFS_GHWCFG1_EPDIR_S  0

/** USB_OTGFS_GHWCFG2_REG register
 *  User Hardware Configuration 2 Register  This register contains configuration
 *  options selected using coreConsultant.
 */
#define USB_OTGFS_GHWCFG2_REG(i) (DR_REG_USB_BASE(i) + 0x48)
/** USB_OTGFS_GHWCFG2_OTGMODE : RO; bitpos: [2:0]; default: 0;
 *  Mode of Operation (OtgMode)
 *  - 3'b000: HNP- and SRP-Capable OTG (Host & Device)
 *  - 3'b001: SRP-Capable OTG (Host & Device)
 *  - 3'b010: Non-HNP and Non-SRP Capable OTG (Host and Device)
 *  - 3'b011: SRP-Capable Device
 *  - 3'b100: Non-OTG Device
 *  - 3'b101: SRP-Capable Host
 *  - 3'b110: Non-OTG Host
 *  - Others: Reserved
 *  Note: This field is configured using the OTG_MODE parameter.
 */
#define USB_OTGFS_GHWCFG2_OTGMODE    0x00000007U
#define USB_OTGFS_GHWCFG2_OTGMODE_M  (USB_OTGFS_GHWCFG2_OTGMODE_V << USB_OTGFS_GHWCFG2_OTGMODE_S)
#define USB_OTGFS_GHWCFG2_OTGMODE_V  0x00000007U
#define USB_OTGFS_GHWCFG2_OTGMODE_S  0
/** USB_OTGFS_GHWCFG2_OTGARCH : RO; bitpos: [4:3]; default: 2;
 *  Architecture (OtgArch)
 *  - 2'b00: Slave-Only
 *  - 2'b01: External DMA
 *  - 2'b10: Internal DMA
 *  - Others: Reserved
 *  Note: This field is configured using the OTG_ARCHITECTURE parameter.
 */
#define USB_OTGFS_GHWCFG2_OTGARCH    0x00000003U
#define USB_OTGFS_GHWCFG2_OTGARCH_M  (USB_OTGFS_GHWCFG2_OTGARCH_V << USB_OTGFS_GHWCFG2_OTGARCH_S)
#define USB_OTGFS_GHWCFG2_OTGARCH_V  0x00000003U
#define USB_OTGFS_GHWCFG2_OTGARCH_S  3
/** USB_OTGFS_GHWCFG2_SINGPNT : RO; bitpos: [5]; default: 1;
 *  Point-to-Point (SingPnt)
 *  - 1'b0: Multi-point application  (hub and split support)
 *  - 1'b1: Single-point application (no hub and split support)
 *  Note: This field is configured using the OTG_SINGLE_POINT parameter.
 */
#define USB_OTGFS_GHWCFG2_SINGPNT    (BIT(5))
#define USB_OTGFS_GHWCFG2_SINGPNT_M  (USB_OTGFS_GHWCFG2_SINGPNT_V << USB_OTGFS_GHWCFG2_SINGPNT_S)
#define USB_OTGFS_GHWCFG2_SINGPNT_V  0x00000001U
#define USB_OTGFS_GHWCFG2_SINGPNT_S  5
/** USB_OTGFS_GHWCFG2_HSPHYTYPE : RO; bitpos: [7:6]; default: 0;
 *  High-Speed PHY Interface Type (HSPhyType)
 *  - 2'b00: High-Speed interface not supported
 *  - 2'b01: UTMI+
 *  - 2'b10: ULPI
 *  - 2'b11: UTMI+ and ULPI
 *  Note: This field is configured using the OTG_HSPHY_INTERFACE parameter.
 */
#define USB_OTGFS_GHWCFG2_HSPHYTYPE    0x00000003U
#define USB_OTGFS_GHWCFG2_HSPHYTYPE_M  (USB_OTGFS_GHWCFG2_HSPHYTYPE_V << USB_OTGFS_GHWCFG2_HSPHYTYPE_S)
#define USB_OTGFS_GHWCFG2_HSPHYTYPE_V  0x00000003U
#define USB_OTGFS_GHWCFG2_HSPHYTYPE_S  6
/** USB_OTGFS_GHWCFG2_FSPHYTYPE : RO; bitpos: [9:8]; default: 1;
 *  Full-Speed PHY Interface Type (FSPhyType)
 *  - 2'b00: Full-speed interface not supported
 *  - 2'b01: Dedicated full-speed interface
 *  - 2'b10: FS pins shared with UTMI+ pins
 *  - 2'b11: FS pins shared with ULPI pins
 *  Note: This field is configured using the OTG_FSPHY_INTERFACE parameter.
 */
#define USB_OTGFS_GHWCFG2_FSPHYTYPE    0x00000003U
#define USB_OTGFS_GHWCFG2_FSPHYTYPE_M  (USB_OTGFS_GHWCFG2_FSPHYTYPE_V << USB_OTGFS_GHWCFG2_FSPHYTYPE_S)
#define USB_OTGFS_GHWCFG2_FSPHYTYPE_V  0x00000003U
#define USB_OTGFS_GHWCFG2_FSPHYTYPE_S  8
/** USB_OTGFS_GHWCFG2_NUMDEVEPS : RO; bitpos: [13:10]; default: 6;
 *  Number of Device Endpoints (NumDevEps)
 *
 *  Indicates the number of device endpoints supported by the core in Device mode.
 *
 *  The range of this field is 0-15.
 *
 *  Note: This field is configured using the OTG_NUM_EPS parameter.
 */
#define USB_OTGFS_GHWCFG2_NUMDEVEPS    0x0000000FU
#define USB_OTGFS_GHWCFG2_NUMDEVEPS_M  (USB_OTGFS_GHWCFG2_NUMDEVEPS_V << USB_OTGFS_GHWCFG2_NUMDEVEPS_S)
#define USB_OTGFS_GHWCFG2_NUMDEVEPS_V  0x0000000FU
#define USB_OTGFS_GHWCFG2_NUMDEVEPS_S  10
/** USB_OTGFS_GHWCFG2_NUMHSTCHNL : RO; bitpos: [17:14]; default: 7;
 *  Number of Host Channels (NumHstChnl)
 *  Indicates the number of host channels supported by the core in Host mode. The range
 *  of this field is 0-15: 0 specifies 1 channel, 15 specifies 16 channels.
 *
 *  Note: This field is configured using the OTG_NUM_HOST_CHAN parameter.
 */
#define USB_OTGFS_GHWCFG2_NUMHSTCHNL    0x0000000FU
#define USB_OTGFS_GHWCFG2_NUMHSTCHNL_M  (USB_OTGFS_GHWCFG2_NUMHSTCHNL_V << USB_OTGFS_GHWCFG2_NUMHSTCHNL_S)
#define USB_OTGFS_GHWCFG2_NUMHSTCHNL_V  0x0000000FU
#define USB_OTGFS_GHWCFG2_NUMHSTCHNL_S  14
/** USB_OTGFS_GHWCFG2_PERIOSUPPORT : RO; bitpos: [18]; default: 1;
 *  Periodic OUT Channels Supported in Host Mode (PerioSupport)
 *  - 1'b0: No
 *  - 1'b1: Yes
 *  Note: This field is configured using the OTG_EN_PERIO_HOST parameter.
 */
#define USB_OTGFS_GHWCFG2_PERIOSUPPORT    (BIT(18))
#define USB_OTGFS_GHWCFG2_PERIOSUPPORT_M  (USB_OTGFS_GHWCFG2_PERIOSUPPORT_V << USB_OTGFS_GHWCFG2_PERIOSUPPORT_S)
#define USB_OTGFS_GHWCFG2_PERIOSUPPORT_V  0x00000001U
#define USB_OTGFS_GHWCFG2_PERIOSUPPORT_S  18
/** USB_OTGFS_GHWCFG2_DYNFIFOSIZING : RO; bitpos: [19]; default: 1;
 *  Dynamic FIFO Sizing Enabled (DynFifoSizing)
 *  - 1'b0: No
 *  - 1'b1: Yes
 *  Note: This field is configured using the OTG_DFIFO_DYNAMIC parameter.
 */
#define USB_OTGFS_GHWCFG2_DYNFIFOSIZING    (BIT(19))
#define USB_OTGFS_GHWCFG2_DYNFIFOSIZING_M  (USB_OTGFS_GHWCFG2_DYNFIFOSIZING_V << USB_OTGFS_GHWCFG2_DYNFIFOSIZING_S)
#define USB_OTGFS_GHWCFG2_DYNFIFOSIZING_V  0x00000001U
#define USB_OTGFS_GHWCFG2_DYNFIFOSIZING_S  19
/** USB_OTGFS_GHWCFG2_MULTIPROCINTRPT : RO; bitpos: [20]; default: 0;
 *  Multi Processor Interrupt Enabled (MultiProcIntrpt)
 *  - 1'b0: No
 *  - 1'b1: Yes
 *  Note: This field is configured using the OTG_MULTI_PROC_INTRPT parameter.
 */
#define USB_OTGFS_GHWCFG2_MULTIPROCINTRPT    (BIT(20))
#define USB_OTGFS_GHWCFG2_MULTIPROCINTRPT_M  (USB_OTGFS_GHWCFG2_MULTIPROCINTRPT_V << USB_OTGFS_GHWCFG2_MULTIPROCINTRPT_S)
#define USB_OTGFS_GHWCFG2_MULTIPROCINTRPT_V  0x00000001U
#define USB_OTGFS_GHWCFG2_MULTIPROCINTRPT_S  20
/** USB_OTGFS_GHWCFG2_NPTXQDEPTH : RO; bitpos: [23:22]; default: 1;
 *  Non-periodic Request Queue Depth (NPTxQDepth)
 *  - 2'b00: 2
 *  - 2'b01: 4
 *  - 2'b10: 8
 *  - Others: Reserved
 *  Note: This field is configured using the OTG_NPERIO_TX_QUEUE_DEPTH parameter.
 */
#define USB_OTGFS_GHWCFG2_NPTXQDEPTH    0x00000003U
#define USB_OTGFS_GHWCFG2_NPTXQDEPTH_M  (USB_OTGFS_GHWCFG2_NPTXQDEPTH_V << USB_OTGFS_GHWCFG2_NPTXQDEPTH_S)
#define USB_OTGFS_GHWCFG2_NPTXQDEPTH_V  0x00000003U
#define USB_OTGFS_GHWCFG2_NPTXQDEPTH_S  22
/** USB_OTGFS_GHWCFG2_PTXQDEPTH : RO; bitpos: [25:24]; default: 2;
 *  Host Mode Periodic Request Queue Depth (PTxQDepth)
 *  - 2'b00: 2
 *  - 2'b01: 4
 *  - 2'b10: 8
 *  - 2'b11:16
 *  Note: This field is configured using the OTG_PERIO_TX_QUEUE_DEPTH parameter.
 */
#define USB_OTGFS_GHWCFG2_PTXQDEPTH    0x00000003U
#define USB_OTGFS_GHWCFG2_PTXQDEPTH_M  (USB_OTGFS_GHWCFG2_PTXQDEPTH_V << USB_OTGFS_GHWCFG2_PTXQDEPTH_S)
#define USB_OTGFS_GHWCFG2_PTXQDEPTH_V  0x00000003U
#define USB_OTGFS_GHWCFG2_PTXQDEPTH_S  24
/** USB_OTGFS_GHWCFG2_TKNQDEPTH : RO; bitpos: [30:26]; default: 8;
 *  Device Mode IN Token Sequence Learning Queue Depth (TknQDepth)
 *  Range: 0-30
 *
 *  Note: This field is configured using the OTG_TOKEN_QUEUE_DEPTH parameter.
 */
#define USB_OTGFS_GHWCFG2_TKNQDEPTH    0x0000001FU
#define USB_OTGFS_GHWCFG2_TKNQDEPTH_M  (USB_OTGFS_GHWCFG2_TKNQDEPTH_V << USB_OTGFS_GHWCFG2_TKNQDEPTH_S)
#define USB_OTGFS_GHWCFG2_TKNQDEPTH_V  0x0000001FU
#define USB_OTGFS_GHWCFG2_TKNQDEPTH_S  26

/** USB_OTGFS_GHWCFG3_REG register
 *  User Hardware Configuration 3 Register
 */
#define USB_OTGFS_GHWCFG3_REG(i) (DR_REG_USB_BASE(i) + 0x4c)
/** USB_OTGFS_GHWCFG3_XFERSIZEWIDTH : RO; bitpos: [3:0]; default: 5;
 *  Width of Transfer Size Counters (XferSizeWidth)
 *  - 4'b0000: 11 bits
 *  - 4'b0001: 12 bits
 *  ...
 *  - 4'b1000: 19 bits
 *  - Others: Reserved
 *  Note: This field is configured using the OTG_PACKET_COUNT_WIDTH parameter.
 */
#define USB_OTGFS_GHWCFG3_XFERSIZEWIDTH    0x0000000FU
#define USB_OTGFS_GHWCFG3_XFERSIZEWIDTH_M  (USB_OTGFS_GHWCFG3_XFERSIZEWIDTH_V << USB_OTGFS_GHWCFG3_XFERSIZEWIDTH_S)
#define USB_OTGFS_GHWCFG3_XFERSIZEWIDTH_V  0x0000000FU
#define USB_OTGFS_GHWCFG3_XFERSIZEWIDTH_S  0
/** USB_OTGFS_GHWCFG3_PKTSIZEWIDTH : RO; bitpos: [6:4]; default: 3;
 *  Width of Packet Size Counters (PktSizeWidth)
 *  - 3'b000: 4 bits
 *  - 3'b001: 5 bits
 *  - 3'b010: 6 bits
 *  - 3'b011: 7 bits
 *  - 3'b100: 8 bits
 *  - 3'b101: 9 bits
 *  - 3'b110: 10 bits
 *  - Others: Reserved
 *  Note: This field is configured using the OTG_PACKET_COUNT_WIDTH parameter.
 */
#define USB_OTGFS_GHWCFG3_PKTSIZEWIDTH    0x00000007U
#define USB_OTGFS_GHWCFG3_PKTSIZEWIDTH_M  (USB_OTGFS_GHWCFG3_PKTSIZEWIDTH_V << USB_OTGFS_GHWCFG3_PKTSIZEWIDTH_S)
#define USB_OTGFS_GHWCFG3_PKTSIZEWIDTH_V  0x00000007U
#define USB_OTGFS_GHWCFG3_PKTSIZEWIDTH_S  4
/** USB_OTGFS_GHWCFG3_OTGEN : RO; bitpos: [7]; default: 1;
 *  OTG Function Enabled (OtgEn)
 *
 *  The application uses this bit to indicate the OTG capabilities of the controller .
 *  - 1'b0: Not OTG capable
 *  - 1'b1: OTG Capable
 *  Note: This field is configured using the OTG_MODE parameter.
 */
#define USB_OTGFS_GHWCFG3_OTGEN    (BIT(7))
#define USB_OTGFS_GHWCFG3_OTGEN_M  (USB_OTGFS_GHWCFG3_OTGEN_V << USB_OTGFS_GHWCFG3_OTGEN_S)
#define USB_OTGFS_GHWCFG3_OTGEN_V  0x00000001U
#define USB_OTGFS_GHWCFG3_OTGEN_S  7
/** USB_OTGFS_GHWCFG3_I2CINTSEL : RO; bitpos: [8]; default: 0;
 *  I2C Selection (I2CIntSel)
 *  - 1'b0: I2C Interface is not available on the controller.
 *  - 1'b1: I2C Interface is available on the controller.
 *  Note: This field is configured using the OTG_I2C_INTERFACE parameter.
 */
#define USB_OTGFS_GHWCFG3_I2CINTSEL    (BIT(8))
#define USB_OTGFS_GHWCFG3_I2CINTSEL_M  (USB_OTGFS_GHWCFG3_I2CINTSEL_V << USB_OTGFS_GHWCFG3_I2CINTSEL_S)
#define USB_OTGFS_GHWCFG3_I2CINTSEL_V  0x00000001U
#define USB_OTGFS_GHWCFG3_I2CINTSEL_S  8
/** USB_OTGFS_GHWCFG3_VNDCTLSUPT : RO; bitpos: [9]; default: 0;
 *  Vendor Control Interface Support (VndctlSupt)
 *
 *  - 1'b0: Vendor Control Interface is not available on the core.
 *  - 1'b1: Vendor Control Interface is available.
 *  Note: This field is configured using the OTG_VENDOR_CTL_INTERFACE parameter.
 */
#define USB_OTGFS_GHWCFG3_VNDCTLSUPT    (BIT(9))
#define USB_OTGFS_GHWCFG3_VNDCTLSUPT_M  (USB_OTGFS_GHWCFG3_VNDCTLSUPT_V << USB_OTGFS_GHWCFG3_VNDCTLSUPT_S)
#define USB_OTGFS_GHWCFG3_VNDCTLSUPT_V  0x00000001U
#define USB_OTGFS_GHWCFG3_VNDCTLSUPT_S  9
/** USB_OTGFS_GHWCFG3_OPTFEATURE : RO; bitpos: [10]; default: 1;
 *  Optional Features Removed (OptFeature)
 *  Indicates whether the User ID register, GPIO interface ports, and SOF toggle and
 *  counter ports were removed for gate count optimization by enabling Remove Optional
 *  Features.
 *  - 1'b0: No
 *  - 1'b1: Yes
 *  Note: This field is configured using the OTG_RM_OPT_FEATURES parameter.
 */
#define USB_OTGFS_GHWCFG3_OPTFEATURE    (BIT(10))
#define USB_OTGFS_GHWCFG3_OPTFEATURE_M  (USB_OTGFS_GHWCFG3_OPTFEATURE_V << USB_OTGFS_GHWCFG3_OPTFEATURE_S)
#define USB_OTGFS_GHWCFG3_OPTFEATURE_V  0x00000001U
#define USB_OTGFS_GHWCFG3_OPTFEATURE_S  10
/** USB_OTGFS_GHWCFG3_RSTTYPE : RO; bitpos: [11]; default: 0;
 *  Reset Style for Clocked always Blocks in RTL (RstType)
 *  - 1'b0: Asynchronous reset is used in the controller
 *  - 1'b1: Synchronous reset is used in the controller
 *  Note: This field is configured using the OTG_SYNC_RESET_TYPE parameter.
 */
#define USB_OTGFS_GHWCFG3_RSTTYPE    (BIT(11))
#define USB_OTGFS_GHWCFG3_RSTTYPE_M  (USB_OTGFS_GHWCFG3_RSTTYPE_V << USB_OTGFS_GHWCFG3_RSTTYPE_S)
#define USB_OTGFS_GHWCFG3_RSTTYPE_V  0x00000001U
#define USB_OTGFS_GHWCFG3_RSTTYPE_S  11
/** USB_OTGFS_GHWCFG3_ADPSUPPORT : RO; bitpos: [12]; default: 0;
 *  This bit indicates whether ADP logic is present within or external to the controller
 *  - 0: No ADP logic present with the controller
 *  - 1: ADP logic is present along with the controller.
 */
#define USB_OTGFS_GHWCFG3_ADPSUPPORT    (BIT(12))
#define USB_OTGFS_GHWCFG3_ADPSUPPORT_M  (USB_OTGFS_GHWCFG3_ADPSUPPORT_V << USB_OTGFS_GHWCFG3_ADPSUPPORT_S)
#define USB_OTGFS_GHWCFG3_ADPSUPPORT_V  0x00000001U
#define USB_OTGFS_GHWCFG3_ADPSUPPORT_S  12
/** USB_OTGFS_GHWCFG3_HSICMODE : RO; bitpos: [13]; default: 0;
 *  HSIC mode specified for Mode of Operation
 *  Value Range: 0 - 1
 *  - 1: HSIC-capable with shared UTMI PHY interface
 *  - 0: Non-HSIC-capable
 */
#define USB_OTGFS_GHWCFG3_HSICMODE    (BIT(13))
#define USB_OTGFS_GHWCFG3_HSICMODE_M  (USB_OTGFS_GHWCFG3_HSICMODE_V << USB_OTGFS_GHWCFG3_HSICMODE_S)
#define USB_OTGFS_GHWCFG3_HSICMODE_V  0x00000001U
#define USB_OTGFS_GHWCFG3_HSICMODE_S  13
/** USB_OTGFS_GHWCFG3_BCSUPPORT : RO; bitpos: [14]; default: 0;
 *  This bit indicates the controller support for Battery Charger.
 *  - 0 - No Battery Charger Support
 *  - 1 - Battery Charger support present
 */
#define USB_OTGFS_GHWCFG3_BCSUPPORT    (BIT(14))
#define USB_OTGFS_GHWCFG3_BCSUPPORT_M  (USB_OTGFS_GHWCFG3_BCSUPPORT_V << USB_OTGFS_GHWCFG3_BCSUPPORT_S)
#define USB_OTGFS_GHWCFG3_BCSUPPORT_V  0x00000001U
#define USB_OTGFS_GHWCFG3_BCSUPPORT_S  14
/** USB_OTGFS_GHWCFG3_LPMMODE : RO; bitpos: [15]; default: 0;
 *  LPM mode specified for Mode of Operation.
 */
#define USB_OTGFS_GHWCFG3_LPMMODE    (BIT(15))
#define USB_OTGFS_GHWCFG3_LPMMODE_M  (USB_OTGFS_GHWCFG3_LPMMODE_V << USB_OTGFS_GHWCFG3_LPMMODE_S)
#define USB_OTGFS_GHWCFG3_LPMMODE_V  0x00000001U
#define USB_OTGFS_GHWCFG3_LPMMODE_S  15
/** USB_OTGFS_GHWCFG3_DFIFODEPTH : RO; bitpos: [31:16]; default: 200;
 *  DFIFO Depth (DfifoDepth - EP_LOC_CNT)
 *
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 32
 *  - Maximum value is 32,768
 *  Note: This field is configured using the OTG_DFIFO_DEPTH parameter. For more
 *  information on EP_LOC_CNT, see the Endpoint Information Controller (EPINFO_CTL)
 *  section.
 */
#define USB_OTGFS_GHWCFG3_DFIFODEPTH    0x0000FFFFU
#define USB_OTGFS_GHWCFG3_DFIFODEPTH_M  (USB_OTGFS_GHWCFG3_DFIFODEPTH_V << USB_OTGFS_GHWCFG3_DFIFODEPTH_S)
#define USB_OTGFS_GHWCFG3_DFIFODEPTH_V  0x0000FFFFU
#define USB_OTGFS_GHWCFG3_DFIFODEPTH_S  16

