espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_GHWCFG4_REG register
 *  User Hardware Configuration 4 Register  Note Bit [31] is available only when
 *  Scatter/Gather DMA mode is enabled. When Scatter/Gather DMA mode is disabled, this
 *  field is reserved.
 */
#define USB_OTGFS_GHWCFG4_REG(i) (DR_REG_USB_BASE(i) + 0x50)
/** USB_OTGFS_GHWCFG4_NUMDEVPERIOEPS : RO; bitpos: [3:0]; default: 0;
 *  Number of Device Mode Periodic IN Endpoints (NumDevPerioEps)
 *
 *  Range: 0-15
 */
#define USB_OTGFS_GHWCFG4_NUMDEVPERIOEPS    0x0000000FU
#define USB_OTGFS_GHWCFG4_NUMDEVPERIOEPS_M  (USB_OTGFS_GHWCFG4_NUMDEVPERIOEPS_V << USB_OTGFS_GHWCFG4_NUMDEVPERIOEPS_S)
#define USB_OTGFS_GHWCFG4_NUMDEVPERIOEPS_V  0x0000000FU
#define USB_OTGFS_GHWCFG4_NUMDEVPERIOEPS_S  0
/** USB_OTGFS_GHWCFG4_PARTIALPWRDN : RO; bitpos: [4]; default: 1;
 *  Enable Partial Power Down (PartialPwrDn)
 *  - 1'b0: Partial Power Down Not Enabled
 *  - 1'b1: Partial Power Down Enabled
 */
#define USB_OTGFS_GHWCFG4_PARTIALPWRDN    (BIT(4))
#define USB_OTGFS_GHWCFG4_PARTIALPWRDN_M  (USB_OTGFS_GHWCFG4_PARTIALPWRDN_V << USB_OTGFS_GHWCFG4_PARTIALPWRDN_S)
#define USB_OTGFS_GHWCFG4_PARTIALPWRDN_V  0x00000001U
#define USB_OTGFS_GHWCFG4_PARTIALPWRDN_S  4
/** USB_OTGFS_GHWCFG4_AHBFREQ : RO; bitpos: [5]; default: 1;
 *  Minimum AHB Frequency Less Than 60 MHz (AhbFreq)
 *  - 1'b0: No
 *  - 1'b1: Yes
 */
#define USB_OTGFS_GHWCFG4_AHBFREQ    (BIT(5))
#define USB_OTGFS_GHWCFG4_AHBFREQ_M  (USB_OTGFS_GHWCFG4_AHBFREQ_V << USB_OTGFS_GHWCFG4_AHBFREQ_S)
#define USB_OTGFS_GHWCFG4_AHBFREQ_V  0x00000001U
#define USB_OTGFS_GHWCFG4_AHBFREQ_S  5
/** USB_OTGFS_GHWCFG4_HIBERNATION : RO; bitpos: [6]; default: 0;
 *  Enable Hibernation (Hibernation)
 *  - 1'b0: Hibernation feature not enabled
 *  - 1'b1: Hibernation feature enabled
 */
#define USB_OTGFS_GHWCFG4_HIBERNATION    (BIT(6))
#define USB_OTGFS_GHWCFG4_HIBERNATION_M  (USB_OTGFS_GHWCFG4_HIBERNATION_V << USB_OTGFS_GHWCFG4_HIBERNATION_S)
#define USB_OTGFS_GHWCFG4_HIBERNATION_V  0x00000001U
#define USB_OTGFS_GHWCFG4_HIBERNATION_S  6
/** USB_OTGFS_GHWCFG4_EXTENDEDHIBERNATION : RO; bitpos: [7]; default: 0;
 *  Enable Hibernation
 *  - 1'b0: Extended Hibernation feature not enabled
 *  - 1'b1: Extended Hibernation feature enabled
 */
#define USB_OTGFS_GHWCFG4_EXTENDEDHIBERNATION    (BIT(7))
#define USB_OTGFS_GHWCFG4_EXTENDEDHIBERNATION_M  (USB_OTGFS_GHWCFG4_EXTENDEDHIBERNATION_V << USB_OTGFS_GHWCFG4_EXTENDEDHIBERNATION_S)
#define USB_OTGFS_GHWCFG4_EXTENDEDHIBERNATION_V  0x00000001U
#define USB_OTGFS_GHWCFG4_EXTENDEDHIBERNATION_S  7
/** USB_OTGFS_GHWCFG4_ACGSUPT : RO; bitpos: [12]; default: 0;
 *  Active Clock Gating Support
 *
 *  This bit indicates that the controller supports the Dynamic (Switching) Power
 *  Reduction during periods
 *  when there is no USB and AHB Traffic.
 *  - 1'b0:  Active Clock Gating is not enabled.
 *  - 1'b1:  Active Clock Gating Enabled.
 */
#define USB_OTGFS_GHWCFG4_ACGSUPT    (BIT(12))
#define USB_OTGFS_GHWCFG4_ACGSUPT_M  (USB_OTGFS_GHWCFG4_ACGSUPT_V << USB_OTGFS_GHWCFG4_ACGSUPT_S)
#define USB_OTGFS_GHWCFG4_ACGSUPT_V  0x00000001U
#define USB_OTGFS_GHWCFG4_ACGSUPT_S  12
/** USB_OTGFS_GHWCFG4_ENHANCEDLPMSUPT : RO; bitpos: [13]; default: 1;
 *  Enhanced LPM Support (EnhancedLPMSupt)
 *
 *  This bit indicates that the controller supports the following behavior:
 *  L1 Entry Behavior based on FIFO Status
 *  - TX FIFO
 *  - Accept L1 Request even if ISOC OUT TX FIFO is not empty.
 *  - Reject L1 Request if Non-Periodic TX FIFO is not empty.
 *  - Ensure application can flush the TX FIFO while the Controller is in L1.
 *  - RX FIFO
 *  - Accept L1 Request even if RX FIFO (common to Periodic and Non-Periodic) is not
 *  empty.
 *  - Accept L1 Request but delay SLEEPM assertion until RX SINK Buffer is empty.
 *
 *  Prevent L1 Entry if a Control Transfer is in progress on any Control Endpoint.
 *  Ability to Flush TxFIFO even if PHY Clock is gated.
 *
 */
#define USB_OTGFS_GHWCFG4_ENHANCEDLPMSUPT    (BIT(13))
#define USB_OTGFS_GHWCFG4_ENHANCEDLPMSUPT_M  (USB_OTGFS_GHWCFG4_ENHANCEDLPMSUPT_V << USB_OTGFS_GHWCFG4_ENHANCEDLPMSUPT_S)
#define USB_OTGFS_GHWCFG4_ENHANCEDLPMSUPT_V  0x00000001U
#define USB_OTGFS_GHWCFG4_ENHANCEDLPMSUPT_S  13
/** USB_OTGFS_GHWCFG4_PHYDATAWIDTH : RO; bitpos: [15:14]; default: 2;
 *  UTMI+ PHY/ULPI-to-Internal UTMI+ Wrapper Data Width
 *  (PhyDataWidth)<vr>When a ULPI PHY is used, an internal wrapper converts ULPI to
 *  UTMI+.
 *  - 2'b00: 8 bits
 *  - 2'b01: 16 bits
 *  - 2'b10: 8/16 bits, software selectable
 *  - Others: Reserved
 */
#define USB_OTGFS_GHWCFG4_PHYDATAWIDTH    0x00000003U
#define USB_OTGFS_GHWCFG4_PHYDATAWIDTH_M  (USB_OTGFS_GHWCFG4_PHYDATAWIDTH_V << USB_OTGFS_GHWCFG4_PHYDATAWIDTH_S)
#define USB_OTGFS_GHWCFG4_PHYDATAWIDTH_V  0x00000003U
#define USB_OTGFS_GHWCFG4_PHYDATAWIDTH_S  14
/** USB_OTGFS_GHWCFG4_NUMCTLEPS : RO; bitpos: [19:16]; default: 0;
 *  Number of Device Mode Control Endpoints in Addition to
 *  Endpoint 0 (NumCtlEps)
 *  Range: 0-15
 */
#define USB_OTGFS_GHWCFG4_NUMCTLEPS    0x0000000FU
#define USB_OTGFS_GHWCFG4_NUMCTLEPS_M  (USB_OTGFS_GHWCFG4_NUMCTLEPS_V << USB_OTGFS_GHWCFG4_NUMCTLEPS_S)
#define USB_OTGFS_GHWCFG4_NUMCTLEPS_V  0x0000000FU
#define USB_OTGFS_GHWCFG4_NUMCTLEPS_S  16
/** USB_OTGFS_GHWCFG4_IDDGFLTR : RO; bitpos: [20]; default: 1;
 *  IDDIG Filter Enable (IddgFltr)
 *  - 1'b0: No filter
 *  - 1'b1: Filter
 */
#define USB_OTGFS_GHWCFG4_IDDGFLTR    (BIT(20))
#define USB_OTGFS_GHWCFG4_IDDGFLTR_M  (USB_OTGFS_GHWCFG4_IDDGFLTR_V << USB_OTGFS_GHWCFG4_IDDGFLTR_S)
#define USB_OTGFS_GHWCFG4_IDDGFLTR_V  0x00000001U
#define USB_OTGFS_GHWCFG4_IDDGFLTR_S  20
/** USB_OTGFS_GHWCFG4_VBUSVALIDFLTR : RO; bitpos: [21]; default: 1;
 *  VBUS Valid Filter Enabled (VBusValidFltr)
 *  - 1'b0: No filter
 *  - 1'b1: Filter
 */
#define USB_OTGFS_GHWCFG4_VBUSVALIDFLTR    (BIT(21))
#define USB_OTGFS_GHWCFG4_VBUSVALIDFLTR_M  (USB_OTGFS_GHWCFG4_VBUSVALIDFLTR_V << USB_OTGFS_GHWCFG4_VBUSVALIDFLTR_S)
#define USB_OTGFS_GHWCFG4_VBUSVALIDFLTR_V  0x00000001U
#define USB_OTGFS_GHWCFG4_VBUSVALIDFLTR_S  21
/** USB_OTGFS_GHWCFG4_AVALIDFLTR : RO; bitpos: [22]; default: 1;
 *  a_valid Filter Enabled (AValidFltr)
 *  - 1'b0: No filter
 *  - 1'b1: Filter
 */
#define USB_OTGFS_GHWCFG4_AVALIDFLTR    (BIT(22))
#define USB_OTGFS_GHWCFG4_AVALIDFLTR_M  (USB_OTGFS_GHWCFG4_AVALIDFLTR_V << USB_OTGFS_GHWCFG4_AVALIDFLTR_S)
#define USB_OTGFS_GHWCFG4_AVALIDFLTR_V  0x00000001U
#define USB_OTGFS_GHWCFG4_AVALIDFLTR_S  22
/** USB_OTGFS_GHWCFG4_BVALIDFLTR : RO; bitpos: [23]; default: 1;
 *  b_valid Filter Enabled (BValidFltr)
 *  - 1'b0: No filter
 *  - 1'b1: Filter
 */
#define USB_OTGFS_GHWCFG4_BVALIDFLTR    (BIT(23))
#define USB_OTGFS_GHWCFG4_BVALIDFLTR_M  (USB_OTGFS_GHWCFG4_BVALIDFLTR_V << USB_OTGFS_GHWCFG4_BVALIDFLTR_S)
#define USB_OTGFS_GHWCFG4_BVALIDFLTR_V  0x00000001U
#define USB_OTGFS_GHWCFG4_BVALIDFLTR_S  23
/** USB_OTGFS_GHWCFG4_SESSENDFLTR : RO; bitpos: [24]; default: 1;
 *  session_end Filter Enabled (SessEndFltr)
 *  - 1'b0: No filter
 *  - 1'b1: Filter
 */
#define USB_OTGFS_GHWCFG4_SESSENDFLTR    (BIT(24))
#define USB_OTGFS_GHWCFG4_SESSENDFLTR_M  (USB_OTGFS_GHWCFG4_SESSENDFLTR_V << USB_OTGFS_GHWCFG4_SESSENDFLTR_S)
#define USB_OTGFS_GHWCFG4_SESSENDFLTR_V  0x00000001U
#define USB_OTGFS_GHWCFG4_SESSENDFLTR_S  24
/** USB_OTGFS_GHWCFG4_DEDFIFOMODE : RO; bitpos: [25]; default: 1;
 *  Enable Dedicated Transmit FIFO for device IN Endpoints
 *  (DedFifoMode)
 *  - 1'b0 : Dedicated Transmit FIFO Operation not enabled.
 *  - 1'b1 : Dedicated Transmit FIFO Operation enabled.
 */
#define USB_OTGFS_GHWCFG4_DEDFIFOMODE    (BIT(25))
#define USB_OTGFS_GHWCFG4_DEDFIFOMODE_M  (USB_OTGFS_GHWCFG4_DEDFIFOMODE_V << USB_OTGFS_GHWCFG4_DEDFIFOMODE_S)
#define USB_OTGFS_GHWCFG4_DEDFIFOMODE_V  0x00000001U
#define USB_OTGFS_GHWCFG4_DEDFIFOMODE_S  25
/** USB_OTGFS_GHWCFG4_INEPS : RO; bitpos: [29:26]; default: 4;
 *  Number of Device Mode IN Endpoints Including Control Endpoints (INEps)
 *  - 0: 1 IN Endpoint
 *  - 1: 2 IN Endpoints
 *  ....
 *  - 15: 16 IN Endpoints
 */
#define USB_OTGFS_GHWCFG4_INEPS    0x0000000FU
#define USB_OTGFS_GHWCFG4_INEPS_M  (USB_OTGFS_GHWCFG4_INEPS_V << USB_OTGFS_GHWCFG4_INEPS_S)
#define USB_OTGFS_GHWCFG4_INEPS_V  0x0000000FU
#define USB_OTGFS_GHWCFG4_INEPS_S  26
/** USB_OTGFS_GHWCFG4_DESCDMAENABLED : RO; bitpos: [30]; default: 1;
 *  Scatter/Gather DMA configuration
 *  - 1'b0: Non-Scatter/Gather DMA configuration
 *  - 1'b1: Scatter/Gather DMA configuration
 */
#define USB_OTGFS_GHWCFG4_DESCDMAENABLED    (BIT(30))
#define USB_OTGFS_GHWCFG4_DESCDMAENABLED_M  (USB_OTGFS_GHWCFG4_DESCDMAENABLED_V << USB_OTGFS_GHWCFG4_DESCDMAENABLED_S)
#define USB_OTGFS_GHWCFG4_DESCDMAENABLED_V  0x00000001U
#define USB_OTGFS_GHWCFG4_DESCDMAENABLED_S  30
/** USB_OTGFS_GHWCFG4_DESCDMA : RO; bitpos: [31]; default: 1;
 *  Scatter/Gather DMA configuration
 *  - 1'b0: Non Dynamic configuration
 *  - 1'b1: Dynamic configuration
 *  Note: This field is configured using the OTG_EN_DESC_DMA parameter.
 */
#define USB_OTGFS_GHWCFG4_DESCDMA    (BIT(31))
#define USB_OTGFS_GHWCFG4_DESCDMA_M  (USB_OTGFS_GHWCFG4_DESCDMA_V << USB_OTGFS_GHWCFG4_DESCDMA_S)
#define USB_OTGFS_GHWCFG4_DESCDMA_V  0x00000001U
#define USB_OTGFS_GHWCFG4_DESCDMA_S  31

/** USB_OTGFS_GDFIFOCFG_REG register
 *  Global DFIFO Configuration Register
 */
#define USB_OTGFS_GDFIFOCFG_REG(i) (DR_REG_USB_BASE(i) + 0x5c)
/** USB_OTGFS_GDFIFOCFG_GDFIFOCFG : R/W; bitpos: [15:0]; default: 256;
 *  GDFIFOCfg
 *
 *  This field is for dynamic programming of the DFIFO Size. This value takes effect
 *  only when the application programs a non zero value to this register. The value
 *  programmed must conform to the guidelines described in 'FIFO RAM Allocation'. The
 *  core does not have any corrective logic if the FIFO sizes are programmed
 *  incorrectly.
 */
#define USB_OTGFS_GDFIFOCFG_GDFIFOCFG    0x0000FFFFU
#define USB_OTGFS_GDFIFOCFG_GDFIFOCFG_M  (USB_OTGFS_GDFIFOCFG_GDFIFOCFG_V << USB_OTGFS_GDFIFOCFG_GDFIFOCFG_S)
#define USB_OTGFS_GDFIFOCFG_GDFIFOCFG_V  0x0000FFFFU
#define USB_OTGFS_GDFIFOCFG_GDFIFOCFG_S  0
/** USB_OTGFS_GDFIFOCFG_EPINFOBASEADDR : R/W; bitpos: [31:16]; default: 200;
 *  EPInfoBaseAddr
 *
 *  This field provides the start address of the EP info controller.
 */
#define USB_OTGFS_GDFIFOCFG_EPINFOBASEADDR    0x0000FFFFU
#define USB_OTGFS_GDFIFOCFG_EPINFOBASEADDR_M  (USB_OTGFS_GDFIFOCFG_EPINFOBASEADDR_V << USB_OTGFS_GDFIFOCFG_EPINFOBASEADDR_S)
#define USB_OTGFS_GDFIFOCFG_EPINFOBASEADDR_V  0x0000FFFFU
#define USB_OTGFS_GDFIFOCFG_EPINFOBASEADDR_S  16

