espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_HFIR_REG register
 *  Host Frame Interval Register
 */
#define USB_OTGFS_HFIR_REG(i) (DR_REG_USB_BASE(i) + 0x404)
/** USB_OTGFS_HFIR_FRINT : R/W; bitpos: [15:0]; default: 60000;
 *  Frame Interval (FrInt)
 *
 *  The value that the application programs to this field specifies
 *  the interval between two consecutive SOFs (FS) or micro-
 *  SOFs (HS) or Keep-Alive tokens (HS). This field contains the
 *  number of PHY clocks that constitute the required frame
 *  interval. The Default value set in this field  is for FS operation
 *  when the PHY clock frequency is 60 MHz. The application can
 *  write a value to this register only after the Port Enable bit of the
 *  Host Port Control and Status register (HPRT.PrtEnaPort) has
 *  been Set. If no value is programmed, the core calculates the
 *  value based on the PHY clock specified in the FS/LS PHY
 *  Clock Select field of the Host Configuration register
 *  (HCFG.FSLSPclkSel). Do not change the value of this field
 *  after the initial configuration.
 *  - 125 s * (PHY clock frequency for HS)
 *  - 1 ms * (PHY clock frequency for FS/LS)
 */
#define USB_OTGFS_HFIR_FRINT    0x0000FFFFU
#define USB_OTGFS_HFIR_FRINT_M  (USB_OTGFS_HFIR_FRINT_V << USB_OTGFS_HFIR_FRINT_S)
#define USB_OTGFS_HFIR_FRINT_V  0x0000FFFFU
#define USB_OTGFS_HFIR_FRINT_S  0
/** USB_OTGFS_HFIR_HFIRRLDCTRL : R/W; bitpos: [16]; default: 0;
 *  Reload Control (HFIRRldCtrl)
 *
 *  This bit allows dynamic reloading of the HFIR register during run time.
 *  - 1'b0 : The HFIR cannot be reloaded dynamically
 *  - 1'b1: the HFIR can be dynamically reloaded during runtime.
 *  This bit needs to be programmed during initial configuration and its value should
 *  not be changed during runtime.
 */
#define USB_OTGFS_HFIR_HFIRRLDCTRL    (BIT(16))
#define USB_OTGFS_HFIR_HFIRRLDCTRL_M  (USB_OTGFS_HFIR_HFIRRLDCTRL_V << USB_OTGFS_HFIR_HFIRRLDCTRL_S)
#define USB_OTGFS_HFIR_HFIRRLDCTRL_V  0x00000001U
#define USB_OTGFS_HFIR_HFIRRLDCTRL_S  16

/** USB_OTGFS_HFNUM_REG register
 *  Host Frame Number/Frame Time Remaining Register  This register indicates the
 *  current frame number. It also indicates the time remaining (in terms of the number
 *  of PHY clocks) in the current (micro)frame.  Note: Read the reset value of this
 *  register only after the following conditions:  - If IDDIG_FILTER is disabled, read
 *  only when the PHY clock is stable.  - If IDDIG_FILTER is enabled, read only after
 *  the filter timer expires.
 */
#define USB_OTGFS_HFNUM_REG(i) (DR_REG_USB_BASE(i) + 0x408)
/** USB_OTGFS_HFNUM_FRNUM : RO; bitpos: [15:0]; default: 16383;
 *  Frame Number (FrNum)
 *
 *  This field increments when a new SOF is transmitted on the
 *  USB, and is reset to 0 when it reaches 16'h3FFF.
 */
#define USB_OTGFS_HFNUM_FRNUM    0x0000FFFFU
#define USB_OTGFS_HFNUM_FRNUM_M  (USB_OTGFS_HFNUM_FRNUM_V << USB_OTGFS_HFNUM_FRNUM_S)
#define USB_OTGFS_HFNUM_FRNUM_V  0x0000FFFFU
#define USB_OTGFS_HFNUM_FRNUM_S  0
/** USB_OTGFS_HFNUM_FRREM : RO; bitpos: [31:16]; default: 0;
 *  Frame Time Remaining (FrRem)
 *
 *  Indicates the amount of time remaining in the current
 *  microframe (HS) or Frame (FS/LS), in terms of PHY clocks. This
 *  field decrements on each PHY clock. When it reaches zero, this
 *  field is reloaded with the value in the Frame Interval register and
 *  a new SOF is transmitted on the USB.
 */
#define USB_OTGFS_HFNUM_FRREM    0x0000FFFFU
#define USB_OTGFS_HFNUM_FRREM_M  (USB_OTGFS_HFNUM_FRREM_V << USB_OTGFS_HFNUM_FRREM_S)
#define USB_OTGFS_HFNUM_FRREM_V  0x0000FFFFU
#define USB_OTGFS_HFNUM_FRREM_S  16

/** USB_OTGFS_HPTXSTS_REG register
 *  Host Periodic Transmit FIFO/Queue Status Register
 */
#define USB_OTGFS_HPTXSTS_REG(i) (DR_REG_USB_BASE(i) + 0x410)
/** USB_OTGFS_HPTXSTS_PTXFSPCAVAIL : RO; bitpos: [15:0]; default: 256;
 *  Periodic Transmit Data FIFO Space Available (PTxFSpcAvail)
 *
 *  Indicates the number of free locations available to be written to in the Periodic
 *  TxFIFO.
 *
 *  Values are in terms of 32-bit words
 *  - 16'h0    : Periodic TxFIFO is full
 *  - 16'h1    : 1 word available
 *  - 16'h2    : 2 words available
 *  - 16'hn    : n words available (where 0  n  32,768)
 *  - 16'h8000 : 32,768 words
 *  - Others   : Reserved
 */
#define USB_OTGFS_HPTXSTS_PTXFSPCAVAIL    0x0000FFFFU
#define USB_OTGFS_HPTXSTS_PTXFSPCAVAIL_M  (USB_OTGFS_HPTXSTS_PTXFSPCAVAIL_V << USB_OTGFS_HPTXSTS_PTXFSPCAVAIL_S)
#define USB_OTGFS_HPTXSTS_PTXFSPCAVAIL_V  0x0000FFFFU
#define USB_OTGFS_HPTXSTS_PTXFSPCAVAIL_S  0
/** USB_OTGFS_HPTXSTS_PTXQSPCAVAIL : RO; bitpos: [23:16]; default: 8;
 *  Periodic Transmit Request Queue Space Available (PTxQSpcAvail)
 *
 *  Indicates the number of free locations available to be written in the Periodic
 *  Transmit Request Queue. This queue holds both IN and OUT requests.
 *  - 8'h0: Periodic Transmit Request Queue is full
 *  - 8'h1: 1 location available
 *  - 8'h2: 2 locations available
 *  - n: n locations available (0 <= n <= 16)
 *  - Others: Reserved
 */
#define USB_OTGFS_HPTXSTS_PTXQSPCAVAIL    0x000000FFU
#define USB_OTGFS_HPTXSTS_PTXQSPCAVAIL_M  (USB_OTGFS_HPTXSTS_PTXQSPCAVAIL_V << USB_OTGFS_HPTXSTS_PTXQSPCAVAIL_S)
#define USB_OTGFS_HPTXSTS_PTXQSPCAVAIL_V  0x000000FFU
#define USB_OTGFS_HPTXSTS_PTXQSPCAVAIL_S  16
/** USB_OTGFS_HPTXSTS_PTXQTOP : RO; bitpos: [31:24]; default: 0;
 *  Top of the Periodic Transmit Request Queue (PTxQTop)
 *
 *  This indicates the Entry in the Periodic Tx Request Queue that is
 *  currently being processes by the MAC.
 *
 *  This register is used for debugging.
 *  - Bit [31]: Odd/Even (micro)Frame
 *  -- 1'b0: send in even (micro)Frame
 *  -- 1'b1: send in odd (micro)Frame
 *  - Bits [30:27]: Channel/endpoint number
 *  - Bits [26:25]: Type
 *  -- 2'b00: IN/OUT
 *  -- 2'b01: Zero-length packet
 *  -- 2'b10: CSPLIT
 *  -- 2'b11: Disable channel command
 *  - Bit [24]: Terminate (last Entry for the selected channel/endpoint)
 */
#define USB_OTGFS_HPTXSTS_PTXQTOP    0x000000FFU
#define USB_OTGFS_HPTXSTS_PTXQTOP_M  (USB_OTGFS_HPTXSTS_PTXQTOP_V << USB_OTGFS_HPTXSTS_PTXQTOP_S)
#define USB_OTGFS_HPTXSTS_PTXQTOP_V  0x000000FFU
#define USB_OTGFS_HPTXSTS_PTXQTOP_S  24

/** USB_OTGFS_HAINT_REG register
 *  Host All Channels Interrupt Register  When a significant event occurs on a channel,
 *  the Host All Channels Interrupt register interrupts the application using the Host
 *  Channels Interrupt bit of the Core Interrupt register (GINTSTS.HChInt). This is
 *  shown in the Interrupt Hierarchy figure in the databook. There is one interrupt bit
 *  per channel, up to a maximum of 16 bits. Bits in this register are set and cleared
 *  when the application sets and clears bits in the corresponding Host Channel-n
 *  Interrupt register.
 */
#define USB_OTGFS_HAINT_REG(i) (DR_REG_USB_BASE(i) + 0x414)
/** USB_OTGFS_HAINT_HAINT : RO; bitpos: [7:0]; default: 0;
 *
 *  Channel Interrupt for channel no.
 */
#define USB_OTGFS_HAINT_HAINT    0x000000FFU
#define USB_OTGFS_HAINT_HAINT_M  (USB_OTGFS_HAINT_HAINT_V << USB_OTGFS_HAINT_HAINT_S)
#define USB_OTGFS_HAINT_HAINT_V  0x000000FFU
#define USB_OTGFS_HAINT_HAINT_S  0

/** USB_OTGFS_HAINTMSK_REG register
 *  Host All Channels Interrupt Mask Register  The Host All Channel Interrupt Mask
 *  register works with the Host All Channel Interrupt register to interrupt the
 *  application when an event occurs on a channel. There is one interrupt mask bit per
 *  channel, up to a maximum of 16 bits.
 */
#define USB_OTGFS_HAINTMSK_REG(i) (DR_REG_USB_BASE(i) + 0x418)
/** USB_OTGFS_HAINTMSK_HAINTMSK : R/W; bitpos: [7:0]; default: 0;
 *  Channel Interrupt Mask (HAINTMsk)
 *  One bit per channel: Bit 0 for channel 0, bit 15 for channel 15
 */
#define USB_OTGFS_HAINTMSK_HAINTMSK    0x000000FFU
#define USB_OTGFS_HAINTMSK_HAINTMSK_M  (USB_OTGFS_HAINTMSK_HAINTMSK_V << USB_OTGFS_HAINTMSK_HAINTMSK_S)
#define USB_OTGFS_HAINTMSK_HAINTMSK_V  0x000000FFU
#define USB_OTGFS_HAINTMSK_HAINTMSK_S  0

/** USB_OTGFS_HFLBAddr_REG register
 *  Host Frame List Base Address Register  This register is present only in case of
 *  Scatter/Gather DMA. It is implemented as flops. This register holds the starting
 *  address of the Frame list information.
 */
#define USB_OTGFS_HFLBADDR_REG(i) (DR_REG_USB_BASE(i) + 0x41c)
/** USB_OTGFS_HFLBADDR_HFLBADDR : R/W; bitpos: [31:0]; default: 0;
 *  The starting address of the Frame list.
 *  This register is used only for Isochronous and Interrupt Channels.
 */
#define USB_OTGFS_HFLBADDR_HFLBADDR    0xFFFFFFFFU
#define USB_OTGFS_HFLBADDR_HFLBADDR_M  (USB_OTGFS_HFLBADDR_HFLBADDR_V << USB_OTGFS_HFLBADDR_HFLBADDR_S)
#define USB_OTGFS_HFLBADDR_HFLBADDR_V  0xFFFFFFFFU
#define USB_OTGFS_HFLBADDR_HFLBADDR_S  0

/** USB_OTGFS_HPRT_REG register
 *  Host Port Control and Status Register  This register is available only in Host
 *  mode. Currently, the OTG Host supports only one port. A single register holds USB
 *  port-related information such as USB reset, enable, suspend, resume, connect
 *  status, and test mode for each port. It is shown in the Interrupt Hierarchy figure
 *  in the databook. The R_SS_WC bits in this register can trigger an interrupt to the
 *  application through the Host Port Interrupt bit of the Core Interrupt register
 *  (GINTSTS.PrtInt). On a Port Interrupt, the application must read this register and
 *  clear the bit that caused the interrupt. For the R_SS_WC bits, the application must
 *  write a 1 to the bit to clear the interrupt.
 */
#define USB_OTGFS_HPRT_REG(i) (DR_REG_USB_BASE(i) + 0x440)
/** USB_OTGFS_HPRT_PRTCONNSTS : RO; bitpos: [0]; default: 0;
 *  Port Connect Status (PrtConnSts)
 *  - 0: No device is attached to the port.
 *  - 1: A device is attached to the port.
 */
#define USB_OTGFS_HPRT_PRTCONNSTS    (BIT(0))
#define USB_OTGFS_HPRT_PRTCONNSTS_M  (USB_OTGFS_HPRT_PRTCONNSTS_V << USB_OTGFS_HPRT_PRTCONNSTS_S)
#define USB_OTGFS_HPRT_PRTCONNSTS_V  0x00000001U
#define USB_OTGFS_HPRT_PRTCONNSTS_S  0
/** USB_OTGFS_HPRT_PRTCONNDET : R/W; bitpos: [1]; default: 0;
 *  Port Connect Detected (PrtConnDet)
 *
 *  The core sets this bit when a device connection is detected
 *  to trigger an interrupt to the application using the Host Port
 *  Interrupt bit of the Core Interrupt register (GINTSTS.PrtInt).This bit can be set
 *  only by the core and the application should write 1 to clear it.The application
 *  must write a 1 to this bit to clear the
 *  interrupt.
 */
#define USB_OTGFS_HPRT_PRTCONNDET    (BIT(1))
#define USB_OTGFS_HPRT_PRTCONNDET_M  (USB_OTGFS_HPRT_PRTCONNDET_V << USB_OTGFS_HPRT_PRTCONNDET_S)
#define USB_OTGFS_HPRT_PRTCONNDET_V  0x00000001U
#define USB_OTGFS_HPRT_PRTCONNDET_S  1
/** USB_OTGFS_HPRT_PRTENA : R/W; bitpos: [2]; default: 0;
 *  Port Enable (PrtEna)
 *
 *  A port is enabled only by the core after a reset sequence,
 *  and is disabled by an overcurrent condition, a disconnect
 *  condition, or by the application clearing this bit. The
 *  application cannot Set this bit by a register write. It can only
 *  clear it to disable the port by writing 1. This bit does not trigger any
 *  interrupt to the application.
 *  - 1'b0: Port disabled
 *  - 1'b1: Port enabled
 */
#define USB_OTGFS_HPRT_PRTENA    (BIT(2))
#define USB_OTGFS_HPRT_PRTENA_M  (USB_OTGFS_HPRT_PRTENA_V << USB_OTGFS_HPRT_PRTENA_S)
#define USB_OTGFS_HPRT_PRTENA_V  0x00000001U
#define USB_OTGFS_HPRT_PRTENA_S  2
/** USB_OTGFS_HPRT_PRTENCHNG : R/W; bitpos: [3]; default: 0;
 *  Port Enable/Disable Change (PrtEnChng)
 *
 *  The core sets this bit when the status of the Port Enable bit [2] of this register
 *  changes.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HPRT_PRTENCHNG    (BIT(3))
#define USB_OTGFS_HPRT_PRTENCHNG_M  (USB_OTGFS_HPRT_PRTENCHNG_V << USB_OTGFS_HPRT_PRTENCHNG_S)
#define USB_OTGFS_HPRT_PRTENCHNG_V  0x00000001U
#define USB_OTGFS_HPRT_PRTENCHNG_S  3
/** USB_OTGFS_HPRT_PRTOVRCURRACT : RO; bitpos: [4]; default: 0;
 *  Port Overcurrent Active (PrtOvrCurrAct)
 *
 *  Indicates the overcurrent condition of the port.
 *  - 1'b0: No overcurrent condition
 *  - 1'b1: Overcurrent condition
 */
#define USB_OTGFS_HPRT_PRTOVRCURRACT    (BIT(4))
#define USB_OTGFS_HPRT_PRTOVRCURRACT_M  (USB_OTGFS_HPRT_PRTOVRCURRACT_V << USB_OTGFS_HPRT_PRTOVRCURRACT_S)
#define USB_OTGFS_HPRT_PRTOVRCURRACT_V  0x00000001U
#define USB_OTGFS_HPRT_PRTOVRCURRACT_S  4
/** USB_OTGFS_HPRT_PRTOVRCURRCHNG : R/W; bitpos: [5]; default: 0;
 *  Port Overcurrent Change (PrtOvrCurrChng)
 *
 *  The core sets this bit when the status of the Port Overcurrent Active bit (bit 4)
 *  in this register changes.This bit can be set only by the core and the application
 *  should write 1 to clear it
 */
#define USB_OTGFS_HPRT_PRTOVRCURRCHNG    (BIT(5))
#define USB_OTGFS_HPRT_PRTOVRCURRCHNG_M  (USB_OTGFS_HPRT_PRTOVRCURRCHNG_V << USB_OTGFS_HPRT_PRTOVRCURRCHNG_S)
#define USB_OTGFS_HPRT_PRTOVRCURRCHNG_V  0x00000001U
#define USB_OTGFS_HPRT_PRTOVRCURRCHNG_S  5
/** USB_OTGFS_HPRT_PRTRES : R/W; bitpos: [6]; default: 0;
 *  Port Resume (PrtRes)
 *
 *  The application sets this bit to drive resume signaling on the
 *  port. The core continues to drive the resume signal until the
 *  application clears this bit.
 *
 *  If the core detects a USB remote wakeup sequence, as
 *  indicated by the Port Resume/Remote Wakeup Detected
 *  Interrupt bit of the Core Interrupt register
 *  (GINTSTS.WkUpInt), the core starts driving resume
 *  signaling without application intervention and clears this bit
 *  when it detects a disconnect condition. The read value of
 *  this bit indicates whether the core is currently driving
 *  resume signaling.
 *  - 1'b0: No resume driven
 *  - 1'b1: Resume driven
 *  When LPM is enabled, In L1 state the behavior of this bit is as follows:
 *  The application sets this bit to drive resume signaling on the port.
 *  The core continues to drive the resume signal until a pre-determined time
 *  specified in GLPMCFG.HIRD_Thres[3:0] field. If the core detects a USB remote
 *  wakeup sequence, as indicated by the Port L1Resume/Remote L1Wakeup Detected
 *  Interrupt bit of the Core Interrupt register (GINTSTS.L1WkUpInt),
 *  the core starts driving resume signaling without application intervention
 *  and clears this bit at the end of resume.This bit can be set by both core or
 *  application
 *  and also cleared by core or application. This bit is cleared by the core even if
 *  there is
 *  no device connected to the Host.
 */
#define USB_OTGFS_HPRT_PRTRES    (BIT(6))
#define USB_OTGFS_HPRT_PRTRES_M  (USB_OTGFS_HPRT_PRTRES_V << USB_OTGFS_HPRT_PRTRES_S)
#define USB_OTGFS_HPRT_PRTRES_V  0x00000001U
#define USB_OTGFS_HPRT_PRTRES_S  6
/** USB_OTGFS_HPRT_PRTSUSP : R/W; bitpos: [7]; default: 0;
 *  Port Suspend (PrtSusp)
 *
 *  The application sets this bit to put this port in Suspend
 *  mode. The core only stops sending SOFs when this is Set.
 *  To stop the PHY clock, the application must Set the Port
 *  Clock Stop bit, which asserts the suspend input pin of the
 *  PHY.
 *
 *  The read value of this bit reflects the current suspend status
 *  of the port. This bit is cleared by the core after a remote
 *  wakeup signal is detected or the application sets the Port
 *  Reset bit or Port Resume bit in this register or the
 *  Resume/Remote Wakeup Detected Interrupt bit or
 *  Disconnect Detected Interrupt bit in the Core Interrupt
 *  register (GINTSTS.WkUpInt or GINTSTS.DisconnInt,
 *  respectively).This bit is cleared by the core even if there is
 *  no device connected to the Host.
 *  - 1'b0: Port not in Suspend mode
 *  - 1'b1: Port in Suspend mode
 */
#define USB_OTGFS_HPRT_PRTSUSP    (BIT(7))
#define USB_OTGFS_HPRT_PRTSUSP_M  (USB_OTGFS_HPRT_PRTSUSP_V << USB_OTGFS_HPRT_PRTSUSP_S)
#define USB_OTGFS_HPRT_PRTSUSP_V  0x00000001U
#define USB_OTGFS_HPRT_PRTSUSP_S  7
/** USB_OTGFS_HPRT_PRTRST : R/W; bitpos: [8]; default: 0;
 *  Port Reset (PrtRst)
 *
 *  When the application sets this bit, a reset sequence is
 *  started on this port. The application must time the reset
 *  period and clear this bit after the reset sequence is
 *  complete.
 *  - 1'b0: Port not in reset
 *  - 1'b1: Port in reset
 *  The application must leave this bit set for at least a
 *  minimum duration mentioned below to start a reset on the
 *  port. The application can leave it set for another 10 ms in
 *  addition to the required minimum duration, before clearing
 *  the bit, even though there is no maximum limit Set by the
 *  USB standard.This bit is cleared by the core even if there is
 *  no device connected to the Host.
 *  - High speed: 50 ms
 *  - Full speed/Low speed: 10 ms
 */
#define USB_OTGFS_HPRT_PRTRST    (BIT(8))
#define USB_OTGFS_HPRT_PRTRST_M  (USB_OTGFS_HPRT_PRTRST_V << USB_OTGFS_HPRT_PRTRST_S)
#define USB_OTGFS_HPRT_PRTRST_V  0x00000001U
#define USB_OTGFS_HPRT_PRTRST_S  8
/** USB_OTGFS_HPRT_PRTLNSTS : RO; bitpos: [11:10]; default: 0;
 *  Port Line Status (PrtLnSts)
 *
 *  Indicates the current logic level USB data lines
 *  - Bit [10]: Logic level of D+
 *  - Bit [11]: Logic level of D-
 */
#define USB_OTGFS_HPRT_PRTLNSTS    0x00000003U
#define USB_OTGFS_HPRT_PRTLNSTS_M  (USB_OTGFS_HPRT_PRTLNSTS_V << USB_OTGFS_HPRT_PRTLNSTS_S)
#define USB_OTGFS_HPRT_PRTLNSTS_V  0x00000003U
#define USB_OTGFS_HPRT_PRTLNSTS_S  10
/** USB_OTGFS_HPRT_PRTPWR : R/W; bitpos: [12]; default: 0;
 *  Port Power (PrtPwr)
 *
 *  The application uses this field to control power to this port (write 1'b1 to set to
 *  1'b1
 *  and write 1'b0 to set to 1'b0), and the core can clear this bit on an over current
 *  condition.
 *  - 1'b0: Power off
 *  - 1'b1: Power on
 *
 *  Note: This bit is interface independent. The application needs to program this bit
 *  for all interfaces as described in the host programming flow in the Programming
 *  Guide.
 */
#define USB_OTGFS_HPRT_PRTPWR    (BIT(12))
#define USB_OTGFS_HPRT_PRTPWR_M  (USB_OTGFS_HPRT_PRTPWR_V << USB_OTGFS_HPRT_PRTPWR_S)
#define USB_OTGFS_HPRT_PRTPWR_V  0x00000001U
#define USB_OTGFS_HPRT_PRTPWR_S  12
/** USB_OTGFS_HPRT_PRTTSTCTL : R/W; bitpos: [16:13]; default: 0;
 *  Port Test Control (PrtTstCtl)
 *
 *  The application writes a nonzero value to this field to put the port into a Test
 *  mode, and the corresponding pattern is signaled on the port.
 *  - 4'b0000: Test mode disabled
 *  - 4'b0001: Test_J mode
 *  - 4'b0010: Test_K mode
 *  - 4'b0011: Test_SE0_NAK mode
 *  - 4'b0100: Test_Packet mode
 *  - 4'b0101: Test_Force_Enable
 *  - Others: Reserved
 *
 *  To move the DWC_otg controller to test mode, you must set this field. Complete the
 *  following steps to move the DWC_otg core to test mode:
 *  - 1. Power on the core.
 *  - 2. Load the DWC_otg driver.
 *  - 3. Connect an HS device and enumerate to HS mode.
 *  - 4. Access the HPRT register to send test packets.
 *  - 5. Remove the device and connect to fixture (OPT) port. The DWC_otg host core
 *  continues sending out test packets.
 *  - 6. Test the eye diagram.
 */
#define USB_OTGFS_HPRT_PRTTSTCTL    0x0000000FU
#define USB_OTGFS_HPRT_PRTTSTCTL_M  (USB_OTGFS_HPRT_PRTTSTCTL_V << USB_OTGFS_HPRT_PRTTSTCTL_S)
#define USB_OTGFS_HPRT_PRTTSTCTL_V  0x0000000FU
#define USB_OTGFS_HPRT_PRTTSTCTL_S  13
/** USB_OTGFS_HPRT_PRTSPD : RO; bitpos: [18:17]; default: 0;
 *  Port Speed (PrtSpd)
 *
 *  Indicates the speed of the device attached to this port.
 *  - 2'b00: High speed
 *  - 2'b01: Full speed
 *  - 2'b10: Low speed
 *  - 2'b11: Reserved
 */
#define USB_OTGFS_HPRT_PRTSPD    0x00000003U
#define USB_OTGFS_HPRT_PRTSPD_M  (USB_OTGFS_HPRT_PRTSPD_V << USB_OTGFS_HPRT_PRTSPD_S)
#define USB_OTGFS_HPRT_PRTSPD_V  0x00000003U
#define USB_OTGFS_HPRT_PRTSPD_S  17

