espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_HCDMAB0_REG register
 *  Host Channel $i DMA Buffer Address Register  This register is present only in case
 *  of Scatter/Gather DMA. It is implemented in RAM instead of flop-based
 *  implementation. This register holds the current buffer address.
 */
#define USB_OTGFS_HCDMAB0_REG(i) (DR_REG_USB_BASE(i) + 0x51c)
/** USB_OTGFS_HCDMAB0_HCDMAB : RO; bitpos: [31:0]; default: 0;
 *  Holds the current buffer address.
 *  This register is updated as and when the data transfer for the corresponding end
 *  point
 *  is in progress. This register is present only in Scatter/Gather DMA mode. Otherwise
 *  this
 *  field is reserved.
 */
#define USB_OTGFS_HCDMAB0_HCDMAB    0xFFFFFFFFU
#define USB_OTGFS_HCDMAB0_HCDMAB_M  (USB_OTGFS_HCDMAB0_HCDMAB_V << USB_OTGFS_HCDMAB0_HCDMAB_S)
#define USB_OTGFS_HCDMAB0_HCDMAB_V  0xFFFFFFFFU
#define USB_OTGFS_HCDMAB0_HCDMAB_S  0

/** USB_OTGFS_HCCHAR1_REG register
 *  Host Channel 1 Characteristics Register
 */
#define USB_OTGFS_HCCHAR1_REG(i) (DR_REG_USB_BASE(i) + 0x520)
/** USB_OTGFS_HCCHAR1_MPS : R/W; bitpos: [10:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  Indicates the maximum packet size of the associated endpoint.
 */
#define USB_OTGFS_HCCHAR1_MPS    0x000007FFU
#define USB_OTGFS_HCCHAR1_MPS_M  (USB_OTGFS_HCCHAR1_MPS_V << USB_OTGFS_HCCHAR1_MPS_S)
#define USB_OTGFS_HCCHAR1_MPS_V  0x000007FFU
#define USB_OTGFS_HCCHAR1_MPS_S  0
/** USB_OTGFS_HCCHAR1_EPNUM : R/W; bitpos: [14:11]; default: 0;
 *  Endpoint Number (EPNum)
 *
 *  Indicates the endpoint number on the device serving as the data source or sink.
 */
#define USB_OTGFS_HCCHAR1_EPNUM    0x0000000FU
#define USB_OTGFS_HCCHAR1_EPNUM_M  (USB_OTGFS_HCCHAR1_EPNUM_V << USB_OTGFS_HCCHAR1_EPNUM_S)
#define USB_OTGFS_HCCHAR1_EPNUM_V  0x0000000FU
#define USB_OTGFS_HCCHAR1_EPNUM_S  11
/** USB_OTGFS_HCCHAR1_EPDIR : R/W; bitpos: [15]; default: 0;
 *  Endpoint Direction (EPDir)
 *
 *  Indicates whether the transaction is IN or OUT.
 *  - 1'b0: OUT
 *  - 1'b1: IN
 */
#define USB_OTGFS_HCCHAR1_EPDIR    (BIT(15))
#define USB_OTGFS_HCCHAR1_EPDIR_M  (USB_OTGFS_HCCHAR1_EPDIR_V << USB_OTGFS_HCCHAR1_EPDIR_S)
#define USB_OTGFS_HCCHAR1_EPDIR_V  0x00000001U
#define USB_OTGFS_HCCHAR1_EPDIR_S  15
/** USB_OTGFS_HCCHAR1_LSPDDEV : R/W; bitpos: [17]; default: 0;
 *  Low-Speed Device (LSpdDev)
 *
 *  This field is Set by the application to indicate that this channel is communicating
 *  to a low-speed device.
 *
 *  The application must program this bit when a low speed device is connected to the
 *  host through an FS HUB. The DWC_otg Host core uses this field to drive the
 *  XCVR_SELECT signal to 2'b11 while communicating to the LS Device through the FS hub.
 *
 *  Note: In a peer to peer setup, the DWC_otg Host core ignores this bit even if it is
 *  set by the application software.
 */
#define USB_OTGFS_HCCHAR1_LSPDDEV    (BIT(17))
#define USB_OTGFS_HCCHAR1_LSPDDEV_M  (USB_OTGFS_HCCHAR1_LSPDDEV_V << USB_OTGFS_HCCHAR1_LSPDDEV_S)
#define USB_OTGFS_HCCHAR1_LSPDDEV_V  0x00000001U
#define USB_OTGFS_HCCHAR1_LSPDDEV_S  17
/** USB_OTGFS_HCCHAR1_EPTYPE : R/W; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *
 *  Indicates the transfer type selected.
 *  - 2'b00: Control
 *  - 2'b01: Isochronous
 *  - 2'b10: Bulk
 *  - 2'b11: Interrupt
 */
#define USB_OTGFS_HCCHAR1_EPTYPE    0x00000003U
#define USB_OTGFS_HCCHAR1_EPTYPE_M  (USB_OTGFS_HCCHAR1_EPTYPE_V << USB_OTGFS_HCCHAR1_EPTYPE_S)
#define USB_OTGFS_HCCHAR1_EPTYPE_V  0x00000003U
#define USB_OTGFS_HCCHAR1_EPTYPE_S  18
/** USB_OTGFS_HCCHAR1_EC : R/W; bitpos: [21:20]; default: 0;
 *  Multi Count (MC) / Error Count (EC)
 *
 *  When the Split Enable bit of the Host Channel-n Split Control
 *  register (HCSPLTn.SpltEna) is reset (1'b0), this field indicates to
 *  the host the number of transactions that must be executed per
 *  microframe for this periodic endpoint. For non periodic transfers,
 *  this field is used only in DMA mode, and specifies the number
 *  packets to be fetched for this channel before the internal DMA
 *  engine changes arbitration.
 *  - 2'b00: Reserved This field yields undefined results.
 *  - 2'b01: 1 transaction
 *  - 2'b10: 2 transactions to be issued for this endpoint per microframe
 *  - 2'b11: 3 transactions to be issued for this endpoint per microframe
 *  When HCSPLTn.SpltEna is Set (1'b1), this field indicates the
 *  number of immediate retries to be performed for a periodic split
 *  transactions on transaction errors. This field must be Set to at
 *  least 2'b01.
 */
#define USB_OTGFS_HCCHAR1_EC    0x00000003U
#define USB_OTGFS_HCCHAR1_EC_M  (USB_OTGFS_HCCHAR1_EC_V << USB_OTGFS_HCCHAR1_EC_S)
#define USB_OTGFS_HCCHAR1_EC_V  0x00000003U
#define USB_OTGFS_HCCHAR1_EC_S  20
/** USB_OTGFS_HCCHAR1_DEVADDR : R/W; bitpos: [28:22]; default: 0;
 *  Device Address (DevAddr)
 *
 *  This field selects the specific device serving as the data source
 *  or sink.
 */
#define USB_OTGFS_HCCHAR1_DEVADDR    0x0000007FU
#define USB_OTGFS_HCCHAR1_DEVADDR_M  (USB_OTGFS_HCCHAR1_DEVADDR_V << USB_OTGFS_HCCHAR1_DEVADDR_S)
#define USB_OTGFS_HCCHAR1_DEVADDR_V  0x0000007FU
#define USB_OTGFS_HCCHAR1_DEVADDR_S  22
/** USB_OTGFS_HCCHAR1_ODDFRM : R/W; bitpos: [29]; default: 0;
 *  Odd Frame (OddFrm)
 *
 *  This field is set (reset) by the application to indicate that the OTG host must
 *  perform
 *  a transfer in an odd (micro)Frame. This field is applicable for only periodic
 *  (isochronous and interrupt) transactions.
 *  - 1'b0: Even (micro)Frame
 *  - 1'b1: Odd (micro)Frame
 */
#define USB_OTGFS_HCCHAR1_ODDFRM    (BIT(29))
#define USB_OTGFS_HCCHAR1_ODDFRM_M  (USB_OTGFS_HCCHAR1_ODDFRM_V << USB_OTGFS_HCCHAR1_ODDFRM_S)
#define USB_OTGFS_HCCHAR1_ODDFRM_V  0x00000001U
#define USB_OTGFS_HCCHAR1_ODDFRM_S  29
/** USB_OTGFS_HCCHAR1_CHDIS : R/W; bitpos: [30]; default: 0;
 *  Channel Disable (ChDis)
 *
 *  The application sets this bit to stop transmitting/receiving data
 *  on a channel, even before the transfer for that channel is
 *  complete. The application must wait for the Channel Disabled
 *  interrupt before treating the channel as disabled.
 */
#define USB_OTGFS_HCCHAR1_CHDIS    (BIT(30))
#define USB_OTGFS_HCCHAR1_CHDIS_M  (USB_OTGFS_HCCHAR1_CHDIS_V << USB_OTGFS_HCCHAR1_CHDIS_S)
#define USB_OTGFS_HCCHAR1_CHDIS_V  0x00000001U
#define USB_OTGFS_HCCHAR1_CHDIS_S  30
/** USB_OTGFS_HCCHAR1_CHENA : R/W; bitpos: [31]; default: 0;
 *  Channel Enable (ChEna)
 *
 *  When Scatter/Gather mode is enabled
 *  - 1'b0: Indicates that the descriptor structure is not yet ready.
 *  - 1'b1:  Indicates  that  the  descriptor  structure  and  data  buffer  with data
 *  is setup and this channel can access the descriptor.
 *  When Scatter/Gather mode is disabled
 *
 *  This field is set by the application and cleared by the OTG host.
 *  - 1'b0: Channel disabled
 *  - 1'b1: Channel enabled
 */
#define USB_OTGFS_HCCHAR1_CHENA    (BIT(31))
#define USB_OTGFS_HCCHAR1_CHENA_M  (USB_OTGFS_HCCHAR1_CHENA_V << USB_OTGFS_HCCHAR1_CHENA_S)
#define USB_OTGFS_HCCHAR1_CHENA_V  0x00000001U
#define USB_OTGFS_HCCHAR1_CHENA_S  31

/** USB_OTGFS_HCINT1_REG register
 *  Host Channel $i Interrupt Register  This register indicates the status of a channel
 *  with respect to USB- and AHB-related events. It is shown in the Interrupt Hierarchy
 *  figure in the databook. The application must read this register when the Host
 *  Channels Interrupt bit of the Core Interrupt register (GINTSTS.HChInt) is set.
 *  Before the application can read this register, it must first read the Host All
 *  Channels Interrupt (HAINT) register to get the exact channel number for the Host
 *  Channel-n Interrupt register. The application must clear the appropriate bit in
 *  this register to clear the corresponding bits in the HAINT and GINTSTS registers.
 */
#define USB_OTGFS_HCINT1_REG(i) (DR_REG_USB_BASE(i) + 0x528)
/** USB_OTGFS_HCINT1_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed (XferCompl)
 *
 *  Transfer completed normally without any errors.This bit can be set only by the core
 *  and the application should write 1 to clear it.
 *  - For Scatter/Gather DMA mode, it indicates that current descriptor processing got
 *  completed with IOC bit set in its descriptor.
 *  - In non Scatter/Gather DMA mode, it indicates that Transfer completed normally
 *  without any errors.
 */
#define USB_OTGFS_HCINT1_XFERCOMPL    (BIT(0))
#define USB_OTGFS_HCINT1_XFERCOMPL_M  (USB_OTGFS_HCINT1_XFERCOMPL_V << USB_OTGFS_HCINT1_XFERCOMPL_S)
#define USB_OTGFS_HCINT1_XFERCOMPL_V  0x00000001U
#define USB_OTGFS_HCINT1_XFERCOMPL_S  0
/** USB_OTGFS_HCINT1_CHHLTD : R/W; bitpos: [1]; default: 0;
 *  Channel Halted (ChHltd)
 *
 *  In non Scatter/Gather DMA mode, it indicates the transfer completed abnormally
 *  either because of any USB transaction error or in response to disable request by
 *  the application or because of a completed transfer.
 *
 *  In Scatter/gather DMA mode, this indicates that transfer completed due to any of
 *  the following
 *  - EOL being set in descriptor
 *  - AHB error
 *  - Excessive transaction errors
 *  - Babble
 *  - Stall
 */
#define USB_OTGFS_HCINT1_CHHLTD    (BIT(1))
#define USB_OTGFS_HCINT1_CHHLTD_M  (USB_OTGFS_HCINT1_CHHLTD_V << USB_OTGFS_HCINT1_CHHLTD_S)
#define USB_OTGFS_HCINT1_CHHLTD_V  0x00000001U
#define USB_OTGFS_HCINT1_CHHLTD_S  1
/** USB_OTGFS_HCINT1_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  This is generated only in Internal DMA mode when there is an AHB error during AHB
 *  read/write. The application can read the corresponding channel's DMA address
 *  register to get the error address.
 */
#define USB_OTGFS_HCINT1_AHBERR    (BIT(2))
#define USB_OTGFS_HCINT1_AHBERR_M  (USB_OTGFS_HCINT1_AHBERR_V << USB_OTGFS_HCINT1_AHBERR_S)
#define USB_OTGFS_HCINT1_AHBERR_V  0x00000001U
#define USB_OTGFS_HCINT1_AHBERR_S  2
/** USB_OTGFS_HCINT1_STALL : R/W; bitpos: [3]; default: 0;
 *  STALL Response Received Interrupt (STALL)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HCINT1_STALL    (BIT(3))
#define USB_OTGFS_HCINT1_STALL_M  (USB_OTGFS_HCINT1_STALL_V << USB_OTGFS_HCINT1_STALL_S)
#define USB_OTGFS_HCINT1_STALL_V  0x00000001U
#define USB_OTGFS_HCINT1_STALL_S  3
/** USB_OTGFS_HCINT1_NAK : R/W; bitpos: [4]; default: 0;
 *  NAK Response Received Interrupt (NAK)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HCINT1_NAK    (BIT(4))
#define USB_OTGFS_HCINT1_NAK_M  (USB_OTGFS_HCINT1_NAK_V << USB_OTGFS_HCINT1_NAK_S)
#define USB_OTGFS_HCINT1_NAK_V  0x00000001U
#define USB_OTGFS_HCINT1_NAK_S  4
/** USB_OTGFS_HCINT1_ACK : R/W; bitpos: [5]; default: 0;
 *  ACK Response Received/Transmitted Interrupt (ACK)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HCINT1_ACK    (BIT(5))
#define USB_OTGFS_HCINT1_ACK_M  (USB_OTGFS_HCINT1_ACK_V << USB_OTGFS_HCINT1_ACK_S)
#define USB_OTGFS_HCINT1_ACK_V  0x00000001U
#define USB_OTGFS_HCINT1_ACK_S  5
/** USB_OTGFS_HCINT1_NYET : R/W; bitpos: [6]; default: 0;
 *  NYET Response Received Interrupt (NYET)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HCINT1_NYET    (BIT(6))
#define USB_OTGFS_HCINT1_NYET_M  (USB_OTGFS_HCINT1_NYET_V << USB_OTGFS_HCINT1_NYET_S)
#define USB_OTGFS_HCINT1_NYET_V  0x00000001U
#define USB_OTGFS_HCINT1_NYET_S  6
/** USB_OTGFS_HCINT1_XACTERR : R/W; bitpos: [7]; default: 0;
 *  Transaction Error (XactErr)
 *
 *  Indicates one of the following errors occurred on the USB.
 *  - CRC check failure
 *  - Timeout
 *  - Bit stuff error
 *  - False EOP
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HCINT1_XACTERR    (BIT(7))
#define USB_OTGFS_HCINT1_XACTERR_M  (USB_OTGFS_HCINT1_XACTERR_V << USB_OTGFS_HCINT1_XACTERR_S)
#define USB_OTGFS_HCINT1_XACTERR_V  0x00000001U
#define USB_OTGFS_HCINT1_XACTERR_S  7
/** USB_OTGFS_HCINT1_BBLERR : R/W; bitpos: [8]; default: 0;
 *  Babble Error (BblErr)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the core.
 *  This bit can be set only by the core and the application should write 1 to clear it.
 */
#define USB_OTGFS_HCINT1_BBLERR    (BIT(8))
#define USB_OTGFS_HCINT1_BBLERR_M  (USB_OTGFS_HCINT1_BBLERR_V << USB_OTGFS_HCINT1_BBLERR_S)
#define USB_OTGFS_HCINT1_BBLERR_V  0x00000001U
#define USB_OTGFS_HCINT1_BBLERR_S  8
/** USB_OTGFS_HCINT1_FRMOVRUN : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun (FrmOvrun).
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked
 *  in the core. This bit can be set only by the core and the application should write
 *  1 to clear
 *  it.
 */
#define USB_OTGFS_HCINT1_FRMOVRUN    (BIT(9))
#define USB_OTGFS_HCINT1_FRMOVRUN_M  (USB_OTGFS_HCINT1_FRMOVRUN_V << USB_OTGFS_HCINT1_FRMOVRUN_S)
#define USB_OTGFS_HCINT1_FRMOVRUN_V  0x00000001U
#define USB_OTGFS_HCINT1_FRMOVRUN_S  9
/** USB_OTGFS_HCINT1_DATATGLERR : R/W; bitpos: [10]; default: 0;
 *
 *  Data Toggle Error (DataTglErr).This bit can be set only by the core and the
 *  application should write 1 to clear
 *  it.In Scatter/Gather DMA mode, the interrupt due to this bit is masked
 *  in the core.
 */
#define USB_OTGFS_HCINT1_DATATGLERR    (BIT(10))
#define USB_OTGFS_HCINT1_DATATGLERR_M  (USB_OTGFS_HCINT1_DATATGLERR_V << USB_OTGFS_HCINT1_DATATGLERR_S)
#define USB_OTGFS_HCINT1_DATATGLERR_V  0x00000001U
#define USB_OTGFS_HCINT1_DATATGLERR_S  10
/** USB_OTGFS_HCINT1_BNAINTR : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 *  The core generates this interrupt when the descriptor accessed
 *  is not ready for the Core to process. BNA will not be generated
 *  for Isochronous channels.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGFS_HCINT1_BNAINTR    (BIT(11))
#define USB_OTGFS_HCINT1_BNAINTR_M  (USB_OTGFS_HCINT1_BNAINTR_V << USB_OTGFS_HCINT1_BNAINTR_S)
#define USB_OTGFS_HCINT1_BNAINTR_V  0x00000001U
#define USB_OTGFS_HCINT1_BNAINTR_S  11
/** USB_OTGFS_HCINT1_XCS_XACT_ERR : R/W; bitpos: [12]; default: 0;
 *  Excessive Transaction Error (XCS_XACT_ERR)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this
 *  bit
 *  when 3 consecutive transaction errors occurred on the USB bus. XCS_XACT_ERR will
 *  not be generated for Isochronous channels.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGFS_HCINT1_XCS_XACT_ERR    (BIT(12))
#define USB_OTGFS_HCINT1_XCS_XACT_ERR_M  (USB_OTGFS_HCINT1_XCS_XACT_ERR_V << USB_OTGFS_HCINT1_XCS_XACT_ERR_S)
#define USB_OTGFS_HCINT1_XCS_XACT_ERR_V  0x00000001U
#define USB_OTGFS_HCINT1_XCS_XACT_ERR_S  12
/** USB_OTGFS_HCINT1_DESC_LST_ROLLINTR : R/W; bitpos: [13]; default: 0;
 *  Descriptor rollover interrupt (DESC_LST_ROLLIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this
 *  bit
 *  when the corresponding channel's descriptor list rolls over.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGFS_HCINT1_DESC_LST_ROLLINTR    (BIT(13))
#define USB_OTGFS_HCINT1_DESC_LST_ROLLINTR_M  (USB_OTGFS_HCINT1_DESC_LST_ROLLINTR_V << USB_OTGFS_HCINT1_DESC_LST_ROLLINTR_S)
#define USB_OTGFS_HCINT1_DESC_LST_ROLLINTR_V  0x00000001U
#define USB_OTGFS_HCINT1_DESC_LST_ROLLINTR_S  13

