espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_HCINTMSK1_REG register
 *  Host Channel $i Interrupt Mask Register  This register reflects the mask for each
 *  channel status described in the previous section.
 */
#define USB_OTGFS_HCINTMSK1_REG(i) (DR_REG_USB_BASE(i) + 0x52c)
/** USB_OTGFS_HCINTMSK1_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *
 *  Transfer Completed Mask (XferComplMsk)
 */
#define USB_OTGFS_HCINTMSK1_XFERCOMPLMSK    (BIT(0))
#define USB_OTGFS_HCINTMSK1_XFERCOMPLMSK_M  (USB_OTGFS_HCINTMSK1_XFERCOMPLMSK_V << USB_OTGFS_HCINTMSK1_XFERCOMPLMSK_S)
#define USB_OTGFS_HCINTMSK1_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGFS_HCINTMSK1_XFERCOMPLMSK_S  0
/** USB_OTGFS_HCINTMSK1_CHHLTDMSK : R/W; bitpos: [1]; default: 0;
 *
 *  Channel Halted Mask (ChHltdMsk)
 */
#define USB_OTGFS_HCINTMSK1_CHHLTDMSK    (BIT(1))
#define USB_OTGFS_HCINTMSK1_CHHLTDMSK_M  (USB_OTGFS_HCINTMSK1_CHHLTDMSK_V << USB_OTGFS_HCINTMSK1_CHHLTDMSK_S)
#define USB_OTGFS_HCINTMSK1_CHHLTDMSK_V  0x00000001U
#define USB_OTGFS_HCINTMSK1_CHHLTDMSK_S  1
/** USB_OTGFS_HCINTMSK1_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *
 *  AHB Error Mask (AHBErrMsk)
 *  In  scatter/gather  DMA  mode  for  host,
 *  interrupts will not be generated due to the corresponding bits set in
 *  HCINTn.
 */
#define USB_OTGFS_HCINTMSK1_AHBERRMSK    (BIT(2))
#define USB_OTGFS_HCINTMSK1_AHBERRMSK_M  (USB_OTGFS_HCINTMSK1_AHBERRMSK_V << USB_OTGFS_HCINTMSK1_AHBERRMSK_S)
#define USB_OTGFS_HCINTMSK1_AHBERRMSK_V  0x00000001U
#define USB_OTGFS_HCINTMSK1_AHBERRMSK_S  2
/** USB_OTGFS_HCINTMSK1_BNAINTRMSK : R/W; bitpos: [11]; default: 0;
 *
 *  BNA  (Buffer  Not  Available)  Interrupt  mask  register  (BNAIntrMsk)
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 */
#define USB_OTGFS_HCINTMSK1_BNAINTRMSK    (BIT(11))
#define USB_OTGFS_HCINTMSK1_BNAINTRMSK_M  (USB_OTGFS_HCINTMSK1_BNAINTRMSK_V << USB_OTGFS_HCINTMSK1_BNAINTRMSK_S)
#define USB_OTGFS_HCINTMSK1_BNAINTRMSK_V  0x00000001U
#define USB_OTGFS_HCINTMSK1_BNAINTRMSK_S  11
/** USB_OTGFS_HCINTMSK1_DESC_LST_ROLLINTRMSK : R/W; bitpos: [13]; default: 0;
 *
 *  Descriptor List rollover interrupt Mask register(DESC_LST_ROLLIntrMsk)
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 */
#define USB_OTGFS_HCINTMSK1_DESC_LST_ROLLINTRMSK    (BIT(13))
#define USB_OTGFS_HCINTMSK1_DESC_LST_ROLLINTRMSK_M  (USB_OTGFS_HCINTMSK1_DESC_LST_ROLLINTRMSK_V << USB_OTGFS_HCINTMSK1_DESC_LST_ROLLINTRMSK_S)
#define USB_OTGFS_HCINTMSK1_DESC_LST_ROLLINTRMSK_V  0x00000001U
#define USB_OTGFS_HCINTMSK1_DESC_LST_ROLLINTRMSK_S  13

/** USB_OTGFS_HCTSIZ1_REG register
 *  Host Channel 1 Transfer Size Register
 */
#define USB_OTGFS_HCTSIZ1_REG(i) (DR_REG_USB_BASE(i) + 0x530)
/** USB_OTGFS_HCTSIZ1_XFERSIZE : R/W; bitpos: [15:0]; default: 0;
 *  Transfer Size (XferSize)
 *
 *  For an OUT, this field is the number of data bytes the host sends during the
 *  transfer.
 *
 *  For an IN, this field is the buffer size that the application has Reserved for the
 *  transfer. The application is expected to program this field as an integer multiple
 *  of the maximum packet size for IN transactions (periodic and non-periodic).
 *
 *  The width of this counter is specified as Width of Transfer Size Counters during
 *  coreConsultant configuration (parameter OTG_TRANS_COUNT_WIDTH).
 */
#define USB_OTGFS_HCTSIZ1_XFERSIZE    0x0000FFFFU
#define USB_OTGFS_HCTSIZ1_XFERSIZE_M  (USB_OTGFS_HCTSIZ1_XFERSIZE_V << USB_OTGFS_HCTSIZ1_XFERSIZE_S)
#define USB_OTGFS_HCTSIZ1_XFERSIZE_V  0x0000FFFFU
#define USB_OTGFS_HCTSIZ1_XFERSIZE_S  0
/** USB_OTGFS_HCTSIZ1_PKTCNT : R/W; bitpos: [25:19]; default: 0;
 *  Packet Count (PktCnt)
 *
 *  This field is programmed by the application with the expected number of packets to
 *  be transmitted (OUT) or received (IN).
 *
 *  The host decrements this count on every successful transmission or reception of an
 *  OUT/IN packet. Once this count reaches zero, the application is interrupted to
 *  indicate normal completion.
 *
 *  The width of this counter is specified as Width of Packet Counters during
 *  coreConsultant configuration (parameter OTG_PACKET_COUNT_WIDTH).
 */
#define USB_OTGFS_HCTSIZ1_PKTCNT    0x0000007FU
#define USB_OTGFS_HCTSIZ1_PKTCNT_M  (USB_OTGFS_HCTSIZ1_PKTCNT_V << USB_OTGFS_HCTSIZ1_PKTCNT_S)
#define USB_OTGFS_HCTSIZ1_PKTCNT_V  0x0000007FU
#define USB_OTGFS_HCTSIZ1_PKTCNT_S  19
/** USB_OTGFS_HCTSIZ1_PID : R/W; bitpos: [30:29]; default: 0;
 *  PID (Pid)
 *
 *  The application programs this field with the type of PID to use for the initial
 *  transaction. The host maintains this field for the rest of the transfer.
 *  - 2'b00: DATA0
 *  - 2'b01: DATA2
 *  - 2'b10: DATA1
 *  - 2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_OTGFS_HCTSIZ1_PID    0x00000003U
#define USB_OTGFS_HCTSIZ1_PID_M  (USB_OTGFS_HCTSIZ1_PID_V << USB_OTGFS_HCTSIZ1_PID_S)
#define USB_OTGFS_HCTSIZ1_PID_V  0x00000003U
#define USB_OTGFS_HCTSIZ1_PID_S  29
/** USB_OTGFS_HCTSIZ1_DOPNG : R/W; bitpos: [31]; default: 0;
 *  Do Ping (DoPng)
 *
 *  This bit is used only for OUT transfers.
 *  Setting this field to 1 directs the host to do PING protocol.
 *
 *  Note: Do not set this bit for IN transfers. If this bit is set for for IN transfers
 *  it disables the channel.
 */
#define USB_OTGFS_HCTSIZ1_DOPNG    (BIT(31))
#define USB_OTGFS_HCTSIZ1_DOPNG_M  (USB_OTGFS_HCTSIZ1_DOPNG_V << USB_OTGFS_HCTSIZ1_DOPNG_S)
#define USB_OTGFS_HCTSIZ1_DOPNG_V  0x00000001U
#define USB_OTGFS_HCTSIZ1_DOPNG_S  31

/** USB_OTGFS_HCDMA1_REG register
 *  Host Channel $i DMA Address Register  This register is used by the OTG host in the
 *  internal DMA mode to maintain the current buffer pointer for IN/OUT transactions.
 *  The starting DMA address must be DWORD-aligned.
 */
#define USB_OTGFS_HCDMA1_REG(i) (DR_REG_USB_BASE(i) + 0x534)
/** USB_OTGFS_HCDMA1_DMAADDR : R/W; bitpos: [31:0]; default: 0;
 *  In Buffer DMA Mode:
 *
 *  [31:0]: DMA Address (DMAAddr)
 *
 *  This field holds the start address in the external memory from which the data for
 *  the endpoint must be fetched or to which it must be stored. This register is
 *  incremented on every AHB transaction.
 *
 *  Reset: X if not programmed as the register is in SPRAM.
 *
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *
 *  [31:9]: DMA Address (DMAAddr)
 *
 *  The start address must be 512-bytes aligned.
 *
 *  This field holds the start address of the 512 bytes page. The first descriptor in
 *  the list should be located in this address. The first descriptor may be or may not
 *  be ready. The core starts processing the list from the CTD value.
 *
 *  [8:3]: Current Transfer Desc(CTD)
 *
 *  This value is in terms of number of descriptors. The values can be from 0 to 63.
 *  - 0 -  1 descriptor.
 *  - 63 - 64 descriptors.
 *  This field indicates the current descriptor processed in the list. This field is
 *  updated both by application and the core. For example, if the application enables
 *  the channel after programming CTD=5, then the core will start processing the sixth
 *  descriptor. The address is obtained by adding a value of (8bytes*5=) 40(decimal) to
 *  DMAAddr.
 *
 *  Reset: 6'h0
 *
 *  [2:0]: Reserved
 *
 *  In Scatter-Gather DMA (DescDMA) Mode for Isochronous:
 *
 *  [31:N]: DMA Address (DMAAddr)
 *
 *  The start address must be 512-bytes aligned.
 *
 *  This field holds the address of the 2*(nTD+1) bytes of locations in which the
 *  isochronous descriptors are present where N is based on nTD as follows:
 *  - [31:N]: Base Address
 *  - [N-1:3]: Offset
 *  - [2:0]: 000
 *  For HS ISOC, if nTD is,
 *  - 7, N=6
 *  - 15, N=7
 *  - 31, N=8
 *  - 63, N=9
 *  - 127, N=10
 *  - 255, N=11
 *  For FS ISOC, if nTD is,
 *  - 1, N=4
 *  - 3, N=5
 *  - 7, N=6
 *  - 15, N=7
 *  - 31, N=8
 *  - 63, N=9
 *  [N-1:3]: Current Transfer Desc(CTD)
 *
 *  CTD for isochronous is based on the current frame/(micro)frame value. Need to be
 *  set to zero by application.
 *
 *  Reset: (N+1:3)'h0
 *
 *  [2:0]: Reserved
 */
#define USB_OTGFS_HCDMA1_DMAADDR    0xFFFFFFFFU
#define USB_OTGFS_HCDMA1_DMAADDR_M  (USB_OTGFS_HCDMA1_DMAADDR_V << USB_OTGFS_HCDMA1_DMAADDR_S)
#define USB_OTGFS_HCDMA1_DMAADDR_V  0xFFFFFFFFU
#define USB_OTGFS_HCDMA1_DMAADDR_S  0

/** USB_OTGFS_HCDMAB1_REG register
 *  Host Channel $i DMA Buffer Address Register  This register is present only in case
 *  of Scatter/Gather DMA. It is implemented in RAM instead of flop-based
 *  implementation. This register holds the current buffer address.
 */
#define USB_OTGFS_HCDMAB1_REG(i) (DR_REG_USB_BASE(i) + 0x53c)
/** USB_OTGFS_HCDMAB1_HCDMAB : RO; bitpos: [31:0]; default: 0;
 *  Holds the current buffer address.
 *  This register is updated as and when the data transfer for the corresponding end
 *  point
 *  is in progress. This register is present only in Scatter/Gather DMA mode. Otherwise
 *  this
 *  field is reserved.
 */
#define USB_OTGFS_HCDMAB1_HCDMAB    0xFFFFFFFFU
#define USB_OTGFS_HCDMAB1_HCDMAB_M  (USB_OTGFS_HCDMAB1_HCDMAB_V << USB_OTGFS_HCDMAB1_HCDMAB_S)
#define USB_OTGFS_HCDMAB1_HCDMAB_V  0xFFFFFFFFU
#define USB_OTGFS_HCDMAB1_HCDMAB_S  0

/** USB_OTGFS_HCCHAR2_REG register
 *  Host Channel 2 Characteristics Register
 */
#define USB_OTGFS_HCCHAR2_REG(i) (DR_REG_USB_BASE(i) + 0x540)
/** USB_OTGFS_HCCHAR2_MPS : R/W; bitpos: [10:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  Indicates the maximum packet size of the associated endpoint.
 */
#define USB_OTGFS_HCCHAR2_MPS    0x000007FFU
#define USB_OTGFS_HCCHAR2_MPS_M  (USB_OTGFS_HCCHAR2_MPS_V << USB_OTGFS_HCCHAR2_MPS_S)
#define USB_OTGFS_HCCHAR2_MPS_V  0x000007FFU
#define USB_OTGFS_HCCHAR2_MPS_S  0
/** USB_OTGFS_HCCHAR2_EPNUM : R/W; bitpos: [14:11]; default: 0;
 *  Endpoint Number (EPNum)
 *
 *  Indicates the endpoint number on the device serving as the data source or sink.
 */
#define USB_OTGFS_HCCHAR2_EPNUM    0x0000000FU
#define USB_OTGFS_HCCHAR2_EPNUM_M  (USB_OTGFS_HCCHAR2_EPNUM_V << USB_OTGFS_HCCHAR2_EPNUM_S)
#define USB_OTGFS_HCCHAR2_EPNUM_V  0x0000000FU
#define USB_OTGFS_HCCHAR2_EPNUM_S  11
/** USB_OTGFS_HCCHAR2_EPDIR : R/W; bitpos: [15]; default: 0;
 *  Endpoint Direction (EPDir)
 *
 *  Indicates whether the transaction is IN or OUT.
 *  - 1'b0: OUT
 *  - 1'b1: IN
 */
#define USB_OTGFS_HCCHAR2_EPDIR    (BIT(15))
#define USB_OTGFS_HCCHAR2_EPDIR_M  (USB_OTGFS_HCCHAR2_EPDIR_V << USB_OTGFS_HCCHAR2_EPDIR_S)
#define USB_OTGFS_HCCHAR2_EPDIR_V  0x00000001U
#define USB_OTGFS_HCCHAR2_EPDIR_S  15
/** USB_OTGFS_HCCHAR2_LSPDDEV : R/W; bitpos: [17]; default: 0;
 *  Low-Speed Device (LSpdDev)
 *
 *  This field is Set by the application to indicate that this channel is communicating
 *  to a low-speed device.
 *
 *  The application must program this bit when a low speed device is connected to the
 *  host through an FS HUB. The DWC_otg Host core uses this field to drive the
 *  XCVR_SELECT signal to 2'b11 while communicating to the LS Device through the FS hub.
 *
 *  Note: In a peer to peer setup, the DWC_otg Host core ignores this bit even if it is
 *  set by the application software.
 */
#define USB_OTGFS_HCCHAR2_LSPDDEV    (BIT(17))
#define USB_OTGFS_HCCHAR2_LSPDDEV_M  (USB_OTGFS_HCCHAR2_LSPDDEV_V << USB_OTGFS_HCCHAR2_LSPDDEV_S)
#define USB_OTGFS_HCCHAR2_LSPDDEV_V  0x00000001U
#define USB_OTGFS_HCCHAR2_LSPDDEV_S  17
/** USB_OTGFS_HCCHAR2_EPTYPE : R/W; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *
 *  Indicates the transfer type selected.
 *  - 2'b00: Control
 *  - 2'b01: Isochronous
 *  - 2'b10: Bulk
 *  - 2'b11: Interrupt
 */
#define USB_OTGFS_HCCHAR2_EPTYPE    0x00000003U
#define USB_OTGFS_HCCHAR2_EPTYPE_M  (USB_OTGFS_HCCHAR2_EPTYPE_V << USB_OTGFS_HCCHAR2_EPTYPE_S)
#define USB_OTGFS_HCCHAR2_EPTYPE_V  0x00000003U
#define USB_OTGFS_HCCHAR2_EPTYPE_S  18
/** USB_OTGFS_HCCHAR2_EC : R/W; bitpos: [21:20]; default: 0;
 *  Multi Count (MC) / Error Count (EC)
 *
 *  When the Split Enable bit of the Host Channel-n Split Control
 *  register (HCSPLTn.SpltEna) is reset (1'b0), this field indicates to
 *  the host the number of transactions that must be executed per
 *  microframe for this periodic endpoint. For non periodic transfers,
 *  this field is used only in DMA mode, and specifies the number
 *  packets to be fetched for this channel before the internal DMA
 *  engine changes arbitration.
 *  - 2'b00: Reserved This field yields undefined results.
 *  - 2'b01: 1 transaction
 *  - 2'b10: 2 transactions to be issued for this endpoint per microframe
 *  - 2'b11: 3 transactions to be issued for this endpoint per microframe
 *  When HCSPLTn.SpltEna is Set (1'b1), this field indicates the
 *  number of immediate retries to be performed for a periodic split
 *  transactions on transaction errors. This field must be Set to at
 *  least 2'b01.
 */
#define USB_OTGFS_HCCHAR2_EC    0x00000003U
#define USB_OTGFS_HCCHAR2_EC_M  (USB_OTGFS_HCCHAR2_EC_V << USB_OTGFS_HCCHAR2_EC_S)
#define USB_OTGFS_HCCHAR2_EC_V  0x00000003U
#define USB_OTGFS_HCCHAR2_EC_S  20
/** USB_OTGFS_HCCHAR2_DEVADDR : R/W; bitpos: [28:22]; default: 0;
 *  Device Address (DevAddr)
 *
 *  This field selects the specific device serving as the data source
 *  or sink.
 */
#define USB_OTGFS_HCCHAR2_DEVADDR    0x0000007FU
#define USB_OTGFS_HCCHAR2_DEVADDR_M  (USB_OTGFS_HCCHAR2_DEVADDR_V << USB_OTGFS_HCCHAR2_DEVADDR_S)
#define USB_OTGFS_HCCHAR2_DEVADDR_V  0x0000007FU
#define USB_OTGFS_HCCHAR2_DEVADDR_S  22
/** USB_OTGFS_HCCHAR2_ODDFRM : R/W; bitpos: [29]; default: 0;
 *  Odd Frame (OddFrm)
 *
 *  This field is set (reset) by the application to indicate that the OTG host must
 *  perform
 *  a transfer in an odd (micro)Frame. This field is applicable for only periodic
 *  (isochronous and interrupt) transactions.
 *  - 1'b0: Even (micro)Frame
 *  - 1'b1: Odd (micro)Frame
 */
#define USB_OTGFS_HCCHAR2_ODDFRM    (BIT(29))
#define USB_OTGFS_HCCHAR2_ODDFRM_M  (USB_OTGFS_HCCHAR2_ODDFRM_V << USB_OTGFS_HCCHAR2_ODDFRM_S)
#define USB_OTGFS_HCCHAR2_ODDFRM_V  0x00000001U
#define USB_OTGFS_HCCHAR2_ODDFRM_S  29
/** USB_OTGFS_HCCHAR2_CHDIS : R/W; bitpos: [30]; default: 0;
 *  Channel Disable (ChDis)
 *
 *  The application sets this bit to stop transmitting/receiving data
 *  on a channel, even before the transfer for that channel is
 *  complete. The application must wait for the Channel Disabled
 *  interrupt before treating the channel as disabled.
 */
#define USB_OTGFS_HCCHAR2_CHDIS    (BIT(30))
#define USB_OTGFS_HCCHAR2_CHDIS_M  (USB_OTGFS_HCCHAR2_CHDIS_V << USB_OTGFS_HCCHAR2_CHDIS_S)
#define USB_OTGFS_HCCHAR2_CHDIS_V  0x00000001U
#define USB_OTGFS_HCCHAR2_CHDIS_S  30
/** USB_OTGFS_HCCHAR2_CHENA : R/W; bitpos: [31]; default: 0;
 *  Channel Enable (ChEna)
 *
 *  When Scatter/Gather mode is enabled
 *  - 1'b0: Indicates that the descriptor structure is not yet ready.
 *  - 1'b1:  Indicates  that  the  descriptor  structure  and  data  buffer  with data
 *  is setup and this channel can access the descriptor.
 *  When Scatter/Gather mode is disabled
 *
 *  This field is set by the application and cleared by the OTG host.
 *  - 1'b0: Channel disabled
 *  - 1'b1: Channel enabled
 */
#define USB_OTGFS_HCCHAR2_CHENA    (BIT(31))
#define USB_OTGFS_HCCHAR2_CHENA_M  (USB_OTGFS_HCCHAR2_CHENA_V << USB_OTGFS_HCCHAR2_CHENA_S)
#define USB_OTGFS_HCCHAR2_CHENA_V  0x00000001U
#define USB_OTGFS_HCCHAR2_CHENA_S  31

