espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_HCINT2_REG register
 *  Host Channel $i Interrupt Register  This register indicates the status of a channel
 *  with respect to USB- and AHB-related events. It is shown in the Interrupt Hierarchy
 *  figure in the databook. The application must read this register when the Host
 *  Channels Interrupt bit of the Core Interrupt register (GINTSTS.HChInt) is set.
 *  Before the application can read this register, it must first read the Host All
 *  Channels Interrupt (HAINT) register to get the exact channel number for the Host
 *  Channel-n Interrupt register. The application must clear the appropriate bit in
 *  this register to clear the corresponding bits in the HAINT and GINTSTS registers.
 */
#define USB_OTGFS_HCINT2_REG(i) (DR_REG_USB_BASE(i) + 0x548)
/** USB_OTGFS_HCINT2_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed (XferCompl)
 *
 *  Transfer completed normally without any errors.This bit can be set only by the core
 *  and the application should write 1 to clear it.
 *  - For Scatter/Gather DMA mode, it indicates that current descriptor processing got
 *  completed with IOC bit set in its descriptor.
 *  - In non Scatter/Gather DMA mode, it indicates that Transfer completed normally
 *  without any errors.
 */
#define USB_OTGFS_HCINT2_XFERCOMPL    (BIT(0))
#define USB_OTGFS_HCINT2_XFERCOMPL_M  (USB_OTGFS_HCINT2_XFERCOMPL_V << USB_OTGFS_HCINT2_XFERCOMPL_S)
#define USB_OTGFS_HCINT2_XFERCOMPL_V  0x00000001U
#define USB_OTGFS_HCINT2_XFERCOMPL_S  0
/** USB_OTGFS_HCINT2_CHHLTD : R/W; bitpos: [1]; default: 0;
 *  Channel Halted (ChHltd)
 *
 *  In non Scatter/Gather DMA mode, it indicates the transfer completed abnormally
 *  either because of any USB transaction error or in response to disable request by
 *  the application or because of a completed transfer.
 *
 *  In Scatter/gather DMA mode, this indicates that transfer completed due to any of
 *  the following
 *  - EOL being set in descriptor
 *  - AHB error
 *  - Excessive transaction errors
 *  - Babble
 *  - Stall
 */
#define USB_OTGFS_HCINT2_CHHLTD    (BIT(1))
#define USB_OTGFS_HCINT2_CHHLTD_M  (USB_OTGFS_HCINT2_CHHLTD_V << USB_OTGFS_HCINT2_CHHLTD_S)
#define USB_OTGFS_HCINT2_CHHLTD_V  0x00000001U
#define USB_OTGFS_HCINT2_CHHLTD_S  1
/** USB_OTGFS_HCINT2_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  This is generated only in Internal DMA mode when there is an AHB error during AHB
 *  read/write. The application can read the corresponding channel's DMA address
 *  register to get the error address.
 */
#define USB_OTGFS_HCINT2_AHBERR    (BIT(2))
#define USB_OTGFS_HCINT2_AHBERR_M  (USB_OTGFS_HCINT2_AHBERR_V << USB_OTGFS_HCINT2_AHBERR_S)
#define USB_OTGFS_HCINT2_AHBERR_V  0x00000001U
#define USB_OTGFS_HCINT2_AHBERR_S  2
/** USB_OTGFS_HCINT2_STALL : R/W; bitpos: [3]; default: 0;
 *  STALL Response Received Interrupt (STALL)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HCINT2_STALL    (BIT(3))
#define USB_OTGFS_HCINT2_STALL_M  (USB_OTGFS_HCINT2_STALL_V << USB_OTGFS_HCINT2_STALL_S)
#define USB_OTGFS_HCINT2_STALL_V  0x00000001U
#define USB_OTGFS_HCINT2_STALL_S  3
/** USB_OTGFS_HCINT2_NAK : R/W; bitpos: [4]; default: 0;
 *  NAK Response Received Interrupt (NAK)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HCINT2_NAK    (BIT(4))
#define USB_OTGFS_HCINT2_NAK_M  (USB_OTGFS_HCINT2_NAK_V << USB_OTGFS_HCINT2_NAK_S)
#define USB_OTGFS_HCINT2_NAK_V  0x00000001U
#define USB_OTGFS_HCINT2_NAK_S  4
/** USB_OTGFS_HCINT2_ACK : R/W; bitpos: [5]; default: 0;
 *  ACK Response Received/Transmitted Interrupt (ACK)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HCINT2_ACK    (BIT(5))
#define USB_OTGFS_HCINT2_ACK_M  (USB_OTGFS_HCINT2_ACK_V << USB_OTGFS_HCINT2_ACK_S)
#define USB_OTGFS_HCINT2_ACK_V  0x00000001U
#define USB_OTGFS_HCINT2_ACK_S  5
/** USB_OTGFS_HCINT2_NYET : R/W; bitpos: [6]; default: 0;
 *  NYET Response Received Interrupt (NYET)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HCINT2_NYET    (BIT(6))
#define USB_OTGFS_HCINT2_NYET_M  (USB_OTGFS_HCINT2_NYET_V << USB_OTGFS_HCINT2_NYET_S)
#define USB_OTGFS_HCINT2_NYET_V  0x00000001U
#define USB_OTGFS_HCINT2_NYET_S  6
/** USB_OTGFS_HCINT2_XACTERR : R/W; bitpos: [7]; default: 0;
 *  Transaction Error (XactErr)
 *
 *  Indicates one of the following errors occurred on the USB.
 *  - CRC check failure
 *  - Timeout
 *  - Bit stuff error
 *  - False EOP
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application should write 1 to
 *  clear it.
 */
#define USB_OTGFS_HCINT2_XACTERR    (BIT(7))
#define USB_OTGFS_HCINT2_XACTERR_M  (USB_OTGFS_HCINT2_XACTERR_V << USB_OTGFS_HCINT2_XACTERR_S)
#define USB_OTGFS_HCINT2_XACTERR_V  0x00000001U
#define USB_OTGFS_HCINT2_XACTERR_S  7
/** USB_OTGFS_HCINT2_BBLERR : R/W; bitpos: [8]; default: 0;
 *  Babble Error (BblErr)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the core.
 *  This bit can be set only by the core and the application should write 1 to clear it.
 */
#define USB_OTGFS_HCINT2_BBLERR    (BIT(8))
#define USB_OTGFS_HCINT2_BBLERR_M  (USB_OTGFS_HCINT2_BBLERR_V << USB_OTGFS_HCINT2_BBLERR_S)
#define USB_OTGFS_HCINT2_BBLERR_V  0x00000001U
#define USB_OTGFS_HCINT2_BBLERR_S  8
/** USB_OTGFS_HCINT2_FRMOVRUN : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun (FrmOvrun).
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked
 *  in the core. This bit can be set only by the core and the application should write
 *  1 to clear
 *  it.
 */
#define USB_OTGFS_HCINT2_FRMOVRUN    (BIT(9))
#define USB_OTGFS_HCINT2_FRMOVRUN_M  (USB_OTGFS_HCINT2_FRMOVRUN_V << USB_OTGFS_HCINT2_FRMOVRUN_S)
#define USB_OTGFS_HCINT2_FRMOVRUN_V  0x00000001U
#define USB_OTGFS_HCINT2_FRMOVRUN_S  9
/** USB_OTGFS_HCINT2_DATATGLERR : R/W; bitpos: [10]; default: 0;
 *
 *  Data Toggle Error (DataTglErr).This bit can be set only by the core and the
 *  application should write 1 to clear
 *  it.In Scatter/Gather DMA mode, the interrupt due to this bit is masked
 *  in the core.
 */
#define USB_OTGFS_HCINT2_DATATGLERR    (BIT(10))
#define USB_OTGFS_HCINT2_DATATGLERR_M  (USB_OTGFS_HCINT2_DATATGLERR_V << USB_OTGFS_HCINT2_DATATGLERR_S)
#define USB_OTGFS_HCINT2_DATATGLERR_V  0x00000001U
#define USB_OTGFS_HCINT2_DATATGLERR_S  10
/** USB_OTGFS_HCINT2_BNAINTR : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 *  The core generates this interrupt when the descriptor accessed
 *  is not ready for the Core to process. BNA will not be generated
 *  for Isochronous channels.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGFS_HCINT2_BNAINTR    (BIT(11))
#define USB_OTGFS_HCINT2_BNAINTR_M  (USB_OTGFS_HCINT2_BNAINTR_V << USB_OTGFS_HCINT2_BNAINTR_S)
#define USB_OTGFS_HCINT2_BNAINTR_V  0x00000001U
#define USB_OTGFS_HCINT2_BNAINTR_S  11
/** USB_OTGFS_HCINT2_XCS_XACT_ERR : R/W; bitpos: [12]; default: 0;
 *  Excessive Transaction Error (XCS_XACT_ERR)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this
 *  bit
 *  when 3 consecutive transaction errors occurred on the USB bus. XCS_XACT_ERR will
 *  not be generated for Isochronous channels.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGFS_HCINT2_XCS_XACT_ERR    (BIT(12))
#define USB_OTGFS_HCINT2_XCS_XACT_ERR_M  (USB_OTGFS_HCINT2_XCS_XACT_ERR_V << USB_OTGFS_HCINT2_XCS_XACT_ERR_S)
#define USB_OTGFS_HCINT2_XCS_XACT_ERR_V  0x00000001U
#define USB_OTGFS_HCINT2_XCS_XACT_ERR_S  12
/** USB_OTGFS_HCINT2_DESC_LST_ROLLINTR : R/W; bitpos: [13]; default: 0;
 *  Descriptor rollover interrupt (DESC_LST_ROLLIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this
 *  bit
 *  when the corresponding channel's descriptor list rolls over.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGFS_HCINT2_DESC_LST_ROLLINTR    (BIT(13))
#define USB_OTGFS_HCINT2_DESC_LST_ROLLINTR_M  (USB_OTGFS_HCINT2_DESC_LST_ROLLINTR_V << USB_OTGFS_HCINT2_DESC_LST_ROLLINTR_S)
#define USB_OTGFS_HCINT2_DESC_LST_ROLLINTR_V  0x00000001U
#define USB_OTGFS_HCINT2_DESC_LST_ROLLINTR_S  13

/** USB_OTGFS_HCINTMSK2_REG register
 *  Host Channel $i Interrupt Mask Register  This register reflects the mask for each
 *  channel status described in the previous section.
 */
#define USB_OTGFS_HCINTMSK2_REG(i) (DR_REG_USB_BASE(i) + 0x54c)
/** USB_OTGFS_HCINTMSK2_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *
 *  Transfer Completed Mask (XferComplMsk)
 */
#define USB_OTGFS_HCINTMSK2_XFERCOMPLMSK    (BIT(0))
#define USB_OTGFS_HCINTMSK2_XFERCOMPLMSK_M  (USB_OTGFS_HCINTMSK2_XFERCOMPLMSK_V << USB_OTGFS_HCINTMSK2_XFERCOMPLMSK_S)
#define USB_OTGFS_HCINTMSK2_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGFS_HCINTMSK2_XFERCOMPLMSK_S  0
/** USB_OTGFS_HCINTMSK2_CHHLTDMSK : R/W; bitpos: [1]; default: 0;
 *
 *  Channel Halted Mask (ChHltdMsk)
 */
#define USB_OTGFS_HCINTMSK2_CHHLTDMSK    (BIT(1))
#define USB_OTGFS_HCINTMSK2_CHHLTDMSK_M  (USB_OTGFS_HCINTMSK2_CHHLTDMSK_V << USB_OTGFS_HCINTMSK2_CHHLTDMSK_S)
#define USB_OTGFS_HCINTMSK2_CHHLTDMSK_V  0x00000001U
#define USB_OTGFS_HCINTMSK2_CHHLTDMSK_S  1
/** USB_OTGFS_HCINTMSK2_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *
 *  AHB Error Mask (AHBErrMsk)
 *  In  scatter/gather  DMA  mode  for  host,
 *  interrupts will not be generated due to the corresponding bits set in
 *  HCINTn.
 */
#define USB_OTGFS_HCINTMSK2_AHBERRMSK    (BIT(2))
#define USB_OTGFS_HCINTMSK2_AHBERRMSK_M  (USB_OTGFS_HCINTMSK2_AHBERRMSK_V << USB_OTGFS_HCINTMSK2_AHBERRMSK_S)
#define USB_OTGFS_HCINTMSK2_AHBERRMSK_V  0x00000001U
#define USB_OTGFS_HCINTMSK2_AHBERRMSK_S  2
/** USB_OTGFS_HCINTMSK2_BNAINTRMSK : R/W; bitpos: [11]; default: 0;
 *
 *  BNA  (Buffer  Not  Available)  Interrupt  mask  register  (BNAIntrMsk)
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 */
#define USB_OTGFS_HCINTMSK2_BNAINTRMSK    (BIT(11))
#define USB_OTGFS_HCINTMSK2_BNAINTRMSK_M  (USB_OTGFS_HCINTMSK2_BNAINTRMSK_V << USB_OTGFS_HCINTMSK2_BNAINTRMSK_S)
#define USB_OTGFS_HCINTMSK2_BNAINTRMSK_V  0x00000001U
#define USB_OTGFS_HCINTMSK2_BNAINTRMSK_S  11
/** USB_OTGFS_HCINTMSK2_DESC_LST_ROLLINTRMSK : R/W; bitpos: [13]; default: 0;
 *
 *  Descriptor List rollover interrupt Mask register(DESC_LST_ROLLIntrMsk)
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 */
#define USB_OTGFS_HCINTMSK2_DESC_LST_ROLLINTRMSK    (BIT(13))
#define USB_OTGFS_HCINTMSK2_DESC_LST_ROLLINTRMSK_M  (USB_OTGFS_HCINTMSK2_DESC_LST_ROLLINTRMSK_V << USB_OTGFS_HCINTMSK2_DESC_LST_ROLLINTRMSK_S)
#define USB_OTGFS_HCINTMSK2_DESC_LST_ROLLINTRMSK_V  0x00000001U
#define USB_OTGFS_HCINTMSK2_DESC_LST_ROLLINTRMSK_S  13

/** USB_OTGFS_HCTSIZ2_REG register
 *  Host Channel 2 Transfer Size Register
 */
#define USB_OTGFS_HCTSIZ2_REG(i) (DR_REG_USB_BASE(i) + 0x550)
/** USB_OTGFS_HCTSIZ2_XFERSIZE : R/W; bitpos: [15:0]; default: 0;
 *  Transfer Size (XferSize)
 *
 *  For an OUT, this field is the number of data bytes the host sends during the
 *  transfer.
 *
 *  For an IN, this field is the buffer size that the application has Reserved for the
 *  transfer. The application is expected to program this field as an integer multiple
 *  of the maximum packet size for IN transactions (periodic and non-periodic).
 *
 *  The width of this counter is specified as Width of Transfer Size Counters during
 *  coreConsultant configuration (parameter OTG_TRANS_COUNT_WIDTH).
 */
#define USB_OTGFS_HCTSIZ2_XFERSIZE    0x0000FFFFU
#define USB_OTGFS_HCTSIZ2_XFERSIZE_M  (USB_OTGFS_HCTSIZ2_XFERSIZE_V << USB_OTGFS_HCTSIZ2_XFERSIZE_S)
#define USB_OTGFS_HCTSIZ2_XFERSIZE_V  0x0000FFFFU
#define USB_OTGFS_HCTSIZ2_XFERSIZE_S  0
/** USB_OTGFS_HCTSIZ2_PKTCNT : R/W; bitpos: [25:19]; default: 0;
 *  Packet Count (PktCnt)
 *
 *  This field is programmed by the application with the expected number of packets to
 *  be transmitted (OUT) or received (IN).
 *
 *  The host decrements this count on every successful transmission or reception of an
 *  OUT/IN packet. Once this count reaches zero, the application is interrupted to
 *  indicate normal completion.
 *
 *  The width of this counter is specified as Width of Packet Counters during
 *  coreConsultant configuration (parameter OTG_PACKET_COUNT_WIDTH).
 */
#define USB_OTGFS_HCTSIZ2_PKTCNT    0x0000007FU
#define USB_OTGFS_HCTSIZ2_PKTCNT_M  (USB_OTGFS_HCTSIZ2_PKTCNT_V << USB_OTGFS_HCTSIZ2_PKTCNT_S)
#define USB_OTGFS_HCTSIZ2_PKTCNT_V  0x0000007FU
#define USB_OTGFS_HCTSIZ2_PKTCNT_S  19
/** USB_OTGFS_HCTSIZ2_PID : R/W; bitpos: [30:29]; default: 0;
 *  PID (Pid)
 *
 *  The application programs this field with the type of PID to use for the initial
 *  transaction. The host maintains this field for the rest of the transfer.
 *  - 2'b00: DATA0
 *  - 2'b01: DATA2
 *  - 2'b10: DATA1
 *  - 2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_OTGFS_HCTSIZ2_PID    0x00000003U
#define USB_OTGFS_HCTSIZ2_PID_M  (USB_OTGFS_HCTSIZ2_PID_V << USB_OTGFS_HCTSIZ2_PID_S)
#define USB_OTGFS_HCTSIZ2_PID_V  0x00000003U
#define USB_OTGFS_HCTSIZ2_PID_S  29
/** USB_OTGFS_HCTSIZ2_DOPNG : R/W; bitpos: [31]; default: 0;
 *  Do Ping (DoPng)
 *
 *  This bit is used only for OUT transfers.
 *  Setting this field to 1 directs the host to do PING protocol.
 *
 *  Note: Do not set this bit for IN transfers. If this bit is set for for IN transfers
 *  it disables the channel.
 */
#define USB_OTGFS_HCTSIZ2_DOPNG    (BIT(31))
#define USB_OTGFS_HCTSIZ2_DOPNG_M  (USB_OTGFS_HCTSIZ2_DOPNG_V << USB_OTGFS_HCTSIZ2_DOPNG_S)
#define USB_OTGFS_HCTSIZ2_DOPNG_V  0x00000001U
#define USB_OTGFS_HCTSIZ2_DOPNG_S  31

