espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_HCDMAB7_REG register
 *  Host Channel $i DMA Buffer Address Register  This register is present only in case
 *  of Scatter/Gather DMA. It is implemented in RAM instead of flop-based
 *  implementation. This register holds the current buffer address.
 */
#define USB_OTGFS_HCDMAB7_REG(i) (DR_REG_USB_BASE(i) + 0x5fc)
/** USB_OTGFS_HCDMAB7_HCDMAB : RO; bitpos: [31:0]; default: 0;
 *  Holds the current buffer address.
 *  This register is updated as and when the data transfer for the corresponding end
 *  point
 *  is in progress. This register is present only in Scatter/Gather DMA mode. Otherwise
 *  this
 *  field is reserved.
 */
#define USB_OTGFS_HCDMAB7_HCDMAB    0xFFFFFFFFU
#define USB_OTGFS_HCDMAB7_HCDMAB_M  (USB_OTGFS_HCDMAB7_HCDMAB_V << USB_OTGFS_HCDMAB7_HCDMAB_S)
#define USB_OTGFS_HCDMAB7_HCDMAB_V  0xFFFFFFFFU
#define USB_OTGFS_HCDMAB7_HCDMAB_S  0

/** USB_OTGFS_DCFG_REG register
 *  Device Configuration Register  This register configures the core in Device mode
 *  after power-on or after certain control commands or enumeration. Do not make
 *  changes to this register after initial programming.
 */
#define USB_OTGFS_DCFG_REG(i) (DR_REG_USB_BASE(i) + 0x800)
/** USB_OTGFS_DCFG_DEVSPD : R/W; bitpos: [1:0]; default: 0;
 *  Device Speed (DevSpd)
 *
 *  Indicates the speed at which the application requires the core to
 *  enumerate, or the maximum speed the application can support.
 *  However, the actual bus speed is determined only after the connect
 *  sequence is completed, and is based on the speed of the USB
 *  host to which the core is connected.
 */
#define USB_OTGFS_DCFG_DEVSPD    0x00000003U
#define USB_OTGFS_DCFG_DEVSPD_M  (USB_OTGFS_DCFG_DEVSPD_V << USB_OTGFS_DCFG_DEVSPD_S)
#define USB_OTGFS_DCFG_DEVSPD_V  0x00000003U
#define USB_OTGFS_DCFG_DEVSPD_S  0
/** USB_OTGFS_DCFG_NZSTSOUTHSHK : R/W; bitpos: [2]; default: 0;
 *  Non-Zero-Length Status OUT Handshake (NZStsOUTHShk)
 *
 *  The application can use this field to select the handshake the core sends on
 *  receiving a nonzero-length data packet during the OUT transaction of a control
 *  transfer's Status stage.
 *  - 1'b1: Send a STALL handshake on a nonzero-length status OUT transaction and do
 *  not send the received OUT packet to the application.
 *  - 1'b0: Send the received OUT packet to the application (zerolength or
 *  nonzero-length) and send a handshake based on the NAK and STALL bits for the
 *  endpoint in the Device Endpoint Control register.
 */
#define USB_OTGFS_DCFG_NZSTSOUTHSHK    (BIT(2))
#define USB_OTGFS_DCFG_NZSTSOUTHSHK_M  (USB_OTGFS_DCFG_NZSTSOUTHSHK_V << USB_OTGFS_DCFG_NZSTSOUTHSHK_S)
#define USB_OTGFS_DCFG_NZSTSOUTHSHK_V  0x00000001U
#define USB_OTGFS_DCFG_NZSTSOUTHSHK_S  2
/** USB_OTGFS_DCFG_ENA32KHZSUSP : R/W; bitpos: [3]; default: 0;
 *  Enable 32 KHz Suspend mode (Ena32KHzSusp)
 *
 *  This bit can be set only if FS PHY interface is selected. Otherwise, this bit needs
 *  to be set to zero. If FS PHY interface is chosen and this bit is set, the PHY clock
 *  during Suspend must be switched from 48 MHz to 32 KHz.
 */
#define USB_OTGFS_DCFG_ENA32KHZSUSP    (BIT(3))
#define USB_OTGFS_DCFG_ENA32KHZSUSP_M  (USB_OTGFS_DCFG_ENA32KHZSUSP_V << USB_OTGFS_DCFG_ENA32KHZSUSP_S)
#define USB_OTGFS_DCFG_ENA32KHZSUSP_V  0x00000001U
#define USB_OTGFS_DCFG_ENA32KHZSUSP_S  3
/** USB_OTGFS_DCFG_DEVADDR : R/W; bitpos: [10:4]; default: 0;
 *  Device Address (DevAddr)
 *
 *  The application must program this field after every SetAddress control command.
 */
#define USB_OTGFS_DCFG_DEVADDR    0x0000007FU
#define USB_OTGFS_DCFG_DEVADDR_M  (USB_OTGFS_DCFG_DEVADDR_V << USB_OTGFS_DCFG_DEVADDR_S)
#define USB_OTGFS_DCFG_DEVADDR_V  0x0000007FU
#define USB_OTGFS_DCFG_DEVADDR_S  4
/** USB_OTGFS_DCFG_PERFRINT : R/W; bitpos: [12:11]; default: 0;
 *  Periodic Frame Interval (PerFrInt)
 *
 *  Indicates the time within a (micro)Frame at which the application
 *  must be notified using the End Of Periodic Frame Interrupt. This
 *  can be used to determine If all the isochronous traffic for that
 *  (micro)Frame is complete.
 *  - 2'b00: 80% of the (micro)Frame interval
 *  - 2'b01: 85% of the (micro)Frame interval
 *  - 2'b10: 90% of the (micro)Frame interval
 *  - 2'b11: 95% of the (micro)Frame interval
 */
#define USB_OTGFS_DCFG_PERFRINT    0x00000003U
#define USB_OTGFS_DCFG_PERFRINT_M  (USB_OTGFS_DCFG_PERFRINT_V << USB_OTGFS_DCFG_PERFRINT_S)
#define USB_OTGFS_DCFG_PERFRINT_V  0x00000003U
#define USB_OTGFS_DCFG_PERFRINT_S  11
/** USB_OTGFS_DCFG_ENDEVOUTNAK : R/W; bitpos: [13]; default: 0;
 *  Enable Device OUT NAK (EnDevOutNak)
 *
 *  This bit enables setting NAK for Bulk OUT endpoints after the transfer is completed
 *  for Device mode Descriptor DMA
 *  - 1'b0 : The core does not set NAK after Bulk OUT transfer complete
 *  - 1'b1  :  The core sets NAK after Bulk OUT transfer complete
 *  It bit is one time programmable after reset like any other DCFG register bits.
 */
#define USB_OTGFS_DCFG_ENDEVOUTNAK    (BIT(13))
#define USB_OTGFS_DCFG_ENDEVOUTNAK_M  (USB_OTGFS_DCFG_ENDEVOUTNAK_V << USB_OTGFS_DCFG_ENDEVOUTNAK_S)
#define USB_OTGFS_DCFG_ENDEVOUTNAK_V  0x00000001U
#define USB_OTGFS_DCFG_ENDEVOUTNAK_S  13
/** USB_OTGFS_DCFG_XCVRDLY : R/W; bitpos: [14]; default: 0;
 *  XCVRDLY
 *
 *  Enables or disables delay between xcvr_sel and txvalid during device chirp
 */
#define USB_OTGFS_DCFG_XCVRDLY    (BIT(14))
#define USB_OTGFS_DCFG_XCVRDLY_M  (USB_OTGFS_DCFG_XCVRDLY_V << USB_OTGFS_DCFG_XCVRDLY_S)
#define USB_OTGFS_DCFG_XCVRDLY_V  0x00000001U
#define USB_OTGFS_DCFG_XCVRDLY_S  14
/** USB_OTGFS_DCFG_ERRATICINTMSK : R/W; bitpos: [15]; default: 0;
 *  Erratic Error Interrupt Mask
 */
#define USB_OTGFS_DCFG_ERRATICINTMSK    (BIT(15))
#define USB_OTGFS_DCFG_ERRATICINTMSK_M  (USB_OTGFS_DCFG_ERRATICINTMSK_V << USB_OTGFS_DCFG_ERRATICINTMSK_S)
#define USB_OTGFS_DCFG_ERRATICINTMSK_V  0x00000001U
#define USB_OTGFS_DCFG_ERRATICINTMSK_S  15
/** USB_OTGFS_DCFG_DESCDMA : R/W; bitpos: [23]; default: 0;
 *  Enable Scatter/gather DMA in device mode (DescDMA).
 *
 *  When the Scatter/Gather DMA option selected during configuration of the RTL, the
 *  application can Set this bit during initialization to enable the Scatter/Gather DMA
 *  operation.
 *
 *  Note: This bit must be modified only once after a reset. The following combinations
 *  are available for programming:
 *  - GAHBCFG.DMAEn=0,DCFG.DescDMA=0 => Slave mode
 *  - GAHBCFG.DMAEn=0,DCFG.DescDMA=1 => Invalid
 *  - GAHBCFG.DMAEn=1,DCFG.DescDMA=0 => Buffered DMA mode
 *  - GAHBCFG.DMAEn=1,DCFG.DescDMA=1 => Scatter/Gather DMA mode
 */
#define USB_OTGFS_DCFG_DESCDMA    (BIT(23))
#define USB_OTGFS_DCFG_DESCDMA_M  (USB_OTGFS_DCFG_DESCDMA_V << USB_OTGFS_DCFG_DESCDMA_S)
#define USB_OTGFS_DCFG_DESCDMA_V  0x00000001U
#define USB_OTGFS_DCFG_DESCDMA_S  23
/** USB_OTGFS_DCFG_PERSCHINTVL : R/W; bitpos: [25:24]; default: 0;
 *  Periodic Scheduling Interval (PerSchIntvl)
 *
 *  PerSchIntvl must be programmed for Scatter/Gather DMA mode.
 *
 *  This field specifies the amount of time the Internal
 *  DMA engine must allocate for fetching periodic IN endpoint data.
 *  Based on the number of periodic endpoints, this value must be
 *  specified as 25,50 or 75% of (micro)Frame.
 *  - When any periodic endpoints are active, the internal DMA engine allocates the
 *  specified amount of time in fetching periodic IN endpoint data .
 *  - When no periodic endpoints are active, Then the internal DMA engine services
 *  non-periodic endpoints, ignoring this field.
 *  - After the specified time within a (micro)Frame, the DMA switches to fetching for
 *  non-periodic endpoints.
 *  -- 2'b00: 25% of (micro)Frame.
 *  -- 2'b01: 50% of (micro)Frame.
 *  -- 2'b10: 75% of (micro)Frame.
 *  -- 2'b11: Reserved.
 *  Reset: 2'b00
 */
#define USB_OTGFS_DCFG_PERSCHINTVL    0x00000003U
#define USB_OTGFS_DCFG_PERSCHINTVL_M  (USB_OTGFS_DCFG_PERSCHINTVL_V << USB_OTGFS_DCFG_PERSCHINTVL_S)
#define USB_OTGFS_DCFG_PERSCHINTVL_V  0x00000003U
#define USB_OTGFS_DCFG_PERSCHINTVL_S  24
/** USB_OTGFS_DCFG_RESVALID : R/W; bitpos: [31:26]; default: 2;
 *  Resume Validation Period (ResValid)
 *
 *  This field is effective only when DCFG.Ena32KHzSusp is set.
 *  It controls the resume period when the core resumes from
 *  suspend. The core counts for ResValid number of clock cycles
 *  to detect a valid resume when this bit is set
 */
#define USB_OTGFS_DCFG_RESVALID    0x0000003FU
#define USB_OTGFS_DCFG_RESVALID_M  (USB_OTGFS_DCFG_RESVALID_V << USB_OTGFS_DCFG_RESVALID_S)
#define USB_OTGFS_DCFG_RESVALID_V  0x0000003FU
#define USB_OTGFS_DCFG_RESVALID_S  26

