espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_DCTL_REG register
 *  Device Control Register
 */
#define USB_OTGFS_DCTL_REG(i) (DR_REG_USB_BASE(i) + 0x804)
/** USB_OTGFS_DCTL_RMTWKUPSIG : R/W; bitpos: [0]; default: 0;
 *  Remote Wakeup Signaling (RmtWkUpSig)
 *
 *  When the application sets this bit, the core initiates remote
 *  signaling to wake up the USB host. The application must Set this
 *  bit to instruct the core to exit the Suspend state. As specified in
 *  the USB 2.0 specification, the application must clear this bit
 *  1-15 ms after setting it.
 *
 *
 *  If LPM is enabled and the core is in the L1 (Sleep) state, when the application
 *  sets this bit, the core initiates L1 remote signaling to wake up the USB host. The
 *  application must set this bit to instruct the core to exit the Sleep state. As
 *  specified in the LPM specification, the hardware automatically clears this bit 50
 *  microseconds (TL1DevDrvResume) after being set by the application. The application
 *  must not set this bit when GLPMCFG bRemoteWake from the previous LPM transaction is
 *  zero.
 */
#define USB_OTGFS_DCTL_RMTWKUPSIG    (BIT(0))
#define USB_OTGFS_DCTL_RMTWKUPSIG_M  (USB_OTGFS_DCTL_RMTWKUPSIG_V << USB_OTGFS_DCTL_RMTWKUPSIG_S)
#define USB_OTGFS_DCTL_RMTWKUPSIG_V  0x00000001U
#define USB_OTGFS_DCTL_RMTWKUPSIG_S  0
/** USB_OTGFS_DCTL_SFTDISCON : R/W; bitpos: [1]; default: 1;
 *  Soft Disconnect (SftDiscon)
 *
 *  The application uses this bit to signal the controller to do a soft disconnect. As
 *  long as this bit is Set, the host does not see that the device is connected, and
 *  the device does not receive
 *  signals on the USB. The core stays in the disconnected state until the application
 *  clears this bit.
 *  - 1'b0: Normal operation. When this bit is cleared after a soft disconnect, the
 *  core drives the phy_opmode_o signal on the
 *  UTMI+ to 2'b00, which generates a device connect event to the USB host. When the
 *  device is reconnected, the USB host restarts device enumeration.
 *  - 1'b1: The core drives the phy_opmode_o signal on the UTMI+ to 2'b01, which
 *  generates a device disconnect event to the USB host.
 *  The following is the minimum duration under various conditions for which this bit
 *  must be set for the USB host to detect a device disconnect. To accommodate clock
 *  jitter, it is
 *  recommended that the application adds some extra delay to the specified minimum
 *  duration.
 *
 *  For high speed, if the device state is,
 *  - Suspended, the minimum duration is 1ms + 2.5us
 *  - Idle, the minimum duration is 3ms + 2.5us
 *  - Not Idle or Suspended (performing transactions), the minimum duration 125 us
 *  For full speed/low speed, if the device state is,
 *  - Suspended, the minimum duration is 1ms + 2.5us
 *  - Idle, the minimum duration is 2.5us
 *  - Not Idle or Suspended (performing transactions), the minimum duration 125 us
 *  Note:
 *  - This bit can be also used for ULPI/FS Serial interfaces.
 *  - This bit is not impacted by a soft reset.
 */
#define USB_OTGFS_DCTL_SFTDISCON    (BIT(1))
#define USB_OTGFS_DCTL_SFTDISCON_M  (USB_OTGFS_DCTL_SFTDISCON_V << USB_OTGFS_DCTL_SFTDISCON_S)
#define USB_OTGFS_DCTL_SFTDISCON_V  0x00000001U
#define USB_OTGFS_DCTL_SFTDISCON_S  1
/** USB_OTGFS_DCTL_GNPINNAKSTS : RO; bitpos: [2]; default: 0;
 *  Global Non-periodic IN NAK Status (GNPINNakSts)
 *  - 1'b0: A handshake is sent out based on the data availability in the transmit FIFO.
 *  - 1'b1: A NAK handshake is sent out on all non-periodic IN endpoints, irrespective
 *  of the data availability in the transmit FIFO.
 */
#define USB_OTGFS_DCTL_GNPINNAKSTS    (BIT(2))
#define USB_OTGFS_DCTL_GNPINNAKSTS_M  (USB_OTGFS_DCTL_GNPINNAKSTS_V << USB_OTGFS_DCTL_GNPINNAKSTS_S)
#define USB_OTGFS_DCTL_GNPINNAKSTS_V  0x00000001U
#define USB_OTGFS_DCTL_GNPINNAKSTS_S  2
/** USB_OTGFS_DCTL_GOUTNAKSTS : RO; bitpos: [3]; default: 0;
 *  Global OUT NAK Status (GOUTNakSts)
 *  - 1'b0: A handshake is sent based on the FIFO Status and the NAK and STALL bit
 *  settings.
 *  - 1'b1: No data is written to the RxFIFO, irrespective of space availability. Sends
 *  a NAK handshake on all packets, except on SETUP transactions. All isochronous OUT
 *  packets are dropped.
 */
#define USB_OTGFS_DCTL_GOUTNAKSTS    (BIT(3))
#define USB_OTGFS_DCTL_GOUTNAKSTS_M  (USB_OTGFS_DCTL_GOUTNAKSTS_V << USB_OTGFS_DCTL_GOUTNAKSTS_S)
#define USB_OTGFS_DCTL_GOUTNAKSTS_V  0x00000001U
#define USB_OTGFS_DCTL_GOUTNAKSTS_S  3
/** USB_OTGFS_DCTL_TSTCTL : R/W; bitpos: [6:4]; default: 0;
 *  Test Control (TstCtl)
 *  - 3'b000: Test mode disabled
 *  - 3'b001: Test_J mode
 *  - 3'b010: Test_K mode
 *  - 3'b011: Test_SE0_NAK mode
 *  - 3'b100: Test_Packet mode
 *  - 3'b101: Test_Force_Enable
 *  - Others: Reserved
 */
#define USB_OTGFS_DCTL_TSTCTL    0x00000007U
#define USB_OTGFS_DCTL_TSTCTL_M  (USB_OTGFS_DCTL_TSTCTL_V << USB_OTGFS_DCTL_TSTCTL_S)
#define USB_OTGFS_DCTL_TSTCTL_V  0x00000007U
#define USB_OTGFS_DCTL_TSTCTL_S  4
/** USB_OTGFS_DCTL_SGNPINNAK : R/W; bitpos: [7]; default: 0;
 *  Set Global Non-periodic IN NAK (SGNPInNak)
 *
 *  A write to this field sets the Global Non-periodic IN NAK.The application uses this
 *  bit to send a NAK handshake on all non-periodic IN endpoints.
 *  The core can also Set this bit when a timeout condition is detected on a
 *  non-periodic endpoint in shared FIFO operation.
 *  The application must Set this bit only after making sure that the Global IN NAK
 *  Effective bit in the Core Interrupt Register (GINTSTS.GINNakEff) is cleared
 */
#define USB_OTGFS_DCTL_SGNPINNAK    (BIT(7))
#define USB_OTGFS_DCTL_SGNPINNAK_M  (USB_OTGFS_DCTL_SGNPINNAK_V << USB_OTGFS_DCTL_SGNPINNAK_S)
#define USB_OTGFS_DCTL_SGNPINNAK_V  0x00000001U
#define USB_OTGFS_DCTL_SGNPINNAK_S  7
/** USB_OTGFS_DCTL_CGNPINNAK : R/W; bitpos: [8]; default: 0;
 *  Clear Global Non-periodic IN NAK (CGNPInNak)
 *
 *  A write to this field clears the Global Non-periodic IN NAK.
 */
#define USB_OTGFS_DCTL_CGNPINNAK    (BIT(8))
#define USB_OTGFS_DCTL_CGNPINNAK_M  (USB_OTGFS_DCTL_CGNPINNAK_V << USB_OTGFS_DCTL_CGNPINNAK_S)
#define USB_OTGFS_DCTL_CGNPINNAK_V  0x00000001U
#define USB_OTGFS_DCTL_CGNPINNAK_S  8
/** USB_OTGFS_DCTL_SGOUTNAK : R/W; bitpos: [9]; default: 0;
 *  Set Global OUT NAK (SGOUTNak)
 *
 *  A write to this field sets the Global OUT NAK. The application uses this bit to
 *  send a NAK handshake on all OUT endpoints.
 *  The application must set the this bit only after making sure that the Global OUT
 *  NAK Effective bit in the Core Interrupt Register (GINTSTS.GOUTNakEff) is cleared.
 */
#define USB_OTGFS_DCTL_SGOUTNAK    (BIT(9))
#define USB_OTGFS_DCTL_SGOUTNAK_M  (USB_OTGFS_DCTL_SGOUTNAK_V << USB_OTGFS_DCTL_SGOUTNAK_S)
#define USB_OTGFS_DCTL_SGOUTNAK_V  0x00000001U
#define USB_OTGFS_DCTL_SGOUTNAK_S  9
/** USB_OTGFS_DCTL_CGOUTNAK : R/W; bitpos: [10]; default: 0;
 *  Clear Global OUT NAK (CGOUTNak)
 *
 *  A write to this field clears the Global OUT NAK.
 */
#define USB_OTGFS_DCTL_CGOUTNAK    (BIT(10))
#define USB_OTGFS_DCTL_CGOUTNAK_M  (USB_OTGFS_DCTL_CGOUTNAK_V << USB_OTGFS_DCTL_CGOUTNAK_S)
#define USB_OTGFS_DCTL_CGOUTNAK_V  0x00000001U
#define USB_OTGFS_DCTL_CGOUTNAK_S  10
/** USB_OTGFS_DCTL_PWRONPRGDONE : R/W; bitpos: [11]; default: 0;
 *  Power-On Programming Done (PWROnPrgDone)
 *
 *  The application uses this bit to indicate that register programming is completed
 *  after a wake-up from Power Down mode.
 */
#define USB_OTGFS_DCTL_PWRONPRGDONE    (BIT(11))
#define USB_OTGFS_DCTL_PWRONPRGDONE_M  (USB_OTGFS_DCTL_PWRONPRGDONE_V << USB_OTGFS_DCTL_PWRONPRGDONE_S)
#define USB_OTGFS_DCTL_PWRONPRGDONE_V  0x00000001U
#define USB_OTGFS_DCTL_PWRONPRGDONE_S  11
/** USB_OTGFS_DCTL_GMC : R/W; bitpos: [14:13]; default: 0;
 *  Global Multi Count (GMC)
 *
 *  GMC must be programmed only once after initialization.
 *  Applicable only for Scatter/Gather DMA mode. This indicates the number of packets
 *  to be serviced for that end point before moving to the next end point. It is only
 *  for non-periodic endpoints.
 *  - 2'b00: Invalid.
 *  - 2'b01: 1 packet.
 *  - 2'b10: 2 packets.
 *  - 2'b11: 3 packets.
 *  The value of this field automatically changes to 2'h1 when DCFG.DescDMA is set to
 *  1. When Scatter/Gather DMA mode is disabled, this field is reserved. and reads
 *  2'b00.
 */
#define USB_OTGFS_DCTL_GMC    0x00000003U
#define USB_OTGFS_DCTL_GMC_M  (USB_OTGFS_DCTL_GMC_V << USB_OTGFS_DCTL_GMC_S)
#define USB_OTGFS_DCTL_GMC_V  0x00000003U
#define USB_OTGFS_DCTL_GMC_S  13
/** USB_OTGFS_DCTL_IGNRFRMNUM : R/W; bitpos: [15]; default: 0;
 *  Ignore Frame Number Feature for Isochronous Endpoints (IgnrFrmNum)
 *
 *  This field is also used to control the Periodic Transfer Interrupt (PTI) feature.
 *
 *  Note: Do not program IgnrFrmNum bit to 1'b1 when the core is operating in threshold
 *  mode.
 *
 *  Slave Mode (GAHBCFG.DMAEn=0):
 *
 *  This bit is not valid in Slave mode and should not be programmed to 1.
 *
 *  Scatter/Gather DMA Mode (GAHBCFG.DMAEn=1,DCFG.DescDMA=1):
 *
 *  Note: When Scatter/Gather DMA mode is enabled this feature is not applicable to
 *  High Speed, High bandwidth transfers.
 *
 *  When this bit is enabled, there must be only one packet per descriptor.
 *  - 0: The core transmits the packets only in the frame number in which they are
 *  intended to be transmitted.
 *  - 1: The core ignores the frame number, sending packets immediately as the packets
 *  are ready.
 *  In Scatter/Gather DMA mode, if this bit is enabled, the packets are not flushed
 *  when a ISOC IN token is received for an elapsed frame.
 *
 *  Non-Scatter/Gather DMA Mode, that is, Buffer DMA Mode
 *  (GAHBCFG.DMAEn=1,DCFG.DescDMA=0):
 *
 *  When Scatter/Gather DMA mode is disabled, this field is used by the application to
 *  enable Periodic Transfer Interrupt (PTI) Mode.
 *
 *  The application can program Periodic Endpoint transfers for multiple (micro)Frames.
 *  - 0: Periodic Transfer Interrupt feature is disabled, application needs to program
 *  transfers for periodic endpoints every (micro)Frame
 *  - 1: Periodic Transfer Interrupt feature is enabled, application can program
 *  transfers for multiple (micro)Frames for periodic endpoints.
 *  In the PTI mode, the application will receive Transfer Complete Interrupt after
 *  transfers for multiple (micro)Frames are completed.
 */
#define USB_OTGFS_DCTL_IGNRFRMNUM    (BIT(15))
#define USB_OTGFS_DCTL_IGNRFRMNUM_M  (USB_OTGFS_DCTL_IGNRFRMNUM_V << USB_OTGFS_DCTL_IGNRFRMNUM_S)
#define USB_OTGFS_DCTL_IGNRFRMNUM_V  0x00000001U
#define USB_OTGFS_DCTL_IGNRFRMNUM_S  15
/** USB_OTGFS_DCTL_NAKONBBLE : R/W; bitpos: [16]; default: 0;
 *  NAK on Babble Error (NakOnBble)
 *
 *  Set NAK automatically on babble (NakOnBble). The core sets NAK automatically for
 *  the endpoint on which babble is received.
 */
#define USB_OTGFS_DCTL_NAKONBBLE    (BIT(16))
#define USB_OTGFS_DCTL_NAKONBBLE_M  (USB_OTGFS_DCTL_NAKONBBLE_V << USB_OTGFS_DCTL_NAKONBBLE_S)
#define USB_OTGFS_DCTL_NAKONBBLE_V  0x00000001U
#define USB_OTGFS_DCTL_NAKONBBLE_S  16
/** USB_OTGFS_DCTL_ENCONTONBNA : R/W; bitpos: [17]; default: 0;
 *  Enable Continue on BNA (EnContOnBNA)
 *
 *  This bit enables the core to continue on BNA for Bulk OUT endpoints.
 *  With this feature enabled, when a Bulk OUT or INTR OUT endpoint receives a BNA
 *  interrupt
 *  the core starts processing the descriptor that caused the BNA interrupt after
 *  the endpoint re-enables the endpoint.
 *  - 1'b0: After receiving BNA interrupt,the core disables the endpoint. When the
 *  endpoint is re-enabled by the application,the core starts processing from the
 *  DOEPDMA descriptor.
 *  - 1'b1: After receiving BNA interrupt, the core disables the endpoint. When the
 *  endpoint is re-enabled by the application, the core starts processing from the
 *  descriptor that received the BNA interrupt.
 *
 *  This bit is valid only when OTG_EN_DESC_DMA == 1'b1. It is a one-time programmable
 *  after reset bit like any other DCTL register bits.
 */
#define USB_OTGFS_DCTL_ENCONTONBNA    (BIT(17))
#define USB_OTGFS_DCTL_ENCONTONBNA_M  (USB_OTGFS_DCTL_ENCONTONBNA_V << USB_OTGFS_DCTL_ENCONTONBNA_S)
#define USB_OTGFS_DCTL_ENCONTONBNA_V  0x00000001U
#define USB_OTGFS_DCTL_ENCONTONBNA_S  17

