espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_DSTS_REG register
 *  Device Status Register  This register indicates the status of the core with respect
 *  to USB-related events. It must be read on interrupts from Device All Interrupts
 *  (DAINT) register.
 */
#define USB_OTGFS_DSTS_REG(i) (DR_REG_USB_BASE(i) + 0x808)
/** USB_OTGFS_DSTS_SUSPSTS : RO; bitpos: [0]; default: 0;
 *  Suspend Status (SuspSts)
 *
 *  In Device mode, this bit is set as long as a Suspend condition is
 *  detected on the USB. The core enters the Suspend state
 *  when there is no activity on the phy_line_state_i signal for an
 *  extended period of time. The core comes out of the suspend under the following
 *  conditions :
 *  - If there is any activity on the phy_line_state_i signal, or
 *  - If the application writes to the Remote Wakeup Signaling bit in the Device
 *  Control register (DCTL.RmtWkUpSig).
 *  When the core comes out of the suspend, this bit is set to 1'b0.
 */
#define USB_OTGFS_DSTS_SUSPSTS    (BIT(0))
#define USB_OTGFS_DSTS_SUSPSTS_M  (USB_OTGFS_DSTS_SUSPSTS_V << USB_OTGFS_DSTS_SUSPSTS_S)
#define USB_OTGFS_DSTS_SUSPSTS_V  0x00000001U
#define USB_OTGFS_DSTS_SUSPSTS_S  0
/** USB_OTGFS_DSTS_ENUMSPD : RO; bitpos: [2:1]; default: 1;
 *  Enumerated Speed (EnumSpd)
 *
 *  Indicates the speed at which the controller has come up
 *  after speed detection through a connect or reset sequence.
 *  - 2'b00: High speed (PHY clock is running at 30 or 60 MHz)
 *  - 2'b01: Full speed (PHY clock is running at 30 or 60 MHz)
 *  - 2'b10: Low speed (PHY clock is running at 6 MHz)
 *  - 2'b11: Full speed (PHY clock is running at 48 MHz)
 *  Low speed is not supported for devices using a UTMI+ PHY.
 */
#define USB_OTGFS_DSTS_ENUMSPD    0x00000003U
#define USB_OTGFS_DSTS_ENUMSPD_M  (USB_OTGFS_DSTS_ENUMSPD_V << USB_OTGFS_DSTS_ENUMSPD_S)
#define USB_OTGFS_DSTS_ENUMSPD_V  0x00000003U
#define USB_OTGFS_DSTS_ENUMSPD_S  1
/** USB_OTGFS_DSTS_ERRTICERR : RO; bitpos: [3]; default: 0;
 *  Erratic Error (ErrticErr)
 *
 *  The core sets this bit to report any erratic errors
 *  (phy_rxvalid_i/phy_rxvldh_i or phy_rxactive_i is asserted for at
 *  least 2 ms, due to PHY error) seen on the UTMI+.
 *  Due to erratic errors, the DWC_otg core goes into Suspended
 *  state and an interrupt is generated to the application with Early
 *  Suspend bit of the Core Interrupt register (GINTSTS.ErlySusp).
 *  If the early suspend is asserted due to an erratic error, the
 *  application can only perform a soft disconnect recover.
 */
#define USB_OTGFS_DSTS_ERRTICERR    (BIT(3))
#define USB_OTGFS_DSTS_ERRTICERR_M  (USB_OTGFS_DSTS_ERRTICERR_V << USB_OTGFS_DSTS_ERRTICERR_S)
#define USB_OTGFS_DSTS_ERRTICERR_V  0x00000001U
#define USB_OTGFS_DSTS_ERRTICERR_S  3
/** USB_OTGFS_DSTS_SOFFN : RO; bitpos: [21:8]; default: 0;
 *  Frame or Microframe Number of the Received SOF  (SOFFN)
 *
 *  When the core is operating at high speed, this field contains a microframe number.
 *  When the core is operating at full or low speed, this field contains a Frame number.
 *
 *  Note: This register may return a non-zero value if read immediately after power-on
 *  reset.
 *  In case the register bit reads non-zero immediately after power-on reset, it does
 *  not
 *  indicate that SOF has been received from the host. The read value of this interrupt
 *  is
 *  valid only after a valid connection between host and device is established.
 */
#define USB_OTGFS_DSTS_SOFFN    0x00003FFFU
#define USB_OTGFS_DSTS_SOFFN_M  (USB_OTGFS_DSTS_SOFFN_V << USB_OTGFS_DSTS_SOFFN_S)
#define USB_OTGFS_DSTS_SOFFN_V  0x00003FFFU
#define USB_OTGFS_DSTS_SOFFN_S  8
/** USB_OTGFS_DSTS_DEVLNSTS : RO; bitpos: [23:22]; default: 0;
 *  Device Line Status (DevLnSts)
 *
 *  Indicates the current logic level USB data lines
 *  - DevLnSts[1]: Logic level of D+
 *  - DevLnSts[0]: Logic level of D-
 */
#define USB_OTGFS_DSTS_DEVLNSTS    0x00000003U
#define USB_OTGFS_DSTS_DEVLNSTS_M  (USB_OTGFS_DSTS_DEVLNSTS_V << USB_OTGFS_DSTS_DEVLNSTS_S)
#define USB_OTGFS_DSTS_DEVLNSTS_V  0x00000003U
#define USB_OTGFS_DSTS_DEVLNSTS_S  22

/** USB_OTGFS_DIEPMSK_REG register
 *  Device IN Endpoint Common Interrupt Mask Register  This register works with each of
 *  the Device IN Endpoint Interrupt (DIEPINTn) registers for all endpoints to generate
 *  an interrupt per IN endpoint. The IN endpoint interrupt for a specific status in
 *  the DIEPINTn register can be masked by writing to the corresponding bit in this
 *  register. Status bits are masked by default.
 */
#define USB_OTGFS_DIEPMSK_REG(i) (DR_REG_USB_BASE(i) + 0x810)
/** USB_OTGFS_DIEPMSK_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGFS_DIEPMSK_XFERCOMPLMSK    (BIT(0))
#define USB_OTGFS_DIEPMSK_XFERCOMPLMSK_M  (USB_OTGFS_DIEPMSK_XFERCOMPLMSK_V << USB_OTGFS_DIEPMSK_XFERCOMPLMSK_S)
#define USB_OTGFS_DIEPMSK_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGFS_DIEPMSK_XFERCOMPLMSK_S  0
/** USB_OTGFS_DIEPMSK_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGFS_DIEPMSK_EPDISBLDMSK    (BIT(1))
#define USB_OTGFS_DIEPMSK_EPDISBLDMSK_M  (USB_OTGFS_DIEPMSK_EPDISBLDMSK_V << USB_OTGFS_DIEPMSK_EPDISBLDMSK_S)
#define USB_OTGFS_DIEPMSK_EPDISBLDMSK_V  0x00000001U
#define USB_OTGFS_DIEPMSK_EPDISBLDMSK_S  1
/** USB_OTGFS_DIEPMSK_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGFS_DIEPMSK_AHBERRMSK    (BIT(2))
#define USB_OTGFS_DIEPMSK_AHBERRMSK_M  (USB_OTGFS_DIEPMSK_AHBERRMSK_V << USB_OTGFS_DIEPMSK_AHBERRMSK_S)
#define USB_OTGFS_DIEPMSK_AHBERRMSK_V  0x00000001U
#define USB_OTGFS_DIEPMSK_AHBERRMSK_S  2
/** USB_OTGFS_DIEPMSK_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk) (Non-isochronous endpoints)
 */
#define USB_OTGFS_DIEPMSK_TIMEOUTMSK    (BIT(3))
#define USB_OTGFS_DIEPMSK_TIMEOUTMSK_M  (USB_OTGFS_DIEPMSK_TIMEOUTMSK_V << USB_OTGFS_DIEPMSK_TIMEOUTMSK_S)
#define USB_OTGFS_DIEPMSK_TIMEOUTMSK_V  0x00000001U
#define USB_OTGFS_DIEPMSK_TIMEOUTMSK_S  3
/** USB_OTGFS_DIEPMSK_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask (INTknTXFEmpMsk)
 */
#define USB_OTGFS_DIEPMSK_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGFS_DIEPMSK_INTKNTXFEMPMSK_M  (USB_OTGFS_DIEPMSK_INTKNTXFEMPMSK_V << USB_OTGFS_DIEPMSK_INTKNTXFEMPMSK_S)
#define USB_OTGFS_DIEPMSK_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGFS_DIEPMSK_INTKNTXFEMPMSK_S  4
/** USB_OTGFS_DIEPMSK_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGFS_DIEPMSK_INTKNEPMISMSK    (BIT(5))
#define USB_OTGFS_DIEPMSK_INTKNEPMISMSK_M  (USB_OTGFS_DIEPMSK_INTKNEPMISMSK_V << USB_OTGFS_DIEPMSK_INTKNEPMISMSK_S)
#define USB_OTGFS_DIEPMSK_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGFS_DIEPMSK_INTKNEPMISMSK_S  5
/** USB_OTGFS_DIEPMSK_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGFS_DIEPMSK_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGFS_DIEPMSK_INEPNAKEFFMSK_M  (USB_OTGFS_DIEPMSK_INEPNAKEFFMSK_V << USB_OTGFS_DIEPMSK_INEPNAKEFFMSK_S)
#define USB_OTGFS_DIEPMSK_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGFS_DIEPMSK_INEPNAKEFFMSK_S  6
/** USB_OTGFS_DIEPMSK_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGFS_DIEPMSK_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGFS_DIEPMSK_TXFIFOUNDRNMSK_M  (USB_OTGFS_DIEPMSK_TXFIFOUNDRNMSK_V << USB_OTGFS_DIEPMSK_TXFIFOUNDRNMSK_S)
#define USB_OTGFS_DIEPMSK_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGFS_DIEPMSK_TXFIFOUNDRNMSK_S  8
/** USB_OTGFS_DIEPMSK_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGFS_DIEPMSK_BNAININTRMSK    (BIT(9))
#define USB_OTGFS_DIEPMSK_BNAININTRMSK_M  (USB_OTGFS_DIEPMSK_BNAININTRMSK_V << USB_OTGFS_DIEPMSK_BNAININTRMSK_S)
#define USB_OTGFS_DIEPMSK_BNAININTRMSK_V  0x00000001U
#define USB_OTGFS_DIEPMSK_BNAININTRMSK_S  9
/** USB_OTGFS_DIEPMSK_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGFS_DIEPMSK_NAKMSK    (BIT(13))
#define USB_OTGFS_DIEPMSK_NAKMSK_M  (USB_OTGFS_DIEPMSK_NAKMSK_V << USB_OTGFS_DIEPMSK_NAKMSK_S)
#define USB_OTGFS_DIEPMSK_NAKMSK_V  0x00000001U
#define USB_OTGFS_DIEPMSK_NAKMSK_S  13

/** USB_OTGFS_DOEPMSK_REG register
 *  Device OUT Endpoint Common Interrupt Mask Register  This register works with each
 *  of the Device OUT Endpoint Interrupt (DOEPINTn) registers for all endpoints to
 *  generate an interrupt per OUT endpoint. The OUT endpoint interrupt for a specific
 *  status in the DOEPINTn register can be masked by writing into the corresponding bit
 *  in this register. Status bits are masked by default.
 */
#define USB_OTGFS_DOEPMSK_REG(i) (DR_REG_USB_BASE(i) + 0x814)
/** USB_OTGFS_DOEPMSK_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGFS_DOEPMSK_XFERCOMPLMSK    (BIT(0))
#define USB_OTGFS_DOEPMSK_XFERCOMPLMSK_M  (USB_OTGFS_DOEPMSK_XFERCOMPLMSK_V << USB_OTGFS_DOEPMSK_XFERCOMPLMSK_S)
#define USB_OTGFS_DOEPMSK_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_XFERCOMPLMSK_S  0
/** USB_OTGFS_DOEPMSK_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGFS_DOEPMSK_EPDISBLDMSK    (BIT(1))
#define USB_OTGFS_DOEPMSK_EPDISBLDMSK_M  (USB_OTGFS_DOEPMSK_EPDISBLDMSK_V << USB_OTGFS_DOEPMSK_EPDISBLDMSK_S)
#define USB_OTGFS_DOEPMSK_EPDISBLDMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_EPDISBLDMSK_S  1
/** USB_OTGFS_DOEPMSK_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGFS_DOEPMSK_AHBERRMSK    (BIT(2))
#define USB_OTGFS_DOEPMSK_AHBERRMSK_M  (USB_OTGFS_DOEPMSK_AHBERRMSK_V << USB_OTGFS_DOEPMSK_AHBERRMSK_S)
#define USB_OTGFS_DOEPMSK_AHBERRMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_AHBERRMSK_S  2
/** USB_OTGFS_DOEPMSK_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGFS_DOEPMSK_SETUPMSK    (BIT(3))
#define USB_OTGFS_DOEPMSK_SETUPMSK_M  (USB_OTGFS_DOEPMSK_SETUPMSK_V << USB_OTGFS_DOEPMSK_SETUPMSK_S)
#define USB_OTGFS_DOEPMSK_SETUPMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_SETUPMSK_S  3
/** USB_OTGFS_DOEPMSK_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGFS_DOEPMSK_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGFS_DOEPMSK_OUTTKNEPDISMSK_M  (USB_OTGFS_DOEPMSK_OUTTKNEPDISMSK_V << USB_OTGFS_DOEPMSK_OUTTKNEPDISMSK_S)
#define USB_OTGFS_DOEPMSK_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_OUTTKNEPDISMSK_S  4
/** USB_OTGFS_DOEPMSK_STSPHSERCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhseRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGFS_DOEPMSK_STSPHSERCVDMSK    (BIT(5))
#define USB_OTGFS_DOEPMSK_STSPHSERCVDMSK_M  (USB_OTGFS_DOEPMSK_STSPHSERCVDMSK_V << USB_OTGFS_DOEPMSK_STSPHSERCVDMSK_S)
#define USB_OTGFS_DOEPMSK_STSPHSERCVDMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_STSPHSERCVDMSK_S  5
/** USB_OTGFS_DOEPMSK_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGFS_DOEPMSK_BACK2BACKSETUP    (BIT(6))
#define USB_OTGFS_DOEPMSK_BACK2BACKSETUP_M  (USB_OTGFS_DOEPMSK_BACK2BACKSETUP_V << USB_OTGFS_DOEPMSK_BACK2BACKSETUP_S)
#define USB_OTGFS_DOEPMSK_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGFS_DOEPMSK_BACK2BACKSETUP_S  6
/** USB_OTGFS_DOEPMSK_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGFS_DOEPMSK_OUTPKTERRMSK    (BIT(8))
#define USB_OTGFS_DOEPMSK_OUTPKTERRMSK_M  (USB_OTGFS_DOEPMSK_OUTPKTERRMSK_V << USB_OTGFS_DOEPMSK_OUTPKTERRMSK_S)
#define USB_OTGFS_DOEPMSK_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_OUTPKTERRMSK_S  8
/** USB_OTGFS_DOEPMSK_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGFS_DOEPMSK_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGFS_DOEPMSK_BNAOUTINTRMSK_M  (USB_OTGFS_DOEPMSK_BNAOUTINTRMSK_V << USB_OTGFS_DOEPMSK_BNAOUTINTRMSK_S)
#define USB_OTGFS_DOEPMSK_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_BNAOUTINTRMSK_S  9
/** USB_OTGFS_DOEPMSK_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGFS_DOEPMSK_BBLEERRMSK    (BIT(12))
#define USB_OTGFS_DOEPMSK_BBLEERRMSK_M  (USB_OTGFS_DOEPMSK_BBLEERRMSK_V << USB_OTGFS_DOEPMSK_BBLEERRMSK_S)
#define USB_OTGFS_DOEPMSK_BBLEERRMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_BBLEERRMSK_S  12
/** USB_OTGFS_DOEPMSK_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGFS_DOEPMSK_NAKMSK    (BIT(13))
#define USB_OTGFS_DOEPMSK_NAKMSK_M  (USB_OTGFS_DOEPMSK_NAKMSK_V << USB_OTGFS_DOEPMSK_NAKMSK_S)
#define USB_OTGFS_DOEPMSK_NAKMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_NAKMSK_S  13
/** USB_OTGFS_DOEPMSK_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGFS_DOEPMSK_NYETMSK    (BIT(14))
#define USB_OTGFS_DOEPMSK_NYETMSK_M  (USB_OTGFS_DOEPMSK_NYETMSK_V << USB_OTGFS_DOEPMSK_NYETMSK_S)
#define USB_OTGFS_DOEPMSK_NYETMSK_V  0x00000001U
#define USB_OTGFS_DOEPMSK_NYETMSK_S  14

/** USB_OTGFS_DAINT_REG register
 *  Device All Endpoints Interrupt Register  When a significant event occurs on an
 *  endpoint, a Device All Endpoints Interrupt register interrupts the application
 *  using the Device OUT Endpoints Interrupt bit or Device IN Endpoints Interrupt bit
 *  of the Core Interrupt register (GINTSTS.OEPInt or GINTSTS.IEPInt, respectively).
 *  This is shown in Figure 5-2. There is one interrupt bit per endpoint, up to a
 *  maximum of 16 bits for OUT endpoints and 16 bits for IN endpoints. For a
 *  bidirectional endpoint, the corresponding IN and OUT interrupt bits are used. Bits
 *  in this register are set and cleared when the application sets and clears bits in
 *  the corresponding Device Endpoint-n Interrupt register (DIEPINTn/DOEPINTn).
 */
#define USB_OTGFS_DAINT_REG(i) (DR_REG_USB_BASE(i) + 0x818)
/** USB_OTGFS_DAINT_INEPINT0 : RO; bitpos: [0]; default: 0;
 *  IN Endpoint 0 Interrupt Bit
 */
#define USB_OTGFS_DAINT_INEPINT0    (BIT(0))
#define USB_OTGFS_DAINT_INEPINT0_M  (USB_OTGFS_DAINT_INEPINT0_V << USB_OTGFS_DAINT_INEPINT0_S)
#define USB_OTGFS_DAINT_INEPINT0_V  0x00000001U
#define USB_OTGFS_DAINT_INEPINT0_S  0
/** USB_OTGFS_DAINT_INEPINT1 : RO; bitpos: [1]; default: 0;
 *  IN Endpoint 1 Interrupt Bit
 */
#define USB_OTGFS_DAINT_INEPINT1    (BIT(1))
#define USB_OTGFS_DAINT_INEPINT1_M  (USB_OTGFS_DAINT_INEPINT1_V << USB_OTGFS_DAINT_INEPINT1_S)
#define USB_OTGFS_DAINT_INEPINT1_V  0x00000001U
#define USB_OTGFS_DAINT_INEPINT1_S  1
/** USB_OTGFS_DAINT_INEPINT2 : RO; bitpos: [2]; default: 0;
 *  IN Endpoint 2 Interrupt Bit
 */
#define USB_OTGFS_DAINT_INEPINT2    (BIT(2))
#define USB_OTGFS_DAINT_INEPINT2_M  (USB_OTGFS_DAINT_INEPINT2_V << USB_OTGFS_DAINT_INEPINT2_S)
#define USB_OTGFS_DAINT_INEPINT2_V  0x00000001U
#define USB_OTGFS_DAINT_INEPINT2_S  2
/** USB_OTGFS_DAINT_INEPINT3 : RO; bitpos: [3]; default: 0;
 *  IN Endpoint 3 Interrupt Bit
 */
#define USB_OTGFS_DAINT_INEPINT3    (BIT(3))
#define USB_OTGFS_DAINT_INEPINT3_M  (USB_OTGFS_DAINT_INEPINT3_V << USB_OTGFS_DAINT_INEPINT3_S)
#define USB_OTGFS_DAINT_INEPINT3_V  0x00000001U
#define USB_OTGFS_DAINT_INEPINT3_S  3
/** USB_OTGFS_DAINT_INEPINT4 : RO; bitpos: [4]; default: 0;
 *  IN Endpoint 4 Interrupt Bit
 */
#define USB_OTGFS_DAINT_INEPINT4    (BIT(4))
#define USB_OTGFS_DAINT_INEPINT4_M  (USB_OTGFS_DAINT_INEPINT4_V << USB_OTGFS_DAINT_INEPINT4_S)
#define USB_OTGFS_DAINT_INEPINT4_V  0x00000001U
#define USB_OTGFS_DAINT_INEPINT4_S  4
/** USB_OTGFS_DAINT_INEPINT5 : RO; bitpos: [5]; default: 0;
 *  IN Endpoint 5 Interrupt Bit
 */
#define USB_OTGFS_DAINT_INEPINT5    (BIT(5))
#define USB_OTGFS_DAINT_INEPINT5_M  (USB_OTGFS_DAINT_INEPINT5_V << USB_OTGFS_DAINT_INEPINT5_S)
#define USB_OTGFS_DAINT_INEPINT5_V  0x00000001U
#define USB_OTGFS_DAINT_INEPINT5_S  5
/** USB_OTGFS_DAINT_INEPINT6 : RO; bitpos: [6]; default: 0;
 *  IN Endpoint 6 Interrupt Bit
 */
#define USB_OTGFS_DAINT_INEPINT6    (BIT(6))
#define USB_OTGFS_DAINT_INEPINT6_M  (USB_OTGFS_DAINT_INEPINT6_V << USB_OTGFS_DAINT_INEPINT6_S)
#define USB_OTGFS_DAINT_INEPINT6_V  0x00000001U
#define USB_OTGFS_DAINT_INEPINT6_S  6
/** USB_OTGFS_DAINT_OUTEPINT0 : RO; bitpos: [16]; default: 0;
 *  OUT Endpoint 0 Interrupt Bit
 */
#define USB_OTGFS_DAINT_OUTEPINT0    (BIT(16))
#define USB_OTGFS_DAINT_OUTEPINT0_M  (USB_OTGFS_DAINT_OUTEPINT0_V << USB_OTGFS_DAINT_OUTEPINT0_S)
#define USB_OTGFS_DAINT_OUTEPINT0_V  0x00000001U
#define USB_OTGFS_DAINT_OUTEPINT0_S  16
/** USB_OTGFS_DAINT_OUTEPINT1 : RO; bitpos: [17]; default: 0;
 *  OUT Endpoint 1 Interrupt Bit
 */
#define USB_OTGFS_DAINT_OUTEPINT1    (BIT(17))
#define USB_OTGFS_DAINT_OUTEPINT1_M  (USB_OTGFS_DAINT_OUTEPINT1_V << USB_OTGFS_DAINT_OUTEPINT1_S)
#define USB_OTGFS_DAINT_OUTEPINT1_V  0x00000001U
#define USB_OTGFS_DAINT_OUTEPINT1_S  17
/** USB_OTGFS_DAINT_OUTEPINT2 : RO; bitpos: [18]; default: 0;
 *  OUT Endpoint 2 Interrupt Bit
 */
#define USB_OTGFS_DAINT_OUTEPINT2    (BIT(18))
#define USB_OTGFS_DAINT_OUTEPINT2_M  (USB_OTGFS_DAINT_OUTEPINT2_V << USB_OTGFS_DAINT_OUTEPINT2_S)
#define USB_OTGFS_DAINT_OUTEPINT2_V  0x00000001U
#define USB_OTGFS_DAINT_OUTEPINT2_S  18
/** USB_OTGFS_DAINT_OUTEPINT3 : RO; bitpos: [19]; default: 0;
 *  OUT Endpoint 3 Interrupt Bit
 */
#define USB_OTGFS_DAINT_OUTEPINT3    (BIT(19))
#define USB_OTGFS_DAINT_OUTEPINT3_M  (USB_OTGFS_DAINT_OUTEPINT3_V << USB_OTGFS_DAINT_OUTEPINT3_S)
#define USB_OTGFS_DAINT_OUTEPINT3_V  0x00000001U
#define USB_OTGFS_DAINT_OUTEPINT3_S  19
/** USB_OTGFS_DAINT_OUTEPINT4 : RO; bitpos: [20]; default: 0;
 *  OUT Endpoint 4 Interrupt Bit
 */
#define USB_OTGFS_DAINT_OUTEPINT4    (BIT(20))
#define USB_OTGFS_DAINT_OUTEPINT4_M  (USB_OTGFS_DAINT_OUTEPINT4_V << USB_OTGFS_DAINT_OUTEPINT4_S)
#define USB_OTGFS_DAINT_OUTEPINT4_V  0x00000001U
#define USB_OTGFS_DAINT_OUTEPINT4_S  20
/** USB_OTGFS_DAINT_OUTEPINT5 : RO; bitpos: [21]; default: 0;
 *  OUT Endpoint 5 Interrupt Bit
 */
#define USB_OTGFS_DAINT_OUTEPINT5    (BIT(21))
#define USB_OTGFS_DAINT_OUTEPINT5_M  (USB_OTGFS_DAINT_OUTEPINT5_V << USB_OTGFS_DAINT_OUTEPINT5_S)
#define USB_OTGFS_DAINT_OUTEPINT5_V  0x00000001U
#define USB_OTGFS_DAINT_OUTEPINT5_S  21
/** USB_OTGFS_DAINT_OUTEPINT6 : RO; bitpos: [22]; default: 0;
 *  OUT Endpoint 6 Interrupt Bit
 */
#define USB_OTGFS_DAINT_OUTEPINT6    (BIT(22))
#define USB_OTGFS_DAINT_OUTEPINT6_M  (USB_OTGFS_DAINT_OUTEPINT6_V << USB_OTGFS_DAINT_OUTEPINT6_S)
#define USB_OTGFS_DAINT_OUTEPINT6_V  0x00000001U
#define USB_OTGFS_DAINT_OUTEPINT6_S  22

