espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_DAINTMSK_REG register
 *  Device All Endpoints Interrupt Mask Register    The Device Endpoint Interrupt Mask
 *  register works with the Device Endpoint Interrupt register to interrupt the
 *  application when an event occurs on a device endpoint. However, the Device All
 *  Endpoints Interrupt (DAINT) register bit corresponding to that interrupt is still
 *  set.
 */
#define USB_OTGFS_DAINTMSK_REG(i) (DR_REG_USB_BASE(i) + 0x81c)
/** USB_OTGFS_DAINTMSK_INEPMSK0 : R/W; bitpos: [0]; default: 0;
 *  IN Endpoint 0 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_INEPMSK0    (BIT(0))
#define USB_OTGFS_DAINTMSK_INEPMSK0_M  (USB_OTGFS_DAINTMSK_INEPMSK0_V << USB_OTGFS_DAINTMSK_INEPMSK0_S)
#define USB_OTGFS_DAINTMSK_INEPMSK0_V  0x00000001U
#define USB_OTGFS_DAINTMSK_INEPMSK0_S  0
/** USB_OTGFS_DAINTMSK_INEPMSK1 : R/W; bitpos: [1]; default: 0;
 *  IN Endpoint 1 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_INEPMSK1    (BIT(1))
#define USB_OTGFS_DAINTMSK_INEPMSK1_M  (USB_OTGFS_DAINTMSK_INEPMSK1_V << USB_OTGFS_DAINTMSK_INEPMSK1_S)
#define USB_OTGFS_DAINTMSK_INEPMSK1_V  0x00000001U
#define USB_OTGFS_DAINTMSK_INEPMSK1_S  1
/** USB_OTGFS_DAINTMSK_INEPMSK2 : R/W; bitpos: [2]; default: 0;
 *  IN Endpoint 2 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_INEPMSK2    (BIT(2))
#define USB_OTGFS_DAINTMSK_INEPMSK2_M  (USB_OTGFS_DAINTMSK_INEPMSK2_V << USB_OTGFS_DAINTMSK_INEPMSK2_S)
#define USB_OTGFS_DAINTMSK_INEPMSK2_V  0x00000001U
#define USB_OTGFS_DAINTMSK_INEPMSK2_S  2
/** USB_OTGFS_DAINTMSK_INEPMSK3 : R/W; bitpos: [3]; default: 0;
 *  IN Endpoint 3 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_INEPMSK3    (BIT(3))
#define USB_OTGFS_DAINTMSK_INEPMSK3_M  (USB_OTGFS_DAINTMSK_INEPMSK3_V << USB_OTGFS_DAINTMSK_INEPMSK3_S)
#define USB_OTGFS_DAINTMSK_INEPMSK3_V  0x00000001U
#define USB_OTGFS_DAINTMSK_INEPMSK3_S  3
/** USB_OTGFS_DAINTMSK_INEPMSK4 : R/W; bitpos: [4]; default: 0;
 *  IN Endpoint 4 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_INEPMSK4    (BIT(4))
#define USB_OTGFS_DAINTMSK_INEPMSK4_M  (USB_OTGFS_DAINTMSK_INEPMSK4_V << USB_OTGFS_DAINTMSK_INEPMSK4_S)
#define USB_OTGFS_DAINTMSK_INEPMSK4_V  0x00000001U
#define USB_OTGFS_DAINTMSK_INEPMSK4_S  4
/** USB_OTGFS_DAINTMSK_INEPMSK5 : R/W; bitpos: [5]; default: 0;
 *  IN Endpoint 5 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_INEPMSK5    (BIT(5))
#define USB_OTGFS_DAINTMSK_INEPMSK5_M  (USB_OTGFS_DAINTMSK_INEPMSK5_V << USB_OTGFS_DAINTMSK_INEPMSK5_S)
#define USB_OTGFS_DAINTMSK_INEPMSK5_V  0x00000001U
#define USB_OTGFS_DAINTMSK_INEPMSK5_S  5
/** USB_OTGFS_DAINTMSK_INEPMSK6 : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint 6 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_INEPMSK6    (BIT(6))
#define USB_OTGFS_DAINTMSK_INEPMSK6_M  (USB_OTGFS_DAINTMSK_INEPMSK6_V << USB_OTGFS_DAINTMSK_INEPMSK6_S)
#define USB_OTGFS_DAINTMSK_INEPMSK6_V  0x00000001U
#define USB_OTGFS_DAINTMSK_INEPMSK6_S  6
/** USB_OTGFS_DAINTMSK_OUTEPMSK0 : R/W; bitpos: [16]; default: 0;
 *  OUT Endpoint 0 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_OUTEPMSK0    (BIT(16))
#define USB_OTGFS_DAINTMSK_OUTEPMSK0_M  (USB_OTGFS_DAINTMSK_OUTEPMSK0_V << USB_OTGFS_DAINTMSK_OUTEPMSK0_S)
#define USB_OTGFS_DAINTMSK_OUTEPMSK0_V  0x00000001U
#define USB_OTGFS_DAINTMSK_OUTEPMSK0_S  16
/** USB_OTGFS_DAINTMSK_OUTEPMSK1 : R/W; bitpos: [17]; default: 0;
 *  OUT Endpoint 1 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_OUTEPMSK1    (BIT(17))
#define USB_OTGFS_DAINTMSK_OUTEPMSK1_M  (USB_OTGFS_DAINTMSK_OUTEPMSK1_V << USB_OTGFS_DAINTMSK_OUTEPMSK1_S)
#define USB_OTGFS_DAINTMSK_OUTEPMSK1_V  0x00000001U
#define USB_OTGFS_DAINTMSK_OUTEPMSK1_S  17
/** USB_OTGFS_DAINTMSK_OUTEPMSK2 : R/W; bitpos: [18]; default: 0;
 *  OUT Endpoint 2 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_OUTEPMSK2    (BIT(18))
#define USB_OTGFS_DAINTMSK_OUTEPMSK2_M  (USB_OTGFS_DAINTMSK_OUTEPMSK2_V << USB_OTGFS_DAINTMSK_OUTEPMSK2_S)
#define USB_OTGFS_DAINTMSK_OUTEPMSK2_V  0x00000001U
#define USB_OTGFS_DAINTMSK_OUTEPMSK2_S  18
/** USB_OTGFS_DAINTMSK_OUTEPMSK3 : R/W; bitpos: [19]; default: 0;
 *  OUT Endpoint 3 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_OUTEPMSK3    (BIT(19))
#define USB_OTGFS_DAINTMSK_OUTEPMSK3_M  (USB_OTGFS_DAINTMSK_OUTEPMSK3_V << USB_OTGFS_DAINTMSK_OUTEPMSK3_S)
#define USB_OTGFS_DAINTMSK_OUTEPMSK3_V  0x00000001U
#define USB_OTGFS_DAINTMSK_OUTEPMSK3_S  19
/** USB_OTGFS_DAINTMSK_OUTEPMSK4 : R/W; bitpos: [20]; default: 0;
 *  OUT Endpoint 4 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_OUTEPMSK4    (BIT(20))
#define USB_OTGFS_DAINTMSK_OUTEPMSK4_M  (USB_OTGFS_DAINTMSK_OUTEPMSK4_V << USB_OTGFS_DAINTMSK_OUTEPMSK4_S)
#define USB_OTGFS_DAINTMSK_OUTEPMSK4_V  0x00000001U
#define USB_OTGFS_DAINTMSK_OUTEPMSK4_S  20
/** USB_OTGFS_DAINTMSK_OUTEPMSK5 : R/W; bitpos: [21]; default: 0;
 *  OUT Endpoint 5 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_OUTEPMSK5    (BIT(21))
#define USB_OTGFS_DAINTMSK_OUTEPMSK5_M  (USB_OTGFS_DAINTMSK_OUTEPMSK5_V << USB_OTGFS_DAINTMSK_OUTEPMSK5_S)
#define USB_OTGFS_DAINTMSK_OUTEPMSK5_V  0x00000001U
#define USB_OTGFS_DAINTMSK_OUTEPMSK5_S  21
/** USB_OTGFS_DAINTMSK_OUTEPMSK6 : R/W; bitpos: [22]; default: 0;
 *  OUT Endpoint 6 Interrupt mask Bit
 */
#define USB_OTGFS_DAINTMSK_OUTEPMSK6    (BIT(22))
#define USB_OTGFS_DAINTMSK_OUTEPMSK6_M  (USB_OTGFS_DAINTMSK_OUTEPMSK6_V << USB_OTGFS_DAINTMSK_OUTEPMSK6_S)
#define USB_OTGFS_DAINTMSK_OUTEPMSK6_V  0x00000001U
#define USB_OTGFS_DAINTMSK_OUTEPMSK6_S  22

/** USB_OTGFS_DVBUSDIS_REG register
 *  Device VBUS Discharge Time Register   This register specifies the VBUS discharge
 *  time after VBUS pulsing during SRP.
 */
#define USB_OTGFS_DVBUSDIS_REG(i) (DR_REG_USB_BASE(i) + 0x828)
/** USB_OTGFS_DVBUSDIS_DVBUSDIS : R/W; bitpos: [15:0]; default: 6103;
 *  Device VBUS Discharge Time (DVBUSDis)
 *
 *  Specifies the VBUS discharge time after VBUS pulsing during SRP. This value equals
 *  (VBUS discharge time in PHY clocks) / 1, 024.
 *
 *  The value you use depends whether the PHY is operating at 30MHz (16-bit data width)
 *  or 60 MHz (8-bit data width).
 *
 *  Depending on your VBUS load, this value can need adjustment.
 */
#define USB_OTGFS_DVBUSDIS_DVBUSDIS    0x0000FFFFU
#define USB_OTGFS_DVBUSDIS_DVBUSDIS_M  (USB_OTGFS_DVBUSDIS_DVBUSDIS_V << USB_OTGFS_DVBUSDIS_DVBUSDIS_S)
#define USB_OTGFS_DVBUSDIS_DVBUSDIS_V  0x0000FFFFU
#define USB_OTGFS_DVBUSDIS_DVBUSDIS_S  0

/** USB_OTGFS_DVBUSPULSE_REG register
 *  Device VBUS Pulsing Time Register
 */
#define USB_OTGFS_DVBUSPULSE_REG(i) (DR_REG_USB_BASE(i) + 0x82c)
/** USB_OTGFS_DVBUSPULSE_DVBUSPULSE : R/W; bitpos: [11:0]; default: 1464;
 *  Device VBUS Pulsing Time (DVBUSPulse)
 *
 *  Specifies the VBUS pulsing time during SRP. This value equals (VBUS pulsing time in
 *  PHY clocks) / 1, 024
 *
 *  The value you use depends whether the PHY is operating at 30MHz (16-bit data width)
 *  or 60 MHz (8-bit data width).
 */
#define USB_OTGFS_DVBUSPULSE_DVBUSPULSE    0x00000FFFU
#define USB_OTGFS_DVBUSPULSE_DVBUSPULSE_M  (USB_OTGFS_DVBUSPULSE_DVBUSPULSE_V << USB_OTGFS_DVBUSPULSE_DVBUSPULSE_S)
#define USB_OTGFS_DVBUSPULSE_DVBUSPULSE_V  0x00000FFFU
#define USB_OTGFS_DVBUSPULSE_DVBUSPULSE_S  0

/** USB_OTGFS_DTHRCTL_REG register
 *  Device Threshold Control Register
 */
#define USB_OTGFS_DTHRCTL_REG(i) (DR_REG_USB_BASE(i) + 0x830)
/** USB_OTGFS_DTHRCTL_NONISOTHREN : R/W; bitpos: [0]; default: 0;
 *  Non-ISO IN Endpoints Threshold Enable. (NonISOThrEn)
 *
 *  When this bit is Set, the core enables thresholding for Non Isochronous IN
 *  endpoints.
 */
#define USB_OTGFS_DTHRCTL_NONISOTHREN    (BIT(0))
#define USB_OTGFS_DTHRCTL_NONISOTHREN_M  (USB_OTGFS_DTHRCTL_NONISOTHREN_V << USB_OTGFS_DTHRCTL_NONISOTHREN_S)
#define USB_OTGFS_DTHRCTL_NONISOTHREN_V  0x00000001U
#define USB_OTGFS_DTHRCTL_NONISOTHREN_S  0
/** USB_OTGFS_DTHRCTL_ISOTHREN : R/W; bitpos: [1]; default: 0;
 *
 *  ISO IN Endpoints Threshold Enable. (ISOThrEn)
 *
 *  When this bit is Set, the core enables thresholding for isochronous IN
 *  endpoints.
 */
#define USB_OTGFS_DTHRCTL_ISOTHREN    (BIT(1))
#define USB_OTGFS_DTHRCTL_ISOTHREN_M  (USB_OTGFS_DTHRCTL_ISOTHREN_V << USB_OTGFS_DTHRCTL_ISOTHREN_S)
#define USB_OTGFS_DTHRCTL_ISOTHREN_V  0x00000001U
#define USB_OTGFS_DTHRCTL_ISOTHREN_S  1
/** USB_OTGFS_DTHRCTL_TXTHRLEN : R/W; bitpos: [10:2]; default: 8;
 *  Transmit Threshold Length (TxThrLen)
 *
 *  This field specifies Transmit thresholding size in DWORDS. This also forms
 *  the MAC threshold and specifies the amount of data in bytes to be in the
 *  corresponding endpoint transmit FIFO, before the core can start transmit
 *  on the USB. The threshold length has to be at least eight DWORDS when the
 *  value of AHBThrRatio is 2'h00. In case the AHBThrRatio is non zero the
 *  application needs to ensure that the AHB Threshold value does not go below
 *  the recommended eight DWORD.  This field controls both isochronous and
 *  non-isochronous IN endpoint thresholds. The recommended value for ThrLen
 *  is to be the same as the programmed AHB Burst Length (GAHBCFG.HBstLen).
 *
 *  Note:
 *  - When OTG_ARCHITECTURE=0, the reset value of this register field is 0.
 *  - When OTG_ARCHITECTURE=2, the reset value of this register field is 8.
 */
#define USB_OTGFS_DTHRCTL_TXTHRLEN    0x000001FFU
#define USB_OTGFS_DTHRCTL_TXTHRLEN_M  (USB_OTGFS_DTHRCTL_TXTHRLEN_V << USB_OTGFS_DTHRCTL_TXTHRLEN_S)
#define USB_OTGFS_DTHRCTL_TXTHRLEN_V  0x000001FFU
#define USB_OTGFS_DTHRCTL_TXTHRLEN_S  2
/** USB_OTGFS_DTHRCTL_AHBTHRRATIO : R/W; bitpos: [12:11]; default: 0;
 *  AHB Threshold Ratio (AHBThrRatio)
 *
 *  These bits define the ratio between the AHB threshold and the MAC threshold for the
 *  transmit path only. The AHB threshold always remains less than or equal to the USB
 *  threshold, because this does not increase overhead. Both the AHB and the MAC
 *  threshold must be DWORD-aligned. The application needs to program TxThrLen and the
 *  AHBThrRatio to make the AHB Threshold value DWORD aligned. If the AHB threshold
 *  value is not DWORD aligned, the core might not behave correctly. When programming
 *  the TxThrLen and AHBThrRatio, the application must ensure that the minimum AHB
 *  threshold value does not go below 8 DWORDS to meet the USB turnaround time
 *  requirements.
 *  - 2'b00: AHB threshold = MAC threshold
 *  - 2'b01: AHB threshold = MAC threshold / 2
 *  - 2'b10: AHB threshold = MAC threshold / 4
 *  - 2'b11: AHB threshold = MAC threshold / 8
 */
#define USB_OTGFS_DTHRCTL_AHBTHRRATIO    0x00000003U
#define USB_OTGFS_DTHRCTL_AHBTHRRATIO_M  (USB_OTGFS_DTHRCTL_AHBTHRRATIO_V << USB_OTGFS_DTHRCTL_AHBTHRRATIO_S)
#define USB_OTGFS_DTHRCTL_AHBTHRRATIO_V  0x00000003U
#define USB_OTGFS_DTHRCTL_AHBTHRRATIO_S  11
/** USB_OTGFS_DTHRCTL_RXTHREN : R/W; bitpos: [16]; default: 0;
 *  Receive Threshold Enable (RxThrEn)
 *
 *  When this bit is set, the core enables thresholding in the receive direction.
 *
 *  Note: We recommends that you do not enable RxThrEn, because it may cause issues in
 *  the RxFIFO especially during error conditions such as RxError and Babble.
 */
#define USB_OTGFS_DTHRCTL_RXTHREN    (BIT(16))
#define USB_OTGFS_DTHRCTL_RXTHREN_M  (USB_OTGFS_DTHRCTL_RXTHREN_V << USB_OTGFS_DTHRCTL_RXTHREN_S)
#define USB_OTGFS_DTHRCTL_RXTHREN_V  0x00000001U
#define USB_OTGFS_DTHRCTL_RXTHREN_S  16
/** USB_OTGFS_DTHRCTL_RXTHRLEN : R/W; bitpos: [25:17]; default: 8;
 *  Receive Threshold Length (RxThrLen)
 *
 *  This field specifies Receive thresholding size in DWORDS.
 *  This field also specifies the amount of data received on the USB before the core
 *  can start transmitting on the AHB.
 *  The threshold length has to be at least eight DWORDS.
 *  The recommended value for ThrLen is to be the same as the programmed
 *  AHB Burst Length (GAHBCFG.HBstLen).
 */
#define USB_OTGFS_DTHRCTL_RXTHRLEN    0x000001FFU
#define USB_OTGFS_DTHRCTL_RXTHRLEN_M  (USB_OTGFS_DTHRCTL_RXTHRLEN_V << USB_OTGFS_DTHRCTL_RXTHRLEN_S)
#define USB_OTGFS_DTHRCTL_RXTHRLEN_V  0x000001FFU
#define USB_OTGFS_DTHRCTL_RXTHRLEN_S  17
/** USB_OTGFS_DTHRCTL_ARBPRKEN : R/W; bitpos: [27]; default: 1;
 *  Arbiter Parking Enable (ArbPrkEn)
 *
 *  This bit controls internal DMA arbiter parking for IN endpoints. If thresholding is
 *  enabled and this bit is set to one, then the arbiter parks on the IN endpoint for
 *  which there is a token received on the USB. This is done to avoid getting into
 *  underrun conditions. By default, arbiter parking is enabled.
 */
#define USB_OTGFS_DTHRCTL_ARBPRKEN    (BIT(27))
#define USB_OTGFS_DTHRCTL_ARBPRKEN_M  (USB_OTGFS_DTHRCTL_ARBPRKEN_V << USB_OTGFS_DTHRCTL_ARBPRKEN_S)
#define USB_OTGFS_DTHRCTL_ARBPRKEN_V  0x00000001U
#define USB_OTGFS_DTHRCTL_ARBPRKEN_S  27

/** USB_OTGFS_DIEPEMPMSK_REG register
 *  Device IN Endpoint FIFO Empty Interrupt Mask Register This register is valid only
 *  in Dedicated FIFO operation (OTG_EN_DED_TX_FIFO = 1). This register is used to
 *  control the IN endpoint FIFO empty interrupt generation (DIEPINTn.TxfEmp).
 */
#define USB_OTGFS_DIEPEMPMSK_REG(i) (DR_REG_USB_BASE(i) + 0x834)
/** USB_OTGFS_DIEPEMPMSK_INEPTXFEMPMSK : R/W; bitpos: [15:0]; default: 0;
 *  IN EP Tx FIFO Empty Interrupt Mask Bits (InEpTxfEmpMsk)
 *
 *  These bits acts as mask bits for DIEPINTn.TxFEmp interrupt, one bit per IN Endpoint:
 *
 *  Bit 0 for IN EP 0, bit 15 for IN EP 15
 */
#define USB_OTGFS_DIEPEMPMSK_INEPTXFEMPMSK    0x0000FFFFU
#define USB_OTGFS_DIEPEMPMSK_INEPTXFEMPMSK_M  (USB_OTGFS_DIEPEMPMSK_INEPTXFEMPMSK_V << USB_OTGFS_DIEPEMPMSK_INEPTXFEMPMSK_S)
#define USB_OTGFS_DIEPEMPMSK_INEPTXFEMPMSK_V  0x0000FFFFU
#define USB_OTGFS_DIEPEMPMSK_INEPTXFEMPMSK_S  0

/** USB_OTGFS_DIEPCTL0_REG register
 *  Device Control IN Endpoint 0 Control Register
 */
#define USB_OTGFS_DIEPCTL0_REG(i) (DR_REG_USB_BASE(i) + 0x900)
/** USB_OTGFS_DIEPCTL0_MPS : R/W; bitpos: [1:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  The application must program this field with the maximum packet size for the
 *  current logical endpoint.
 *  - 2'b00: 64 bytes
 *  - 2'b01: 32 bytes
 *  - 2'b10: 16 bytes
 *  - 2'b11: 8 bytes
 */
#define USB_OTGFS_DIEPCTL0_MPS    0x00000003U
#define USB_OTGFS_DIEPCTL0_MPS_M  (USB_OTGFS_DIEPCTL0_MPS_V << USB_OTGFS_DIEPCTL0_MPS_S)
#define USB_OTGFS_DIEPCTL0_MPS_V  0x00000003U
#define USB_OTGFS_DIEPCTL0_MPS_S  0
/** USB_OTGFS_DIEPCTL0_USBACTEP : RO; bitpos: [15]; default: 1;
 *  USB Active Endpoint (USBActEP)
 *
 *  This bit is always SET to 1, indicating that control endpoint 0 is always active in
 *  all configurations and interfaces.
 */
#define USB_OTGFS_DIEPCTL0_USBACTEP    (BIT(15))
#define USB_OTGFS_DIEPCTL0_USBACTEP_M  (USB_OTGFS_DIEPCTL0_USBACTEP_V << USB_OTGFS_DIEPCTL0_USBACTEP_S)
#define USB_OTGFS_DIEPCTL0_USBACTEP_V  0x00000001U
#define USB_OTGFS_DIEPCTL0_USBACTEP_S  15
/** USB_OTGFS_DIEPCTL0_NAKSTS : RO; bitpos: [17]; default: 0;
 *  NAK Status (NAKSts)
 *
 *  Indicates the following:
 *  - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status
 *  - 1'b1: The core is transmitting NAK handshakes on this endpoint.
 *  When this bit is set, either by the application or core, the core stops
 *  transmitting data, even If there is data available in the TxFIFO.
 *  Irrespective of this bit's setting, the core always responds to SETUP data
 *  packets with an ACK handshake.
 */
#define USB_OTGFS_DIEPCTL0_NAKSTS    (BIT(17))
#define USB_OTGFS_DIEPCTL0_NAKSTS_M  (USB_OTGFS_DIEPCTL0_NAKSTS_V << USB_OTGFS_DIEPCTL0_NAKSTS_S)
#define USB_OTGFS_DIEPCTL0_NAKSTS_V  0x00000001U
#define USB_OTGFS_DIEPCTL0_NAKSTS_S  17
/** USB_OTGFS_DIEPCTL0_EPTYPE : RO; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *
 *  Hardcoded to 00 for control.
 */
#define USB_OTGFS_DIEPCTL0_EPTYPE    0x00000003U
#define USB_OTGFS_DIEPCTL0_EPTYPE_M  (USB_OTGFS_DIEPCTL0_EPTYPE_V << USB_OTGFS_DIEPCTL0_EPTYPE_S)
#define USB_OTGFS_DIEPCTL0_EPTYPE_V  0x00000003U
#define USB_OTGFS_DIEPCTL0_EPTYPE_S  18
/** USB_OTGFS_DIEPCTL0_STALL : R/W; bitpos: [21]; default: 0;
 *  STALL Handshake (Stall)
 *
 *  The application can only set this bit, and the core clears it, when a
 *  SETUP token is received for this endpoint. If a NAK bit, Global Nonperiodic
 *  IN NAK, or Global OUT NAK is set along with this bit, the STALL
 *  bit takes priority.
 */
#define USB_OTGFS_DIEPCTL0_STALL    (BIT(21))
#define USB_OTGFS_DIEPCTL0_STALL_M  (USB_OTGFS_DIEPCTL0_STALL_V << USB_OTGFS_DIEPCTL0_STALL_S)
#define USB_OTGFS_DIEPCTL0_STALL_V  0x00000001U
#define USB_OTGFS_DIEPCTL0_STALL_S  21
/** USB_OTGFS_DIEPCTL0_TXFNUM : R/W; bitpos: [25:22]; default: 0;
 *  TxFIFO Number (TxFNum)
 *  - For Shared FIFO operation, this value is always set to 0, indicating that control
 *  IN endpoint 0 data is always written in the Non-Periodic Transmit FIFO.
 *  - For Dedicated FIFO operation, this value is set to the FIFO number that is
 *  assigned to IN Endpoint.
 */
#define USB_OTGFS_DIEPCTL0_TXFNUM    0x0000000FU
#define USB_OTGFS_DIEPCTL0_TXFNUM_M  (USB_OTGFS_DIEPCTL0_TXFNUM_V << USB_OTGFS_DIEPCTL0_TXFNUM_S)
#define USB_OTGFS_DIEPCTL0_TXFNUM_V  0x0000000FU
#define USB_OTGFS_DIEPCTL0_TXFNUM_S  22
/** USB_OTGFS_DIEPCTL0_CNAK : R/W; bitpos: [26]; default: 0;
 *
 *  Clear NAK (CNAK)
 *  A write to this bit clears the NAK bit for the endpoint.
 */
#define USB_OTGFS_DIEPCTL0_CNAK    (BIT(26))
#define USB_OTGFS_DIEPCTL0_CNAK_M  (USB_OTGFS_DIEPCTL0_CNAK_V << USB_OTGFS_DIEPCTL0_CNAK_S)
#define USB_OTGFS_DIEPCTL0_CNAK_V  0x00000001U
#define USB_OTGFS_DIEPCTL0_CNAK_S  26
/** USB_OTGFS_DIEPCTL0_SNAK : R/W; bitpos: [27]; default: 0;
 *
 *  Set NAK (SNAK)
 *  A write to this bit sets the NAK bit for the endpoint.
 *  Using this bit, the application can control the transmission of NAK
 *  handshakes on an endpoint. The core can also set this bit for an
 *  endpoint after a SETUP packet is received on that endpoint.
 */
#define USB_OTGFS_DIEPCTL0_SNAK    (BIT(27))
#define USB_OTGFS_DIEPCTL0_SNAK_M  (USB_OTGFS_DIEPCTL0_SNAK_V << USB_OTGFS_DIEPCTL0_SNAK_S)
#define USB_OTGFS_DIEPCTL0_SNAK_V  0x00000001U
#define USB_OTGFS_DIEPCTL0_SNAK_S  27
/** USB_OTGFS_DIEPCTL0_EPDIS : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable (EPDis)
 *
 *  The application sets this bit to stop transmitting data on an endpoint,
 *  even before the transfer for that endpoint is complete. The application
 *  must wait for the Endpoint Disabled interrupt before treating the endpoint
 *  as disabled. The core clears this bit before setting the Endpoint Disabled
 *  Interrupt. The application must Set this bit only if Endpoint Enable is
 *  already set for this endpoint.
 */
#define USB_OTGFS_DIEPCTL0_EPDIS    (BIT(30))
#define USB_OTGFS_DIEPCTL0_EPDIS_M  (USB_OTGFS_DIEPCTL0_EPDIS_V << USB_OTGFS_DIEPCTL0_EPDIS_S)
#define USB_OTGFS_DIEPCTL0_EPDIS_V  0x00000001U
#define USB_OTGFS_DIEPCTL0_EPDIS_S  30
/** USB_OTGFS_DIEPCTL0_EPENA : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable (EPEna)
 *
 *  When Scatter/Gather DMA mode is enabled for IN endpoints, this bit indicates that
 *  the descriptor structure and data buffer with data ready to transmit is setup.
 *
 *  When Scatter/Gather DMA mode is disabled (such as in buffer pointer based DMA mode)
 *  this bit indicates that data is ready to be transmitted on the endpoint.
 *  The core clears this bit before setting the following interrupts on this endpoint:
 *  - Endpoint Disabled
 *  - Transfer Completed
 */
#define USB_OTGFS_DIEPCTL0_EPENA    (BIT(31))
#define USB_OTGFS_DIEPCTL0_EPENA_M  (USB_OTGFS_DIEPCTL0_EPENA_V << USB_OTGFS_DIEPCTL0_EPENA_S)
#define USB_OTGFS_DIEPCTL0_EPENA_V  0x00000001U
#define USB_OTGFS_DIEPCTL0_EPENA_S  31

