espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_DIEPTSIZ0_REG register
 *  Device IN Endpoint 0 Transfer Size Register   The application must modify this
 *  register before enabling endpoint 0. Once endpoint 0 is enabled using Endpoint
 *  Enable bit of the Device Control Endpoint 0 Control registers
 *  (DIEPCTL0.EPEna/DOEPCTL0.EPEna), the core modifies this register. The application
 *  can only read this register once the core has cleared the Endpoint Enable bit.
 *  Nonzero endpoints use the registers for endpoints 115. When Scatter/Gather DMA mode
 *  is enabled, this register must not be programmed by the application. If the
 *  application reads this register when Scatter/Gather DMA mode is enabled, the core
 *  returns all zeros.
 */
#define USB_OTGFS_DIEPTSIZ0_REG(i) (DR_REG_USB_BASE(i) + 0x910)
/** USB_OTGFS_DIEPTSIZ0_XFERSIZE : R/W; bitpos: [6:0]; default: 0;
 *  Transfer Size (XferSize)
 *
 *  This field contains the transfer size in bytes for the current endpoint. The
 *  transfer size (XferSize) = Sum of buffer sizes across all descriptors in the list
 *  for the endpoint.
 *  In Buffer DMA, the core only interrupts the application after it has exhausted the
 *  transfer size amount of data. The transfer size can be set to the maximum packet
 *  size of the endpoint, to be interrupted at the end of each packet.
 *  - IN Endpoints: The core decrements this field every time a packet from the
 *  external memory is written to the TxFIFO.
 *  - OUT Endpoints: The core decrements this field every time a packet is read from
 *  the RxFIFO and written to the external memory.
 */
#define USB_OTGFS_DIEPTSIZ0_XFERSIZE    0x0000007FU
#define USB_OTGFS_DIEPTSIZ0_XFERSIZE_M  (USB_OTGFS_DIEPTSIZ0_XFERSIZE_V << USB_OTGFS_DIEPTSIZ0_XFERSIZE_S)
#define USB_OTGFS_DIEPTSIZ0_XFERSIZE_V  0x0000007FU
#define USB_OTGFS_DIEPTSIZ0_XFERSIZE_S  0
/** USB_OTGFS_DIEPTSIZ0_PKTCNT : R/W; bitpos: [20:19]; default: 0;
 *  Packet Count (PktCnt)
 *
 *  Indicates the total number of USB packets that constitute the
 *
 *  Transfer Size amount of data for endpoint 0.
 *  - IN Endpoints : This field is decremented every time a packet (maximum size or
 *  short packet) is read from the TxFIFO.
 *  - OUT Endpoints: This field is decremented every time a packet (maximum size or
 *  short packet) is written to the RxFIFO.
 */
#define USB_OTGFS_DIEPTSIZ0_PKTCNT    0x00000003U
#define USB_OTGFS_DIEPTSIZ0_PKTCNT_M  (USB_OTGFS_DIEPTSIZ0_PKTCNT_V << USB_OTGFS_DIEPTSIZ0_PKTCNT_S)
#define USB_OTGFS_DIEPTSIZ0_PKTCNT_V  0x00000003U
#define USB_OTGFS_DIEPTSIZ0_PKTCNT_S  19

/** USB_OTGFS_DIEPDMA0_REG register
 *  Device IN Endpoint 0 DMA Address Register
 */
#define USB_OTGFS_DIEPDMA0_REG(i) (DR_REG_USB_BASE(i) + 0x914)
/** USB_OTGFS_DIEPDMA0_DMAADDR : R/W; bitpos: [31:0]; default: 0;
 *  DMAAddr
 *
 *  This field holds the start address of the external memory for storing or fetching
 *  endpoint data.
 *
 *  Note: For control endpoints, this field stores control OUT data packets as well as
 *  SETUP transaction data packets. When more than three SETUP packets are
 *  received back-to-back, the SETUP data packet in the memory is overwritten.
 *
 *  This register is incremented on every AHB transaction. The application can give
 *  only a DWORD-aligned address.
 *
 *  When Scatter/Gather DMA mode is not enabled, the application programs the start
 *  address value in this field.
 *
 *  When Scatter/Gather DMA mode is enabled, this field indicates the base pointer for
 *  the descriptor list.
 */
#define USB_OTGFS_DIEPDMA0_DMAADDR    0xFFFFFFFFU
#define USB_OTGFS_DIEPDMA0_DMAADDR_M  (USB_OTGFS_DIEPDMA0_DMAADDR_V << USB_OTGFS_DIEPDMA0_DMAADDR_S)
#define USB_OTGFS_DIEPDMA0_DMAADDR_V  0xFFFFFFFFU
#define USB_OTGFS_DIEPDMA0_DMAADDR_S  0

/** USB_OTGFS_DTXFSTS0_REG register
 *  Device IN Endpoint Transmit FIFO Status Register 0
 */
#define USB_OTGFS_DTXFSTS0_REG(i) (DR_REG_USB_BASE(i) + 0x918)
/** USB_OTGFS_DTXFSTS0_INEPTXFSPCAVAIL : RO; bitpos: [15:0]; default: 256;
 *  IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail)
 *
 *  Indicates the amount of free space available in the Endpoint TxFIFO.
 *
 *  Values are in terms of 32-bit words.
 *  - 16'h0: Endpoint TxFIFO is full
 *  - 16'h1: 1 word available
 *  - 16'h2: 2 words available
 *  - 16'hn: n words available (where 0  n  32,768)
 *  - 16'h8000: 32,768 words available
 *  - Others: Reserved
 */
#define USB_OTGFS_DTXFSTS0_INEPTXFSPCAVAIL    0x0000FFFFU
#define USB_OTGFS_DTXFSTS0_INEPTXFSPCAVAIL_M  (USB_OTGFS_DTXFSTS0_INEPTXFSPCAVAIL_V << USB_OTGFS_DTXFSTS0_INEPTXFSPCAVAIL_S)
#define USB_OTGFS_DTXFSTS0_INEPTXFSPCAVAIL_V  0x0000FFFFU
#define USB_OTGFS_DTXFSTS0_INEPTXFSPCAVAIL_S  0

/** USB_OTGFS_DIEPDMAB0_REG register
 *  Device IN Endpoint 16 Buffer Address Register
 */
#define USB_OTGFS_DIEPDMAB0_REG(i) (DR_REG_USB_BASE(i) + 0x91c)
/** USB_OTGFS_DIEPDMAB0_DMABUFFERADDR : RO; bitpos: [31:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress.
 *
 *  This register is present only in Scatter/Gather DMA mode. Otherwise this field is
 *  reserved.
 */
#define USB_OTGFS_DIEPDMAB0_DMABUFFERADDR    0xFFFFFFFFU
#define USB_OTGFS_DIEPDMAB0_DMABUFFERADDR_M  (USB_OTGFS_DIEPDMAB0_DMABUFFERADDR_V << USB_OTGFS_DIEPDMAB0_DMABUFFERADDR_S)
#define USB_OTGFS_DIEPDMAB0_DMABUFFERADDR_V  0xFFFFFFFFU
#define USB_OTGFS_DIEPDMAB0_DMABUFFERADDR_S  0

/** USB_OTGFS_DIEPCTL1_REG register
 *  Device Control IN Endpoint 1 Control Register  Note: This register exists for an
 *  endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGFS_DIEPCTL1_REG(i) (DR_REG_USB_BASE(i) + 0x920)
/** USB_OTGFS_DIEPCTL1_MPS : R/W; bitpos: [10:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  The application must program this field with the maximum packet size for the
 *  current logical endpoint. This value is in bytes.
 */
#define USB_OTGFS_DIEPCTL1_MPS    0x000007FFU
#define USB_OTGFS_DIEPCTL1_MPS_M  (USB_OTGFS_DIEPCTL1_MPS_V << USB_OTGFS_DIEPCTL1_MPS_S)
#define USB_OTGFS_DIEPCTL1_MPS_V  0x000007FFU
#define USB_OTGFS_DIEPCTL1_MPS_S  0
/** USB_OTGFS_DIEPCTL1_USBACTEP : R/W; bitpos: [15]; default: 0;
 *  USB Active Endpoint (USBActEP)
 *
 *  Indicates whether this endpoint is active in the current configuration and
 *  interface. The
 *  core clears this bit for all endpoints (other than EP 0) after detecting a USB
 *  reset. After
 *  receiving the SetConfiguration and SetInterface commands, the application must
 *  program endpoint registers accordingly and set this bit.
 */
#define USB_OTGFS_DIEPCTL1_USBACTEP    (BIT(15))
#define USB_OTGFS_DIEPCTL1_USBACTEP_M  (USB_OTGFS_DIEPCTL1_USBACTEP_V << USB_OTGFS_DIEPCTL1_USBACTEP_S)
#define USB_OTGFS_DIEPCTL1_USBACTEP_V  0x00000001U
#define USB_OTGFS_DIEPCTL1_USBACTEP_S  15
/** USB_OTGFS_DIEPCTL1_DPID : RO; bitpos: [16]; default: 0;
 *
 *  Endpoint Data PID (DPID)
 *
 *  Applies to interrupt/bulk IN and OUT endpoints only.
 *
 *  Contains the PID of the packet to be received or transmitted on this endpoint. The
 *  application must program the PID of the first packet to be received or transmitted
 *  on
 *  this endpoint, after the endpoint is activated. The applications use the SetD1PID
 *  and
 *  SetD0PID fields of this register to program either DATA0 or DATA1 PID.
 *  - 1'b0: DATA0
 *  - 1'b1: DATA1
 *  This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather
 *  DMA mode.
 *
 *  Even/Odd (Micro)Frame (EO_FrNum)
 *
 *  In non-Scatter/Gather DMA mode:
 *
 *  Applies to isochronous IN and OUT endpoints only.
 *
 *  Indicates the (micro)frame number in which the core transmits/receives isochronous
 *  data for this endpoint. The application must program the even/odd (micro)frame
 *  number in which it intends to transmit/receive isochronous data for this endpoint
 *  using
 *  the SetEvnFr and SetOddFr fields in this register.
 *  - 1'b0: Even (micro)frame
 *  - 1'b1: Odd (micro)frame
 *  When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
 *  in which to send data is provided in the transmit descriptor structure. The frame in
 *  which data is received is updated in receive descriptor structure.
 */
#define USB_OTGFS_DIEPCTL1_DPID    (BIT(16))
#define USB_OTGFS_DIEPCTL1_DPID_M  (USB_OTGFS_DIEPCTL1_DPID_V << USB_OTGFS_DIEPCTL1_DPID_S)
#define USB_OTGFS_DIEPCTL1_DPID_V  0x00000001U
#define USB_OTGFS_DIEPCTL1_DPID_S  16
/** USB_OTGFS_DIEPCTL1_NAKSTS : RO; bitpos: [17]; default: 0;
 *  NAK Status (NAKSts)
 *
 *  Indicates the following:
 *  - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status.
 *  - 1'b1: The core is transmitting NAK handshakes on this endpoint.
 *  When either the application or the core sets this bit:
 *  - The core stops receiving any data on an OUT endpoint, even if there is space in
 *  the RxFIFO to accommodate the incoming packet.
 *  - For non-isochronous IN endpoints: The core stops transmitting any data on an IN
 *  endpoint, even if there data is available in the TxFIFO.
 *  - For isochronous IN endpoints: The core sends out a zero-length data packet, even
 *  if there data is available in the TxFIFO.
 *  Irrespective of this bit's setting, the core always responds to SETUP data packets
 *  with an ACK handshake.
 */
#define USB_OTGFS_DIEPCTL1_NAKSTS    (BIT(17))
#define USB_OTGFS_DIEPCTL1_NAKSTS_M  (USB_OTGFS_DIEPCTL1_NAKSTS_V << USB_OTGFS_DIEPCTL1_NAKSTS_S)
#define USB_OTGFS_DIEPCTL1_NAKSTS_V  0x00000001U
#define USB_OTGFS_DIEPCTL1_NAKSTS_S  17
/** USB_OTGFS_DIEPCTL1_EPTYPE : R/W; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *  This is the transfer type supported by this logical endpoint.
 *  - 2'b00: Control
 *  - 2'b01: Isochronous
 *  - 2'b10: Bulk
 *  - 2'b11: Interrupt
 */
#define USB_OTGFS_DIEPCTL1_EPTYPE    0x00000003U
#define USB_OTGFS_DIEPCTL1_EPTYPE_M  (USB_OTGFS_DIEPCTL1_EPTYPE_V << USB_OTGFS_DIEPCTL1_EPTYPE_S)
#define USB_OTGFS_DIEPCTL1_EPTYPE_V  0x00000003U
#define USB_OTGFS_DIEPCTL1_EPTYPE_S  18
/** USB_OTGFS_DIEPCTL1_STALL : R/W; bitpos: [21]; default: 0;
 *  STALL Handshake (Stall)
 *
 *  Applies to non-control, non-isochronous IN and OUT endpoints only.
 *
 *  The application sets this bit to stall all tokens from the USB host to this
 *  endpoint. If a
 *  NAK bit, Global Non-periodic IN NAK, or Global OUT NAK is set along with this bit,
 *  the
 *  STALL bit takes priority. Only the application can clear this bit, never the core.
 *
 *  Applies to control endpoints only.
 *
 *  The application can only set this bit, and the core clears it, when a SETUP token is
 *  received for this endpoint. If a NAK bit, Global Non-periodic IN NAK, or Global OUT
 *  NAK is set along with this bit, the STALL bit takes priority. Irrespective of this
 *  bit's
 *  setting, the core always responds to SETUP data packets with an ACK handshake.
 */
#define USB_OTGFS_DIEPCTL1_STALL    (BIT(21))
#define USB_OTGFS_DIEPCTL1_STALL_M  (USB_OTGFS_DIEPCTL1_STALL_V << USB_OTGFS_DIEPCTL1_STALL_S)
#define USB_OTGFS_DIEPCTL1_STALL_V  0x00000001U
#define USB_OTGFS_DIEPCTL1_STALL_S  21
/** USB_OTGFS_DIEPCTL1_TXFNUM : R/W; bitpos: [25:22]; default: 0;
 *  TxFIFO Number (TxFNum)
 *
 *  Shared FIFO Operation non-periodic endpoints must set this bit to zero. Periodic
 *  endpoints must map this to the corresponding Periodic TxFIFO number.
 *  - 4'h0: Non-Periodic TxFIFO
 *  - Others: Specified Periodic TxFIFO.number
 *  Note: An interrupt IN endpoint can be configured as a non-periodic endpoint for
 *  applications such as mass storage. The core treats an IN endpoint as a non-periodic
 *  endpoint if the TxFNum field is set to 0. Otherwise, a separate periodic FIFO must
 *  be
 *  allocated for an interrupt IN endpoint, and the number of this
 *  FIFO must be programmed into the TxFNum field. Configuring an interrupt IN
 *  endpoint as a non-periodic endpoint saves the extra periodic FIFO area.
 *
 *  Dedicated FIFO Operation: These bits specify the FIFO number associated with this
 *  endpoint. Each active IN endpoint must be programmed to a separate FIFO number.
 *  This field is valid only for IN endpoints.
 */
#define USB_OTGFS_DIEPCTL1_TXFNUM    0x0000000FU
#define USB_OTGFS_DIEPCTL1_TXFNUM_M  (USB_OTGFS_DIEPCTL1_TXFNUM_V << USB_OTGFS_DIEPCTL1_TXFNUM_S)
#define USB_OTGFS_DIEPCTL1_TXFNUM_V  0x0000000FU
#define USB_OTGFS_DIEPCTL1_TXFNUM_S  22
/** USB_OTGFS_DIEPCTL1_CNAK : R/W; bitpos: [26]; default: 0;
 *  Clear NAK (CNAK)
 *
 *  A write to this bit clears the NAK bit for the endpoint.
 */
#define USB_OTGFS_DIEPCTL1_CNAK    (BIT(26))
#define USB_OTGFS_DIEPCTL1_CNAK_M  (USB_OTGFS_DIEPCTL1_CNAK_V << USB_OTGFS_DIEPCTL1_CNAK_S)
#define USB_OTGFS_DIEPCTL1_CNAK_V  0x00000001U
#define USB_OTGFS_DIEPCTL1_CNAK_S  26
/** USB_OTGFS_DIEPCTL1_SNAK : R/W; bitpos: [27]; default: 0;
 *  Set NAK (SNAK)
 *
 *  A write to this bit sets the NAK bit for the endpoint.
 *
 *  Using this bit, the application can control the transmission of NAK handshakes on
 *  an endpoint. The core can also Set this bit for an endpoint after a SETUP packet is
 *  received on that endpoint.
 */
#define USB_OTGFS_DIEPCTL1_SNAK    (BIT(27))
#define USB_OTGFS_DIEPCTL1_SNAK_M  (USB_OTGFS_DIEPCTL1_SNAK_V << USB_OTGFS_DIEPCTL1_SNAK_S)
#define USB_OTGFS_DIEPCTL1_SNAK_V  0x00000001U
#define USB_OTGFS_DIEPCTL1_SNAK_S  27
/** USB_OTGFS_DIEPCTL1_SETD0PID : R/W; bitpos: [28]; default: 0;
 *  SetD0PID
 *  - Set DATA0 PID (SetD0PID)
 *  -- Applies to interrupt/bulk IN and OUT endpoints only.
 *  -- Writing to this field sets the Endpoint Data PID (DPID) field in this register
 *  to DATA0.
 *  -- This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather
 *  DMA mode.
 *  In non-Scatter/Gather DMA mode: Set Even (micro)Frame (SetEvenFr)
 *  -- Applies to isochronous IN and OUT endpoints only.
 *  -- Writing to this field sets the Even/Odd (micro)Frame (EO_FrNum) field to even
 *  (micro)Frame.
 *  When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
 *  in which to send data is in the transmit descriptor structure. The frame in which to
 *  receive data is updated in receive descriptor structure.
 */
#define USB_OTGFS_DIEPCTL1_SETD0PID    (BIT(28))
#define USB_OTGFS_DIEPCTL1_SETD0PID_M  (USB_OTGFS_DIEPCTL1_SETD0PID_V << USB_OTGFS_DIEPCTL1_SETD0PID_S)
#define USB_OTGFS_DIEPCTL1_SETD0PID_V  0x00000001U
#define USB_OTGFS_DIEPCTL1_SETD0PID_S  28
/** USB_OTGFS_DIEPCTL1_SETD1PID : R/W; bitpos: [29]; default: 0;
 *  SetD1PID
 *  - Set DATA1 PID (SetD1PID)
 *  -- Applies to interrupt and bulk IN and OUT endpoints only.
 *  -- Writing to this field sets the Endpoint Data PID (DPID) field in this register
 *  to DATA1.
 *  -- This field is applicable both for Scatter-Gather DMA mode and non Scatter-Gather
 *  DMA mode.
 *  - Set odd (micro)Frame (SetOddFr)
 *  -- Applies to isochronous IN and OUT endpoints only.
 *  -- Writing to this field sets the even and odd (micro)Frame (EO_FrNum) field to odd
 *  (micro)Frame.
 *  -- This field is not applicable for Scatter-Gather DMA mode.
 */
#define USB_OTGFS_DIEPCTL1_SETD1PID    (BIT(29))
#define USB_OTGFS_DIEPCTL1_SETD1PID_M  (USB_OTGFS_DIEPCTL1_SETD1PID_V << USB_OTGFS_DIEPCTL1_SETD1PID_S)
#define USB_OTGFS_DIEPCTL1_SETD1PID_V  0x00000001U
#define USB_OTGFS_DIEPCTL1_SETD1PID_S  29
/** USB_OTGFS_DIEPCTL1_EPDIS : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable (EPDis)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  The application sets this bit to stop transmitting/receiving data on an endpoint,
 *  even
 *  before the transfer for that endpoint is complete. The application must wait for the
 *  Endpoint Disabled interrupt before treating the endpoint as disabled. The core
 *  clears
 *  this bit before setting the Endpoint Disabled interrupt. The application must set
 *  this bit
 *  only if Endpoint Enable is already set for this endpoint.
 */
#define USB_OTGFS_DIEPCTL1_EPDIS    (BIT(30))
#define USB_OTGFS_DIEPCTL1_EPDIS_M  (USB_OTGFS_DIEPCTL1_EPDIS_V << USB_OTGFS_DIEPCTL1_EPDIS_S)
#define USB_OTGFS_DIEPCTL1_EPDIS_V  0x00000001U
#define USB_OTGFS_DIEPCTL1_EPDIS_S  30
/** USB_OTGFS_DIEPCTL1_EPENA : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable (EPEna)
 *
 *  Applies to IN and OUT endpoints.
 *  - When Scatter/Gather DMA mode is enabled,
 *  -- For IN endpoints this bit indicates that the descriptor structure and data
 *  buffer with data ready to transmit is setup.
 *  -- For OUT endpoint it indicates that the descriptor structure and data buffer to
 *  receive data is setup.
 *  - When Scatter/Gather DMA mode is enabled such as for buffer-pointer based DMA mode:
 *  -- For IN endpoints, this bit indicates that data is ready to be transmitted on the
 *  endpoint.
 *  -- For OUT endpoints, this bit indicates that the application has allocated the
 *  memory to start receiving data from the USB.
 *  - The core clears this bit before setting any of the following interrupts on this
 *  endpoint:
 *  -- SETUP Phase Done
 *  -- Endpoint Disabled
 *  -- Transfer Completed
 *  Note: For control endpoints in DMA mode, this bit must be set to be able to
 *  transfer SETUP data packets in memory.
 */
#define USB_OTGFS_DIEPCTL1_EPENA    (BIT(31))
#define USB_OTGFS_DIEPCTL1_EPENA_M  (USB_OTGFS_DIEPCTL1_EPENA_V << USB_OTGFS_DIEPCTL1_EPENA_S)
#define USB_OTGFS_DIEPCTL1_EPENA_V  0x00000001U
#define USB_OTGFS_DIEPCTL1_EPENA_S  31

