espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_DIEPCTL2_REG register
 *  Device Control IN Endpoint 2 Control Register  Note: This register exists for an
 *  endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGFS_DIEPCTL2_REG(i) (DR_REG_USB_BASE(i) + 0x940)
/** USB_OTGFS_DIEPCTL2_MPS : R/W; bitpos: [10:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  The application must program this field with the maximum packet size for the
 *  current logical endpoint. This value is in bytes.
 */
#define USB_OTGFS_DIEPCTL2_MPS    0x000007FFU
#define USB_OTGFS_DIEPCTL2_MPS_M  (USB_OTGFS_DIEPCTL2_MPS_V << USB_OTGFS_DIEPCTL2_MPS_S)
#define USB_OTGFS_DIEPCTL2_MPS_V  0x000007FFU
#define USB_OTGFS_DIEPCTL2_MPS_S  0
/** USB_OTGFS_DIEPCTL2_USBACTEP : R/W; bitpos: [15]; default: 0;
 *  USB Active Endpoint (USBActEP)
 *
 *  Indicates whether this endpoint is active in the current configuration and
 *  interface. The
 *  core clears this bit for all endpoints (other than EP 0) after detecting a USB
 *  reset. After
 *  receiving the SetConfiguration and SetInterface commands, the application must
 *  program endpoint registers accordingly and set this bit.
 */
#define USB_OTGFS_DIEPCTL2_USBACTEP    (BIT(15))
#define USB_OTGFS_DIEPCTL2_USBACTEP_M  (USB_OTGFS_DIEPCTL2_USBACTEP_V << USB_OTGFS_DIEPCTL2_USBACTEP_S)
#define USB_OTGFS_DIEPCTL2_USBACTEP_V  0x00000001U
#define USB_OTGFS_DIEPCTL2_USBACTEP_S  15
/** USB_OTGFS_DIEPCTL2_DPID : RO; bitpos: [16]; default: 0;
 *
 *  Endpoint Data PID (DPID)
 *
 *  Applies to interrupt/bulk IN and OUT endpoints only.
 *
 *  Contains the PID of the packet to be received or transmitted on this endpoint. The
 *  application must program the PID of the first packet to be received or transmitted
 *  on
 *  this endpoint, after the endpoint is activated. The applications use the SetD1PID
 *  and
 *  SetD0PID fields of this register to program either DATA0 or DATA1 PID.
 *  - 1'b0: DATA0
 *  - 1'b1: DATA1
 *  This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather
 *  DMA mode.
 *
 *  Even/Odd (Micro)Frame (EO_FrNum)
 *
 *  In non-Scatter/Gather DMA mode:
 *
 *  Applies to isochronous IN and OUT endpoints only.
 *
 *  Indicates the (micro)frame number in which the core transmits/receives isochronous
 *  data for this endpoint. The application must program the even/odd (micro)frame
 *  number in which it intends to transmit/receive isochronous data for this endpoint
 *  using
 *  the SetEvnFr and SetOddFr fields in this register.
 *  - 1'b0: Even (micro)frame
 *  - 1'b1: Odd (micro)frame
 *  When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
 *  in which to send data is provided in the transmit descriptor structure. The frame in
 *  which data is received is updated in receive descriptor structure.
 */
#define USB_OTGFS_DIEPCTL2_DPID    (BIT(16))
#define USB_OTGFS_DIEPCTL2_DPID_M  (USB_OTGFS_DIEPCTL2_DPID_V << USB_OTGFS_DIEPCTL2_DPID_S)
#define USB_OTGFS_DIEPCTL2_DPID_V  0x00000001U
#define USB_OTGFS_DIEPCTL2_DPID_S  16
/** USB_OTGFS_DIEPCTL2_NAKSTS : RO; bitpos: [17]; default: 0;
 *  NAK Status (NAKSts)
 *
 *  Indicates the following:
 *  - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status.
 *  - 1'b1: The core is transmitting NAK handshakes on this endpoint.
 *  When either the application or the core sets this bit:
 *  - The core stops receiving any data on an OUT endpoint, even if there is space in
 *  the RxFIFO to accommodate the incoming packet.
 *  - For non-isochronous IN endpoints: The core stops transmitting any data on an IN
 *  endpoint, even if there data is available in the TxFIFO.
 *  - For isochronous IN endpoints: The core sends out a zero-length data packet, even
 *  if there data is available in the TxFIFO.
 *  Irrespective of this bit's setting, the core always responds to SETUP data packets
 *  with an ACK handshake.
 */
#define USB_OTGFS_DIEPCTL2_NAKSTS    (BIT(17))
#define USB_OTGFS_DIEPCTL2_NAKSTS_M  (USB_OTGFS_DIEPCTL2_NAKSTS_V << USB_OTGFS_DIEPCTL2_NAKSTS_S)
#define USB_OTGFS_DIEPCTL2_NAKSTS_V  0x00000001U
#define USB_OTGFS_DIEPCTL2_NAKSTS_S  17
/** USB_OTGFS_DIEPCTL2_EPTYPE : R/W; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *  This is the transfer type supported by this logical endpoint.
 *  - 2'b00: Control
 *  - 2'b01: Isochronous
 *  - 2'b10: Bulk
 *  - 2'b11: Interrupt
 */
#define USB_OTGFS_DIEPCTL2_EPTYPE    0x00000003U
#define USB_OTGFS_DIEPCTL2_EPTYPE_M  (USB_OTGFS_DIEPCTL2_EPTYPE_V << USB_OTGFS_DIEPCTL2_EPTYPE_S)
#define USB_OTGFS_DIEPCTL2_EPTYPE_V  0x00000003U
#define USB_OTGFS_DIEPCTL2_EPTYPE_S  18
/** USB_OTGFS_DIEPCTL2_STALL : R/W; bitpos: [21]; default: 0;
 *  STALL Handshake (Stall)
 *
 *  Applies to non-control, non-isochronous IN and OUT endpoints only.
 *
 *  The application sets this bit to stall all tokens from the USB host to this
 *  endpoint. If a
 *  NAK bit, Global Non-periodic IN NAK, or Global OUT NAK is set along with this bit,
 *  the
 *  STALL bit takes priority. Only the application can clear this bit, never the core.
 *
 *  Applies to control endpoints only.
 *
 *  The application can only set this bit, and the core clears it, when a SETUP token is
 *  received for this endpoint. If a NAK bit, Global Non-periodic IN NAK, or Global OUT
 *  NAK is set along with this bit, the STALL bit takes priority. Irrespective of this
 *  bit's
 *  setting, the core always responds to SETUP data packets with an ACK handshake.
 */
#define USB_OTGFS_DIEPCTL2_STALL    (BIT(21))
#define USB_OTGFS_DIEPCTL2_STALL_M  (USB_OTGFS_DIEPCTL2_STALL_V << USB_OTGFS_DIEPCTL2_STALL_S)
#define USB_OTGFS_DIEPCTL2_STALL_V  0x00000001U
#define USB_OTGFS_DIEPCTL2_STALL_S  21
/** USB_OTGFS_DIEPCTL2_TXFNUM : R/W; bitpos: [25:22]; default: 0;
 *  TxFIFO Number (TxFNum)
 *
 *  Shared FIFO Operation non-periodic endpoints must set this bit to zero. Periodic
 *  endpoints must map this to the corresponding Periodic TxFIFO number.
 *  - 4'h0: Non-Periodic TxFIFO
 *  - Others: Specified Periodic TxFIFO.number
 *  Note: An interrupt IN endpoint can be configured as a non-periodic endpoint for
 *  applications such as mass storage. The core treats an IN endpoint as a non-periodic
 *  endpoint if the TxFNum field is set to 0. Otherwise, a separate periodic FIFO must
 *  be
 *  allocated for an interrupt IN endpoint, and the number of this
 *  FIFO must be programmed into the TxFNum field. Configuring an interrupt IN
 *  endpoint as a non-periodic endpoint saves the extra periodic FIFO area.
 *
 *  Dedicated FIFO Operation: These bits specify the FIFO number associated with this
 *  endpoint. Each active IN endpoint must be programmed to a separate FIFO number.
 *  This field is valid only for IN endpoints.
 */
#define USB_OTGFS_DIEPCTL2_TXFNUM    0x0000000FU
#define USB_OTGFS_DIEPCTL2_TXFNUM_M  (USB_OTGFS_DIEPCTL2_TXFNUM_V << USB_OTGFS_DIEPCTL2_TXFNUM_S)
#define USB_OTGFS_DIEPCTL2_TXFNUM_V  0x0000000FU
#define USB_OTGFS_DIEPCTL2_TXFNUM_S  22
/** USB_OTGFS_DIEPCTL2_CNAK : R/W; bitpos: [26]; default: 0;
 *  Clear NAK (CNAK)
 *
 *  A write to this bit clears the NAK bit for the endpoint.
 */
#define USB_OTGFS_DIEPCTL2_CNAK    (BIT(26))
#define USB_OTGFS_DIEPCTL2_CNAK_M  (USB_OTGFS_DIEPCTL2_CNAK_V << USB_OTGFS_DIEPCTL2_CNAK_S)
#define USB_OTGFS_DIEPCTL2_CNAK_V  0x00000001U
#define USB_OTGFS_DIEPCTL2_CNAK_S  26
/** USB_OTGFS_DIEPCTL2_SNAK : R/W; bitpos: [27]; default: 0;
 *  Set NAK (SNAK)
 *
 *  A write to this bit sets the NAK bit for the endpoint.
 *
 *  Using this bit, the application can control the transmission of NAK handshakes on
 *  an endpoint. The core can also Set this bit for an endpoint after a SETUP packet is
 *  received on that endpoint.
 */
#define USB_OTGFS_DIEPCTL2_SNAK    (BIT(27))
#define USB_OTGFS_DIEPCTL2_SNAK_M  (USB_OTGFS_DIEPCTL2_SNAK_V << USB_OTGFS_DIEPCTL2_SNAK_S)
#define USB_OTGFS_DIEPCTL2_SNAK_V  0x00000001U
#define USB_OTGFS_DIEPCTL2_SNAK_S  27
/** USB_OTGFS_DIEPCTL2_SETD0PID : R/W; bitpos: [28]; default: 0;
 *  SetD0PID
 *  - Set DATA0 PID (SetD0PID)
 *  -- Applies to interrupt/bulk IN and OUT endpoints only.
 *  -- Writing to this field sets the Endpoint Data PID (DPID) field in this register
 *  to DATA0.
 *  -- This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather
 *  DMA mode.
 *  In non-Scatter/Gather DMA mode: Set Even (micro)Frame (SetEvenFr)
 *  -- Applies to isochronous IN and OUT endpoints only.
 *  -- Writing to this field sets the Even/Odd (micro)Frame (EO_FrNum) field to even
 *  (micro)Frame.
 *  When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
 *  in which to send data is in the transmit descriptor structure. The frame in which to
 *  receive data is updated in receive descriptor structure.
 */
#define USB_OTGFS_DIEPCTL2_SETD0PID    (BIT(28))
#define USB_OTGFS_DIEPCTL2_SETD0PID_M  (USB_OTGFS_DIEPCTL2_SETD0PID_V << USB_OTGFS_DIEPCTL2_SETD0PID_S)
#define USB_OTGFS_DIEPCTL2_SETD0PID_V  0x00000001U
#define USB_OTGFS_DIEPCTL2_SETD0PID_S  28
/** USB_OTGFS_DIEPCTL2_SETD1PID : R/W; bitpos: [29]; default: 0;
 *  SetD1PID
 *  - Set DATA1 PID (SetD1PID)
 *  -- Applies to interrupt and bulk IN and OUT endpoints only.
 *  -- Writing to this field sets the Endpoint Data PID (DPID) field in this register
 *  to DATA1.
 *  -- This field is applicable both for Scatter-Gather DMA mode and non Scatter-Gather
 *  DMA mode.
 *  - Set odd (micro)Frame (SetOddFr)
 *  -- Applies to isochronous IN and OUT endpoints only.
 *  -- Writing to this field sets the even and odd (micro)Frame (EO_FrNum) field to odd
 *  (micro)Frame.
 *  -- This field is not applicable for Scatter-Gather DMA mode.
 */
#define USB_OTGFS_DIEPCTL2_SETD1PID    (BIT(29))
#define USB_OTGFS_DIEPCTL2_SETD1PID_M  (USB_OTGFS_DIEPCTL2_SETD1PID_V << USB_OTGFS_DIEPCTL2_SETD1PID_S)
#define USB_OTGFS_DIEPCTL2_SETD1PID_V  0x00000001U
#define USB_OTGFS_DIEPCTL2_SETD1PID_S  29
/** USB_OTGFS_DIEPCTL2_EPDIS : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable (EPDis)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  The application sets this bit to stop transmitting/receiving data on an endpoint,
 *  even
 *  before the transfer for that endpoint is complete. The application must wait for the
 *  Endpoint Disabled interrupt before treating the endpoint as disabled. The core
 *  clears
 *  this bit before setting the Endpoint Disabled interrupt. The application must set
 *  this bit
 *  only if Endpoint Enable is already set for this endpoint.
 */
#define USB_OTGFS_DIEPCTL2_EPDIS    (BIT(30))
#define USB_OTGFS_DIEPCTL2_EPDIS_M  (USB_OTGFS_DIEPCTL2_EPDIS_V << USB_OTGFS_DIEPCTL2_EPDIS_S)
#define USB_OTGFS_DIEPCTL2_EPDIS_V  0x00000001U
#define USB_OTGFS_DIEPCTL2_EPDIS_S  30
/** USB_OTGFS_DIEPCTL2_EPENA : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable (EPEna)
 *
 *  Applies to IN and OUT endpoints.
 *  - When Scatter/Gather DMA mode is enabled,
 *  -- For IN endpoints this bit indicates that the descriptor structure and data
 *  buffer with data ready to transmit is setup.
 *  -- For OUT endpoint it indicates that the descriptor structure and data buffer to
 *  receive data is setup.
 *  - When Scatter/Gather DMA mode is enabled such as for buffer-pointer based DMA mode:
 *  -- For IN endpoints, this bit indicates that data is ready to be transmitted on the
 *  endpoint.
 *  -- For OUT endpoints, this bit indicates that the application has allocated the
 *  memory to start receiving data from the USB.
 *  - The core clears this bit before setting any of the following interrupts on this
 *  endpoint:
 *  -- SETUP Phase Done
 *  -- Endpoint Disabled
 *  -- Transfer Completed
 *  Note: For control endpoints in DMA mode, this bit must be set to be able to
 *  transfer SETUP data packets in memory.
 */
#define USB_OTGFS_DIEPCTL2_EPENA    (BIT(31))
#define USB_OTGFS_DIEPCTL2_EPENA_M  (USB_OTGFS_DIEPCTL2_EPENA_V << USB_OTGFS_DIEPCTL2_EPENA_S)
#define USB_OTGFS_DIEPCTL2_EPENA_V  0x00000001U
#define USB_OTGFS_DIEPCTL2_EPENA_S  31

