espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_DIEPCTL4_REG register
 *  Device Control IN Endpoint 4 Control Register  Note: This register exists for an
 *  endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGFS_DIEPCTL4_REG(i) (DR_REG_USB_BASE(i) + 0x980)
/** USB_OTGFS_DIEPCTL4_MPS : R/W; bitpos: [10:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  The application must program this field with the maximum packet size for the
 *  current logical endpoint. This value is in bytes.
 */
#define USB_OTGFS_DIEPCTL4_MPS    0x000007FFU
#define USB_OTGFS_DIEPCTL4_MPS_M  (USB_OTGFS_DIEPCTL4_MPS_V << USB_OTGFS_DIEPCTL4_MPS_S)
#define USB_OTGFS_DIEPCTL4_MPS_V  0x000007FFU
#define USB_OTGFS_DIEPCTL4_MPS_S  0
/** USB_OTGFS_DIEPCTL4_USBACTEP : R/W; bitpos: [15]; default: 0;
 *  USB Active Endpoint (USBActEP)
 *
 *  Indicates whether this endpoint is active in the current configuration and
 *  interface. The
 *  core clears this bit for all endpoints (other than EP 0) after detecting a USB
 *  reset. After
 *  receiving the SetConfiguration and SetInterface commands, the application must
 *  program endpoint registers accordingly and set this bit.
 */
#define USB_OTGFS_DIEPCTL4_USBACTEP    (BIT(15))
#define USB_OTGFS_DIEPCTL4_USBACTEP_M  (USB_OTGFS_DIEPCTL4_USBACTEP_V << USB_OTGFS_DIEPCTL4_USBACTEP_S)
#define USB_OTGFS_DIEPCTL4_USBACTEP_V  0x00000001U
#define USB_OTGFS_DIEPCTL4_USBACTEP_S  15
/** USB_OTGFS_DIEPCTL4_DPID : RO; bitpos: [16]; default: 0;
 *
 *  Endpoint Data PID (DPID)
 *
 *  Applies to interrupt/bulk IN and OUT endpoints only.
 *
 *  Contains the PID of the packet to be received or transmitted on this endpoint. The
 *  application must program the PID of the first packet to be received or transmitted
 *  on
 *  this endpoint, after the endpoint is activated. The applications use the SetD1PID
 *  and
 *  SetD0PID fields of this register to program either DATA0 or DATA1 PID.
 *  - 1'b0: DATA0
 *  - 1'b1: DATA1
 *  This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather
 *  DMA mode.
 *
 *  Even/Odd (Micro)Frame (EO_FrNum)
 *
 *  In non-Scatter/Gather DMA mode:
 *
 *  Applies to isochronous IN and OUT endpoints only.
 *
 *  Indicates the (micro)frame number in which the core transmits/receives isochronous
 *  data for this endpoint. The application must program the even/odd (micro)frame
 *  number in which it intends to transmit/receive isochronous data for this endpoint
 *  using
 *  the SetEvnFr and SetOddFr fields in this register.
 *  - 1'b0: Even (micro)frame
 *  - 1'b1: Odd (micro)frame
 *  When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
 *  in which to send data is provided in the transmit descriptor structure. The frame in
 *  which data is received is updated in receive descriptor structure.
 */
#define USB_OTGFS_DIEPCTL4_DPID    (BIT(16))
#define USB_OTGFS_DIEPCTL4_DPID_M  (USB_OTGFS_DIEPCTL4_DPID_V << USB_OTGFS_DIEPCTL4_DPID_S)
#define USB_OTGFS_DIEPCTL4_DPID_V  0x00000001U
#define USB_OTGFS_DIEPCTL4_DPID_S  16
/** USB_OTGFS_DIEPCTL4_NAKSTS : RO; bitpos: [17]; default: 0;
 *  NAK Status (NAKSts)
 *
 *  Indicates the following:
 *  - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status.
 *  - 1'b1: The core is transmitting NAK handshakes on this endpoint.
 *  When either the application or the core sets this bit:
 *  - The core stops receiving any data on an OUT endpoint, even if there is space in
 *  the RxFIFO to accommodate the incoming packet.
 *  - For non-isochronous IN endpoints: The core stops transmitting any data on an IN
 *  endpoint, even if there data is available in the TxFIFO.
 *  - For isochronous IN endpoints: The core sends out a zero-length data packet, even
 *  if there data is available in the TxFIFO.
 *  Irrespective of this bit's setting, the core always responds to SETUP data packets
 *  with an ACK handshake.
 */
#define USB_OTGFS_DIEPCTL4_NAKSTS    (BIT(17))
#define USB_OTGFS_DIEPCTL4_NAKSTS_M  (USB_OTGFS_DIEPCTL4_NAKSTS_V << USB_OTGFS_DIEPCTL4_NAKSTS_S)
#define USB_OTGFS_DIEPCTL4_NAKSTS_V  0x00000001U
#define USB_OTGFS_DIEPCTL4_NAKSTS_S  17
/** USB_OTGFS_DIEPCTL4_EPTYPE : R/W; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *  This is the transfer type supported by this logical endpoint.
 *  - 2'b00: Control
 *  - 2'b01: Isochronous
 *  - 2'b10: Bulk
 *  - 2'b11: Interrupt
 */
#define USB_OTGFS_DIEPCTL4_EPTYPE    0x00000003U
#define USB_OTGFS_DIEPCTL4_EPTYPE_M  (USB_OTGFS_DIEPCTL4_EPTYPE_V << USB_OTGFS_DIEPCTL4_EPTYPE_S)
#define USB_OTGFS_DIEPCTL4_EPTYPE_V  0x00000003U
#define USB_OTGFS_DIEPCTL4_EPTYPE_S  18
/** USB_OTGFS_DIEPCTL4_STALL : R/W; bitpos: [21]; default: 0;
 *  STALL Handshake (Stall)
 *
 *  Applies to non-control, non-isochronous IN and OUT endpoints only.
 *
 *  The application sets this bit to stall all tokens from the USB host to this
 *  endpoint. If a
 *  NAK bit, Global Non-periodic IN NAK, or Global OUT NAK is set along with this bit,
 *  the
 *  STALL bit takes priority. Only the application can clear this bit, never the core.
 *
 *  Applies to control endpoints only.
 *
 *  The application can only set this bit, and the core clears it, when a SETUP token is
 *  received for this endpoint. If a NAK bit, Global Non-periodic IN NAK, or Global OUT
 *  NAK is set along with this bit, the STALL bit takes priority. Irrespective of this
 *  bit's
 *  setting, the core always responds to SETUP data packets with an ACK handshake.
 */
#define USB_OTGFS_DIEPCTL4_STALL    (BIT(21))
#define USB_OTGFS_DIEPCTL4_STALL_M  (USB_OTGFS_DIEPCTL4_STALL_V << USB_OTGFS_DIEPCTL4_STALL_S)
#define USB_OTGFS_DIEPCTL4_STALL_V  0x00000001U
#define USB_OTGFS_DIEPCTL4_STALL_S  21
/** USB_OTGFS_DIEPCTL4_TXFNUM : R/W; bitpos: [25:22]; default: 0;
 *  TxFIFO Number (TxFNum)
 *
 *  Shared FIFO Operation non-periodic endpoints must set this bit to zero. Periodic
 *  endpoints must map this to the corresponding Periodic TxFIFO number.
 *  - 4'h0: Non-Periodic TxFIFO
 *  - Others: Specified Periodic TxFIFO.number
 *  Note: An interrupt IN endpoint can be configured as a non-periodic endpoint for
 *  applications such as mass storage. The core treats an IN endpoint as a non-periodic
 *  endpoint if the TxFNum field is set to 0. Otherwise, a separate periodic FIFO must
 *  be
 *  allocated for an interrupt IN endpoint, and the number of this
 *  FIFO must be programmed into the TxFNum field. Configuring an interrupt IN
 *  endpoint as a non-periodic endpoint saves the extra periodic FIFO area.
 *
 *  Dedicated FIFO Operation: These bits specify the FIFO number associated with this
 *  endpoint. Each active IN endpoint must be programmed to a separate FIFO number.
 *  This field is valid only for IN endpoints.
 */
#define USB_OTGFS_DIEPCTL4_TXFNUM    0x0000000FU
#define USB_OTGFS_DIEPCTL4_TXFNUM_M  (USB_OTGFS_DIEPCTL4_TXFNUM_V << USB_OTGFS_DIEPCTL4_TXFNUM_S)
#define USB_OTGFS_DIEPCTL4_TXFNUM_V  0x0000000FU
#define USB_OTGFS_DIEPCTL4_TXFNUM_S  22
/** USB_OTGFS_DIEPCTL4_CNAK : R/W; bitpos: [26]; default: 0;
 *  Clear NAK (CNAK)
 *
 *  A write to this bit clears the NAK bit for the endpoint.
 */
#define USB_OTGFS_DIEPCTL4_CNAK    (BIT(26))
#define USB_OTGFS_DIEPCTL4_CNAK_M  (USB_OTGFS_DIEPCTL4_CNAK_V << USB_OTGFS_DIEPCTL4_CNAK_S)
#define USB_OTGFS_DIEPCTL4_CNAK_V  0x00000001U
#define USB_OTGFS_DIEPCTL4_CNAK_S  26
/** USB_OTGFS_DIEPCTL4_SNAK : R/W; bitpos: [27]; default: 0;
 *  Set NAK (SNAK)
 *
 *  A write to this bit sets the NAK bit for the endpoint.
 *
 *  Using this bit, the application can control the transmission of NAK handshakes on
 *  an endpoint. The core can also Set this bit for an endpoint after a SETUP packet is
 *  received on that endpoint.
 */
#define USB_OTGFS_DIEPCTL4_SNAK    (BIT(27))
#define USB_OTGFS_DIEPCTL4_SNAK_M  (USB_OTGFS_DIEPCTL4_SNAK_V << USB_OTGFS_DIEPCTL4_SNAK_S)
#define USB_OTGFS_DIEPCTL4_SNAK_V  0x00000001U
#define USB_OTGFS_DIEPCTL4_SNAK_S  27
/** USB_OTGFS_DIEPCTL4_SETD0PID : R/W; bitpos: [28]; default: 0;
 *  SetD0PID
 *  - Set DATA0 PID (SetD0PID)
 *  -- Applies to interrupt/bulk IN and OUT endpoints only.
 *  -- Writing to this field sets the Endpoint Data PID (DPID) field in this register
 *  to DATA0.
 *  -- This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather
 *  DMA mode.
 *  In non-Scatter/Gather DMA mode: Set Even (micro)Frame (SetEvenFr)
 *  -- Applies to isochronous IN and OUT endpoints only.
 *  -- Writing to this field sets the Even/Odd (micro)Frame (EO_FrNum) field to even
 *  (micro)Frame.
 *  When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
 *  in which to send data is in the transmit descriptor structure. The frame in which to
 *  receive data is updated in receive descriptor structure.
 */
#define USB_OTGFS_DIEPCTL4_SETD0PID    (BIT(28))
#define USB_OTGFS_DIEPCTL4_SETD0PID_M  (USB_OTGFS_DIEPCTL4_SETD0PID_V << USB_OTGFS_DIEPCTL4_SETD0PID_S)
#define USB_OTGFS_DIEPCTL4_SETD0PID_V  0x00000001U
#define USB_OTGFS_DIEPCTL4_SETD0PID_S  28
/** USB_OTGFS_DIEPCTL4_SETD1PID : R/W; bitpos: [29]; default: 0;
 *  SetD1PID
 *  - Set DATA1 PID (SetD1PID)
 *  -- Applies to interrupt and bulk IN and OUT endpoints only.
 *  -- Writing to this field sets the Endpoint Data PID (DPID) field in this register
 *  to DATA1.
 *  -- This field is applicable both for Scatter-Gather DMA mode and non Scatter-Gather
 *  DMA mode.
 *  - Set odd (micro)Frame (SetOddFr)
 *  -- Applies to isochronous IN and OUT endpoints only.
 *  -- Writing to this field sets the even and odd (micro)Frame (EO_FrNum) field to odd
 *  (micro)Frame.
 *  -- This field is not applicable for Scatter-Gather DMA mode.
 */
#define USB_OTGFS_DIEPCTL4_SETD1PID    (BIT(29))
#define USB_OTGFS_DIEPCTL4_SETD1PID_M  (USB_OTGFS_DIEPCTL4_SETD1PID_V << USB_OTGFS_DIEPCTL4_SETD1PID_S)
#define USB_OTGFS_DIEPCTL4_SETD1PID_V  0x00000001U
#define USB_OTGFS_DIEPCTL4_SETD1PID_S  29
/** USB_OTGFS_DIEPCTL4_EPDIS : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable (EPDis)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  The application sets this bit to stop transmitting/receiving data on an endpoint,
 *  even
 *  before the transfer for that endpoint is complete. The application must wait for the
 *  Endpoint Disabled interrupt before treating the endpoint as disabled. The core
 *  clears
 *  this bit before setting the Endpoint Disabled interrupt. The application must set
 *  this bit
 *  only if Endpoint Enable is already set for this endpoint.
 */
#define USB_OTGFS_DIEPCTL4_EPDIS    (BIT(30))
#define USB_OTGFS_DIEPCTL4_EPDIS_M  (USB_OTGFS_DIEPCTL4_EPDIS_V << USB_OTGFS_DIEPCTL4_EPDIS_S)
#define USB_OTGFS_DIEPCTL4_EPDIS_V  0x00000001U
#define USB_OTGFS_DIEPCTL4_EPDIS_S  30
/** USB_OTGFS_DIEPCTL4_EPENA : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable (EPEna)
 *
 *  Applies to IN and OUT endpoints.
 *  - When Scatter/Gather DMA mode is enabled,
 *  -- For IN endpoints this bit indicates that the descriptor structure and data
 *  buffer with data ready to transmit is setup.
 *  -- For OUT endpoint it indicates that the descriptor structure and data buffer to
 *  receive data is setup.
 *  - When Scatter/Gather DMA mode is enabled such as for buffer-pointer based DMA mode:
 *  -- For IN endpoints, this bit indicates that data is ready to be transmitted on the
 *  endpoint.
 *  -- For OUT endpoints, this bit indicates that the application has allocated the
 *  memory to start receiving data from the USB.
 *  - The core clears this bit before setting any of the following interrupts on this
 *  endpoint:
 *  -- SETUP Phase Done
 *  -- Endpoint Disabled
 *  -- Transfer Completed
 *  Note: For control endpoints in DMA mode, this bit must be set to be able to
 *  transfer SETUP data packets in memory.
 */
#define USB_OTGFS_DIEPCTL4_EPENA    (BIT(31))
#define USB_OTGFS_DIEPCTL4_EPENA_M  (USB_OTGFS_DIEPCTL4_EPENA_V << USB_OTGFS_DIEPCTL4_EPENA_S)
#define USB_OTGFS_DIEPCTL4_EPENA_V  0x00000001U
#define USB_OTGFS_DIEPCTL4_EPENA_S  31

/** USB_OTGFS_DIEPINT4_REG register
 *  Device IN Endpoint 4 Interrupt Register  Note: This register exists for an endpoint
 *  i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGFS_DIEPINT4_REG(i) (DR_REG_USB_BASE(i) + 0x988)
/** USB_OTGFS_DIEPINT4_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt (XferCompl)
 *
 *  Applies to IN and OUT endpoints.
 *  - When Scatter/Gather DMA mode is enabled
 *  -- For IN endpoint this field indicates that the requested data from the descriptor
 *  is moved from external system memory to internal FIFO.
 *  -- For OUT endpoint this field indicates that the requested data from the internal
 *  FIFO is moved to external system memory. This interrupt is generated only when the
 *  corresponding endpoint descriptor is closed, and the IOC bit for the corresponding
 *  descriptor is set.
 *  - When Scatter/Gather DMA mode is disabled, this field indicates that the
 *  programmed transfer is complete on the AHB as well as on the USB, for this endpoint.
 */
#define USB_OTGFS_DIEPINT4_XFERCOMPL    (BIT(0))
#define USB_OTGFS_DIEPINT4_XFERCOMPL_M  (USB_OTGFS_DIEPINT4_XFERCOMPL_V << USB_OTGFS_DIEPINT4_XFERCOMPL_S)
#define USB_OTGFS_DIEPINT4_XFERCOMPL_V  0x00000001U
#define USB_OTGFS_DIEPINT4_XFERCOMPL_S  0
/** USB_OTGFS_DIEPINT4_EPDISBLD : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt (EPDisbld)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This bit indicates that the endpoint is disabled per the application's request.
 */
#define USB_OTGFS_DIEPINT4_EPDISBLD    (BIT(1))
#define USB_OTGFS_DIEPINT4_EPDISBLD_M  (USB_OTGFS_DIEPINT4_EPDISBLD_V << USB_OTGFS_DIEPINT4_EPDISBLD_S)
#define USB_OTGFS_DIEPINT4_EPDISBLD_V  0x00000001U
#define USB_OTGFS_DIEPINT4_EPDISBLD_S  1
/** USB_OTGFS_DIEPINT4_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This is generated only in Internal DMA mode when there is an
 *  AHB error during an AHB read/write. The application can read
 *  the corresponding endpoint DMA address register to get the
 *  error address.
 */
#define USB_OTGFS_DIEPINT4_AHBERR    (BIT(2))
#define USB_OTGFS_DIEPINT4_AHBERR_M  (USB_OTGFS_DIEPINT4_AHBERR_V << USB_OTGFS_DIEPINT4_AHBERR_S)
#define USB_OTGFS_DIEPINT4_AHBERR_V  0x00000001U
#define USB_OTGFS_DIEPINT4_AHBERR_S  2
/** USB_OTGFS_DIEPINT4_TIMEOUT : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition (TimeOUT)
 *  - In shared TX FIFO mode, applies to non-isochronous IN endpoints only.
 *  - In dedicated FIFO mode, applies only to Control IN endpoints.
 *  - In Scatter/Gather DMA mode, the TimeOUT interrupt is not asserted.
 *  Indicates that the core has detected a timeout condition on the USB for the last IN
 *  token on this endpoint.
 */
#define USB_OTGFS_DIEPINT4_TIMEOUT    (BIT(3))
#define USB_OTGFS_DIEPINT4_TIMEOUT_M  (USB_OTGFS_DIEPINT4_TIMEOUT_V << USB_OTGFS_DIEPINT4_TIMEOUT_S)
#define USB_OTGFS_DIEPINT4_TIMEOUT_V  0x00000001U
#define USB_OTGFS_DIEPINT4_TIMEOUT_S  3
/** USB_OTGFS_DIEPINT4_INTKNTXFEMP : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO is Empty (INTknTXFEmp)
 *
 *  Applies to non-periodic IN endpoints only.
 *
 *  Indicates that an IN token was received when the associated TxFIFO
 *  (periodic/non-periodic) was empty. This interrupt is asserted on the endpoint for
 *  which the IN token was received.
 */
#define USB_OTGFS_DIEPINT4_INTKNTXFEMP    (BIT(4))
#define USB_OTGFS_DIEPINT4_INTKNTXFEMP_M  (USB_OTGFS_DIEPINT4_INTKNTXFEMP_V << USB_OTGFS_DIEPINT4_INTKNTXFEMP_S)
#define USB_OTGFS_DIEPINT4_INTKNTXFEMP_V  0x00000001U
#define USB_OTGFS_DIEPINT4_INTKNTXFEMP_S  4
/** USB_OTGFS_DIEPINT4_INTKNEPMIS : R/W; bitpos: [5]; default: 0;
 *  IN Token Received with EP Mismatch (INTknEPMis)
 *
 *  Applies to non-periodic IN endpoints only.
 *
 *  Indicates that the data in the top of the non-periodic TxFIFO belongs to an
 *  endpoint other than the one for which the IN token was received. This interrupt is
 *  asserted on the endpoint for which the IN token was received.
 */
#define USB_OTGFS_DIEPINT4_INTKNEPMIS    (BIT(5))
#define USB_OTGFS_DIEPINT4_INTKNEPMIS_M  (USB_OTGFS_DIEPINT4_INTKNEPMIS_V << USB_OTGFS_DIEPINT4_INTKNEPMIS_S)
#define USB_OTGFS_DIEPINT4_INTKNEPMIS_V  0x00000001U
#define USB_OTGFS_DIEPINT4_INTKNEPMIS_S  5
/** USB_OTGFS_DIEPINT4_INEPNAKEFF : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective (INEPNakEff)
 *
 *  Applies to periodic IN endpoints only.
 *
 *  This bit can be cleared when the application clears the IN endpoint NAK by writing
 *  to DIEPCTLn.CNAK.
 *
 *  This interrupt indicates that the core has sampled the NAK bit
 *
 *  Set (either by the application or by the core). The interrupt indicates that the IN
 *  endpoint NAK bit Set by the application has taken effect in the core.
 *
 *  This interrupt does not guarantee that a NAK handshake is sent on the USB. A STALL
 *  bit takes priority over a NAK bit.
 */
#define USB_OTGFS_DIEPINT4_INEPNAKEFF    (BIT(6))
#define USB_OTGFS_DIEPINT4_INEPNAKEFF_M  (USB_OTGFS_DIEPINT4_INEPNAKEFF_V << USB_OTGFS_DIEPINT4_INEPNAKEFF_S)
#define USB_OTGFS_DIEPINT4_INEPNAKEFF_V  0x00000001U
#define USB_OTGFS_DIEPINT4_INEPNAKEFF_S  6
/** USB_OTGFS_DIEPINT4_TXFEMP : RO; bitpos: [7]; default: 1;
 *  Transmit FIFO Empty (TxFEmp)
 *
 *  This bit is valid only for IN endpoints
 *
 *  This interrupt is asserted when the TxFIFO for this endpoint is
 *  either half or completely empty. The half or completely empty
 *  status is determined by the TxFIFO Empty Level bit in the Core
 *  AHB Configuration register (GAHBCFG.NPTxFEmpLvl)).
 */
#define USB_OTGFS_DIEPINT4_TXFEMP    (BIT(7))
#define USB_OTGFS_DIEPINT4_TXFEMP_M  (USB_OTGFS_DIEPINT4_TXFEMP_V << USB_OTGFS_DIEPINT4_TXFEMP_S)
#define USB_OTGFS_DIEPINT4_TXFEMP_V  0x00000001U
#define USB_OTGFS_DIEPINT4_TXFEMP_S  7
/** USB_OTGFS_DIEPINT4_TXFIFOUNDRN : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun (TxfifoUndrn)
 *
 *  Applies to IN endpoints Only
 *
 *  This bit is valid only If thresholding is enabled. The core generates this
 *  interrupt when
 *  it detects a transmit FIFO underrun condition for this endpoint.
 */
#define USB_OTGFS_DIEPINT4_TXFIFOUNDRN    (BIT(8))
#define USB_OTGFS_DIEPINT4_TXFIFOUNDRN_M  (USB_OTGFS_DIEPINT4_TXFIFOUNDRN_V << USB_OTGFS_DIEPINT4_TXFIFOUNDRN_S)
#define USB_OTGFS_DIEPINT4_TXFIFOUNDRN_V  0x00000001U
#define USB_OTGFS_DIEPINT4_TXFIFOUNDRN_S  8
/** USB_OTGFS_DIEPINT4_BNAINTR : R/W; bitpos: [9]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 *
 *  The core generates this interrupt when the descriptor accessed is not ready for the
 *  Core to process, such as Host busy or DMA done.
 */
#define USB_OTGFS_DIEPINT4_BNAINTR    (BIT(9))
#define USB_OTGFS_DIEPINT4_BNAINTR_M  (USB_OTGFS_DIEPINT4_BNAINTR_V << USB_OTGFS_DIEPINT4_BNAINTR_S)
#define USB_OTGFS_DIEPINT4_BNAINTR_V  0x00000001U
#define USB_OTGFS_DIEPINT4_BNAINTR_S  9
/** USB_OTGFS_DIEPINT4_PKTDRPSTS : R/W; bitpos: [11]; default: 0;
 *  Packet Drop Status (PktDrpSts)
 *
 *  This bit indicates to the application that an ISOC OUT packet has been dropped. This
 *  bit does not have an associated mask bit and does not generate an interrupt.
 *
 *  Dependency: This bit is valid in non Scatter/Gather DMA mode when periodic transfer
 *  interrupt feature is selected.
 */
#define USB_OTGFS_DIEPINT4_PKTDRPSTS    (BIT(11))
#define USB_OTGFS_DIEPINT4_PKTDRPSTS_M  (USB_OTGFS_DIEPINT4_PKTDRPSTS_V << USB_OTGFS_DIEPINT4_PKTDRPSTS_S)
#define USB_OTGFS_DIEPINT4_PKTDRPSTS_V  0x00000001U
#define USB_OTGFS_DIEPINT4_PKTDRPSTS_S  11
/** USB_OTGFS_DIEPINT4_BBLEERR : R/W; bitpos: [12]; default: 0;
 *  NAK Interrupt (BbleErr)
 *
 *  The core generates this interrupt when babble is received for the endpoint.
 */
#define USB_OTGFS_DIEPINT4_BBLEERR    (BIT(12))
#define USB_OTGFS_DIEPINT4_BBLEERR_M  (USB_OTGFS_DIEPINT4_BBLEERR_V << USB_OTGFS_DIEPINT4_BBLEERR_S)
#define USB_OTGFS_DIEPINT4_BBLEERR_V  0x00000001U
#define USB_OTGFS_DIEPINT4_BBLEERR_S  12
/** USB_OTGFS_DIEPINT4_NAKINTRPT : R/W; bitpos: [13]; default: 0;
 *  NAK Interrupt (NAKInterrupt)
 *
 *  The core generates this interrupt when a NAK is transmitted or received by the
 *  device.
 *  In case of isochronous IN endpoints the interrupt gets generated when a zero length
 *  packet is transmitted due to un-availability of data in the TXFifo.
 */
#define USB_OTGFS_DIEPINT4_NAKINTRPT    (BIT(13))
#define USB_OTGFS_DIEPINT4_NAKINTRPT_M  (USB_OTGFS_DIEPINT4_NAKINTRPT_V << USB_OTGFS_DIEPINT4_NAKINTRPT_S)
#define USB_OTGFS_DIEPINT4_NAKINTRPT_V  0x00000001U
#define USB_OTGFS_DIEPINT4_NAKINTRPT_S  13
/** USB_OTGFS_DIEPINT4_NYETINTRPT : R/W; bitpos: [14]; default: 0;
 *  NYET Interrupt (NYETIntrpt)
 *
 *  The core generates this interrupt when a NYET response is transmitted for a non
 *  isochronous OUT endpoint.
 */
#define USB_OTGFS_DIEPINT4_NYETINTRPT    (BIT(14))
#define USB_OTGFS_DIEPINT4_NYETINTRPT_M  (USB_OTGFS_DIEPINT4_NYETINTRPT_V << USB_OTGFS_DIEPINT4_NYETINTRPT_S)
#define USB_OTGFS_DIEPINT4_NYETINTRPT_V  0x00000001U
#define USB_OTGFS_DIEPINT4_NYETINTRPT_S  14

/** USB_OTGFS_DIEPTSIZ4_REG register
 *  Device IN Endpoint 4 Transfer Size Register  Note: This register exists for an
 *  endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGFS_DIEPTSIZ4_REG(i) (DR_REG_USB_BASE(i) + 0x990)
/** USB_OTGFS_DIEPTSIZ4_XFERSIZE : R/W; bitpos: [15:0]; default: 0;
 *  Transfer Size (XferSize)
 *
 *  Indicates the transfer size in bytes for endpoint 0. The core
 *  interrupts the application only after it has exhausted the transfer
 *  size amount of data. The transfer size can be Set to the
 *  maximum packet size of the endpoint, to be interrupted at the
 *  end of each packet.
 *
 *  The core decrements this field every time a packet from the
 *  external memory is written to the TxFIFO.
 */
#define USB_OTGFS_DIEPTSIZ4_XFERSIZE    0x0000FFFFU
#define USB_OTGFS_DIEPTSIZ4_XFERSIZE_M  (USB_OTGFS_DIEPTSIZ4_XFERSIZE_V << USB_OTGFS_DIEPTSIZ4_XFERSIZE_S)
#define USB_OTGFS_DIEPTSIZ4_XFERSIZE_V  0x0000FFFFU
#define USB_OTGFS_DIEPTSIZ4_XFERSIZE_S  0
/** USB_OTGFS_DIEPTSIZ4_PKTCNT : R/W; bitpos: [25:19]; default: 0;
 *  Packet Count (PktCnt)
 *
 *  Indicates the total number of USB packets that constitute the Transfer Size amount
 *  of data for endpoint 0.
 *
 *  This field is decremented every time a packet (maximum size or short packet) is
 *  read from the TxFIFO.
 */
#define USB_OTGFS_DIEPTSIZ4_PKTCNT    0x0000007FU
#define USB_OTGFS_DIEPTSIZ4_PKTCNT_M  (USB_OTGFS_DIEPTSIZ4_PKTCNT_V << USB_OTGFS_DIEPTSIZ4_PKTCNT_S)
#define USB_OTGFS_DIEPTSIZ4_PKTCNT_V  0x0000007FU
#define USB_OTGFS_DIEPTSIZ4_PKTCNT_S  19
/** USB_OTGFS_DIEPTSIZ4_MC : R/W; bitpos: [30:29]; default: 0;
 *  MC
 *
 *  Applies to IN endpoints only.
 *
 *  For periodic IN endpoints, this field indicates the number of packets that must be
 *  transmitted per microframe on the USB. The core uses this field to calculate the
 *  data PID for isochronous IN endpoints.
 *  - 2'b01: 1 packet
 *  - 2'b10: 2 packets
 *  - 2'b11: 3 packets
 *  For non-periodic IN endpoints, this field is valid only in Internal DMA mode. It
 *  specifies the number of packets the core must fetchfor an IN endpoint before it
 *  switches to the endpoint pointed to by the Next Endpoint field of the Device
 *  Endpoint-n Control register (DIEPCTLn.NextEp)
 */
#define USB_OTGFS_DIEPTSIZ4_MC    0x00000003U
#define USB_OTGFS_DIEPTSIZ4_MC_M  (USB_OTGFS_DIEPTSIZ4_MC_V << USB_OTGFS_DIEPTSIZ4_MC_S)
#define USB_OTGFS_DIEPTSIZ4_MC_V  0x00000003U
#define USB_OTGFS_DIEPTSIZ4_MC_S  29

