espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_DIEPINT6_REG register
 *  Device IN Endpoint 6 Interrupt Register  Note: This register exists for an endpoint
 *  i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGFS_DIEPINT6_REG(i) (DR_REG_USB_BASE(i) + 0x9c8)
/** USB_OTGFS_DIEPINT6_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt (XferCompl)
 *
 *  Applies to IN and OUT endpoints.
 *  - When Scatter/Gather DMA mode is enabled
 *  -- For IN endpoint this field indicates that the requested data from the descriptor
 *  is moved from external system memory to internal FIFO.
 *  -- For OUT endpoint this field indicates that the requested data from the internal
 *  FIFO is moved to external system memory. This interrupt is generated only when the
 *  corresponding endpoint descriptor is closed, and the IOC bit for the corresponding
 *  descriptor is set.
 *  - When Scatter/Gather DMA mode is disabled, this field indicates that the
 *  programmed transfer is complete on the AHB as well as on the USB, for this endpoint.
 */
#define USB_OTGFS_DIEPINT6_XFERCOMPL    (BIT(0))
#define USB_OTGFS_DIEPINT6_XFERCOMPL_M  (USB_OTGFS_DIEPINT6_XFERCOMPL_V << USB_OTGFS_DIEPINT6_XFERCOMPL_S)
#define USB_OTGFS_DIEPINT6_XFERCOMPL_V  0x00000001U
#define USB_OTGFS_DIEPINT6_XFERCOMPL_S  0
/** USB_OTGFS_DIEPINT6_EPDISBLD : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt (EPDisbld)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This bit indicates that the endpoint is disabled per the application's request.
 */
#define USB_OTGFS_DIEPINT6_EPDISBLD    (BIT(1))
#define USB_OTGFS_DIEPINT6_EPDISBLD_M  (USB_OTGFS_DIEPINT6_EPDISBLD_V << USB_OTGFS_DIEPINT6_EPDISBLD_S)
#define USB_OTGFS_DIEPINT6_EPDISBLD_V  0x00000001U
#define USB_OTGFS_DIEPINT6_EPDISBLD_S  1
/** USB_OTGFS_DIEPINT6_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This is generated only in Internal DMA mode when there is an
 *  AHB error during an AHB read/write. The application can read
 *  the corresponding endpoint DMA address register to get the
 *  error address.
 */
#define USB_OTGFS_DIEPINT6_AHBERR    (BIT(2))
#define USB_OTGFS_DIEPINT6_AHBERR_M  (USB_OTGFS_DIEPINT6_AHBERR_V << USB_OTGFS_DIEPINT6_AHBERR_S)
#define USB_OTGFS_DIEPINT6_AHBERR_V  0x00000001U
#define USB_OTGFS_DIEPINT6_AHBERR_S  2
/** USB_OTGFS_DIEPINT6_TIMEOUT : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition (TimeOUT)
 *  - In shared TX FIFO mode, applies to non-isochronous IN endpoints only.
 *  - In dedicated FIFO mode, applies only to Control IN endpoints.
 *  - In Scatter/Gather DMA mode, the TimeOUT interrupt is not asserted.
 *  Indicates that the core has detected a timeout condition on the USB for the last IN
 *  token on this endpoint.
 */
#define USB_OTGFS_DIEPINT6_TIMEOUT    (BIT(3))
#define USB_OTGFS_DIEPINT6_TIMEOUT_M  (USB_OTGFS_DIEPINT6_TIMEOUT_V << USB_OTGFS_DIEPINT6_TIMEOUT_S)
#define USB_OTGFS_DIEPINT6_TIMEOUT_V  0x00000001U
#define USB_OTGFS_DIEPINT6_TIMEOUT_S  3
/** USB_OTGFS_DIEPINT6_INTKNTXFEMP : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO is Empty (INTknTXFEmp)
 *
 *  Applies to non-periodic IN endpoints only.
 *
 *  Indicates that an IN token was received when the associated TxFIFO
 *  (periodic/non-periodic) was empty. This interrupt is asserted on the endpoint for
 *  which the IN token was received.
 */
#define USB_OTGFS_DIEPINT6_INTKNTXFEMP    (BIT(4))
#define USB_OTGFS_DIEPINT6_INTKNTXFEMP_M  (USB_OTGFS_DIEPINT6_INTKNTXFEMP_V << USB_OTGFS_DIEPINT6_INTKNTXFEMP_S)
#define USB_OTGFS_DIEPINT6_INTKNTXFEMP_V  0x00000001U
#define USB_OTGFS_DIEPINT6_INTKNTXFEMP_S  4
/** USB_OTGFS_DIEPINT6_INTKNEPMIS : R/W; bitpos: [5]; default: 0;
 *  IN Token Received with EP Mismatch (INTknEPMis)
 *
 *  Applies to non-periodic IN endpoints only.
 *
 *  Indicates that the data in the top of the non-periodic TxFIFO belongs to an
 *  endpoint other than the one for which the IN token was received. This interrupt is
 *  asserted on the endpoint for which the IN token was received.
 */
#define USB_OTGFS_DIEPINT6_INTKNEPMIS    (BIT(5))
#define USB_OTGFS_DIEPINT6_INTKNEPMIS_M  (USB_OTGFS_DIEPINT6_INTKNEPMIS_V << USB_OTGFS_DIEPINT6_INTKNEPMIS_S)
#define USB_OTGFS_DIEPINT6_INTKNEPMIS_V  0x00000001U
#define USB_OTGFS_DIEPINT6_INTKNEPMIS_S  5
/** USB_OTGFS_DIEPINT6_INEPNAKEFF : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective (INEPNakEff)
 *
 *  Applies to periodic IN endpoints only.
 *
 *  This bit can be cleared when the application clears the IN endpoint NAK by writing
 *  to DIEPCTLn.CNAK.
 *
 *  This interrupt indicates that the core has sampled the NAK bit
 *
 *  Set (either by the application or by the core). The interrupt indicates that the IN
 *  endpoint NAK bit Set by the application has taken effect in the core.
 *
 *  This interrupt does not guarantee that a NAK handshake is sent on the USB. A STALL
 *  bit takes priority over a NAK bit.
 */
#define USB_OTGFS_DIEPINT6_INEPNAKEFF    (BIT(6))
#define USB_OTGFS_DIEPINT6_INEPNAKEFF_M  (USB_OTGFS_DIEPINT6_INEPNAKEFF_V << USB_OTGFS_DIEPINT6_INEPNAKEFF_S)
#define USB_OTGFS_DIEPINT6_INEPNAKEFF_V  0x00000001U
#define USB_OTGFS_DIEPINT6_INEPNAKEFF_S  6
/** USB_OTGFS_DIEPINT6_TXFEMP : RO; bitpos: [7]; default: 1;
 *  Transmit FIFO Empty (TxFEmp)
 *
 *  This bit is valid only for IN endpoints
 *
 *  This interrupt is asserted when the TxFIFO for this endpoint is
 *  either half or completely empty. The half or completely empty
 *  status is determined by the TxFIFO Empty Level bit in the Core
 *  AHB Configuration register (GAHBCFG.NPTxFEmpLvl)).
 */
#define USB_OTGFS_DIEPINT6_TXFEMP    (BIT(7))
#define USB_OTGFS_DIEPINT6_TXFEMP_M  (USB_OTGFS_DIEPINT6_TXFEMP_V << USB_OTGFS_DIEPINT6_TXFEMP_S)
#define USB_OTGFS_DIEPINT6_TXFEMP_V  0x00000001U
#define USB_OTGFS_DIEPINT6_TXFEMP_S  7
/** USB_OTGFS_DIEPINT6_TXFIFOUNDRN : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun (TxfifoUndrn)
 *
 *  Applies to IN endpoints Only
 *
 *  This bit is valid only If thresholding is enabled. The core generates this
 *  interrupt when
 *  it detects a transmit FIFO underrun condition for this endpoint.
 */
#define USB_OTGFS_DIEPINT6_TXFIFOUNDRN    (BIT(8))
#define USB_OTGFS_DIEPINT6_TXFIFOUNDRN_M  (USB_OTGFS_DIEPINT6_TXFIFOUNDRN_V << USB_OTGFS_DIEPINT6_TXFIFOUNDRN_S)
#define USB_OTGFS_DIEPINT6_TXFIFOUNDRN_V  0x00000001U
#define USB_OTGFS_DIEPINT6_TXFIFOUNDRN_S  8
/** USB_OTGFS_DIEPINT6_BNAINTR : R/W; bitpos: [9]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 *
 *  The core generates this interrupt when the descriptor accessed is not ready for the
 *  Core to process, such as Host busy or DMA done.
 */
#define USB_OTGFS_DIEPINT6_BNAINTR    (BIT(9))
#define USB_OTGFS_DIEPINT6_BNAINTR_M  (USB_OTGFS_DIEPINT6_BNAINTR_V << USB_OTGFS_DIEPINT6_BNAINTR_S)
#define USB_OTGFS_DIEPINT6_BNAINTR_V  0x00000001U
#define USB_OTGFS_DIEPINT6_BNAINTR_S  9
/** USB_OTGFS_DIEPINT6_PKTDRPSTS : R/W; bitpos: [11]; default: 0;
 *  Packet Drop Status (PktDrpSts)
 *
 *  This bit indicates to the application that an ISOC OUT packet has been dropped. This
 *  bit does not have an associated mask bit and does not generate an interrupt.
 *
 *  Dependency: This bit is valid in non Scatter/Gather DMA mode when periodic transfer
 *  interrupt feature is selected.
 */
#define USB_OTGFS_DIEPINT6_PKTDRPSTS    (BIT(11))
#define USB_OTGFS_DIEPINT6_PKTDRPSTS_M  (USB_OTGFS_DIEPINT6_PKTDRPSTS_V << USB_OTGFS_DIEPINT6_PKTDRPSTS_S)
#define USB_OTGFS_DIEPINT6_PKTDRPSTS_V  0x00000001U
#define USB_OTGFS_DIEPINT6_PKTDRPSTS_S  11
/** USB_OTGFS_DIEPINT6_BBLEERR : R/W; bitpos: [12]; default: 0;
 *  NAK Interrupt (BbleErr)
 *
 *  The core generates this interrupt when babble is received for the endpoint.
 */
#define USB_OTGFS_DIEPINT6_BBLEERR    (BIT(12))
#define USB_OTGFS_DIEPINT6_BBLEERR_M  (USB_OTGFS_DIEPINT6_BBLEERR_V << USB_OTGFS_DIEPINT6_BBLEERR_S)
#define USB_OTGFS_DIEPINT6_BBLEERR_V  0x00000001U
#define USB_OTGFS_DIEPINT6_BBLEERR_S  12
/** USB_OTGFS_DIEPINT6_NAKINTRPT : R/W; bitpos: [13]; default: 0;
 *  NAK Interrupt (NAKInterrupt)
 *
 *  The core generates this interrupt when a NAK is transmitted or received by the
 *  device.
 *  In case of isochronous IN endpoints the interrupt gets generated when a zero length
 *  packet is transmitted due to un-availability of data in the TXFifo.
 */
#define USB_OTGFS_DIEPINT6_NAKINTRPT    (BIT(13))
#define USB_OTGFS_DIEPINT6_NAKINTRPT_M  (USB_OTGFS_DIEPINT6_NAKINTRPT_V << USB_OTGFS_DIEPINT6_NAKINTRPT_S)
#define USB_OTGFS_DIEPINT6_NAKINTRPT_V  0x00000001U
#define USB_OTGFS_DIEPINT6_NAKINTRPT_S  13
/** USB_OTGFS_DIEPINT6_NYETINTRPT : R/W; bitpos: [14]; default: 0;
 *  NYET Interrupt (NYETIntrpt)
 *
 *  The core generates this interrupt when a NYET response is transmitted for a non
 *  isochronous OUT endpoint.
 */
#define USB_OTGFS_DIEPINT6_NYETINTRPT    (BIT(14))
#define USB_OTGFS_DIEPINT6_NYETINTRPT_M  (USB_OTGFS_DIEPINT6_NYETINTRPT_V << USB_OTGFS_DIEPINT6_NYETINTRPT_S)
#define USB_OTGFS_DIEPINT6_NYETINTRPT_V  0x00000001U
#define USB_OTGFS_DIEPINT6_NYETINTRPT_S  14

/** USB_OTGFS_DIEPTSIZ6_REG register
 *  Device IN Endpoint 6 Transfer Size Register  Note: This register exists for an
 *  endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGFS_DIEPTSIZ6_REG(i) (DR_REG_USB_BASE(i) + 0x9d0)
/** USB_OTGFS_DIEPTSIZ6_XFERSIZE : R/W; bitpos: [15:0]; default: 0;
 *  Transfer Size (XferSize)
 *
 *  Indicates the transfer size in bytes for endpoint 0. The core
 *  interrupts the application only after it has exhausted the transfer
 *  size amount of data. The transfer size can be Set to the
 *  maximum packet size of the endpoint, to be interrupted at the
 *  end of each packet.
 *
 *  The core decrements this field every time a packet from the
 *  external memory is written to the TxFIFO.
 */
#define USB_OTGFS_DIEPTSIZ6_XFERSIZE    0x0000FFFFU
#define USB_OTGFS_DIEPTSIZ6_XFERSIZE_M  (USB_OTGFS_DIEPTSIZ6_XFERSIZE_V << USB_OTGFS_DIEPTSIZ6_XFERSIZE_S)
#define USB_OTGFS_DIEPTSIZ6_XFERSIZE_V  0x0000FFFFU
#define USB_OTGFS_DIEPTSIZ6_XFERSIZE_S  0
/** USB_OTGFS_DIEPTSIZ6_PKTCNT : R/W; bitpos: [25:19]; default: 0;
 *  Packet Count (PktCnt)
 *
 *  Indicates the total number of USB packets that constitute the Transfer Size amount
 *  of data for endpoint 0.
 *
 *  This field is decremented every time a packet (maximum size or short packet) is
 *  read from the TxFIFO.
 */
#define USB_OTGFS_DIEPTSIZ6_PKTCNT    0x0000007FU
#define USB_OTGFS_DIEPTSIZ6_PKTCNT_M  (USB_OTGFS_DIEPTSIZ6_PKTCNT_V << USB_OTGFS_DIEPTSIZ6_PKTCNT_S)
#define USB_OTGFS_DIEPTSIZ6_PKTCNT_V  0x0000007FU
#define USB_OTGFS_DIEPTSIZ6_PKTCNT_S  19
/** USB_OTGFS_DIEPTSIZ6_MC : R/W; bitpos: [30:29]; default: 0;
 *  MC
 *
 *  Applies to IN endpoints only.
 *
 *  For periodic IN endpoints, this field indicates the number of packets that must be
 *  transmitted per microframe on the USB. The core uses this field to calculate the
 *  data PID for isochronous IN endpoints.
 *  - 2'b01: 1 packet
 *  - 2'b10: 2 packets
 *  - 2'b11: 3 packets
 *  For non-periodic IN endpoints, this field is valid only in Internal DMA mode. It
 *  specifies the number of packets the core must fetchfor an IN endpoint before it
 *  switches to the endpoint pointed to by the Next Endpoint field of the Device
 *  Endpoint-n Control register (DIEPCTLn.NextEp)
 */
#define USB_OTGFS_DIEPTSIZ6_MC    0x00000003U
#define USB_OTGFS_DIEPTSIZ6_MC_M  (USB_OTGFS_DIEPTSIZ6_MC_V << USB_OTGFS_DIEPTSIZ6_MC_S)
#define USB_OTGFS_DIEPTSIZ6_MC_V  0x00000003U
#define USB_OTGFS_DIEPTSIZ6_MC_S  29

/** USB_OTGFS_DIEPDMA6_REG register
 *  Device IN Endpoint 6 DMA Address Register  Note: This register exists for an
 *  endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGFS_DIEPDMA6_REG(i) (DR_REG_USB_BASE(i) + 0x9d4)
/** USB_OTGFS_DIEPDMA6_DMAADDR : R/W; bitpos: [31:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 *
 *  Note: For control endpoints, this field stores control OUT data packets as well as
 *  SETUP transaction data packets. When more than three SETUP packets are
 *  received back-to-back, the SETUP data packet in the memory is overwritten.
 *
 *  This register is incremented on every AHB transaction. The application can give
 *  only a DWORD-aligned address.
 *  - When Scatter/Gather DMA mode is not enabled, the application programs the start
 *  address value in this field.
 *  - When Scatter/Gather DMA mode is enabled, this field indicates the base pointer
 *  for the descriptor list.
 */
#define USB_OTGFS_DIEPDMA6_DMAADDR    0xFFFFFFFFU
#define USB_OTGFS_DIEPDMA6_DMAADDR_M  (USB_OTGFS_DIEPDMA6_DMAADDR_V << USB_OTGFS_DIEPDMA6_DMAADDR_S)
#define USB_OTGFS_DIEPDMA6_DMAADDR_V  0xFFFFFFFFU
#define USB_OTGFS_DIEPDMA6_DMAADDR_S  0

/** USB_OTGFS_DTXFSTS6_REG register
 *  Device IN Endpoint Transmit FIFO Status Register 6  Note: This register exists for
 *  an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGFS_DTXFSTS6_REG(i) (DR_REG_USB_BASE(i) + 0x9d8)
/** USB_OTGFS_DTXFSTS6_INEPTXFSPCAVAIL : RO; bitpos: [15:0]; default: 256;
 *  IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail)
 *
 *  Indicates the amount of free space available in the Endpoint TxFIFO.
 *
 *  Values are in terms of 32-bit words.
 *  - 16'h0: Endpoint TxFIFO is full
 *  - 16'h1: 1 word available
 *  - 16'h2: 2 words available
 *  - 16'hn: n words available (where 0  n  32,768)
 *  - 16'h8000: 32,768 words available
 *  - Others: Reserved
 */
#define USB_OTGFS_DTXFSTS6_INEPTXFSPCAVAIL    0x0000FFFFU
#define USB_OTGFS_DTXFSTS6_INEPTXFSPCAVAIL_M  (USB_OTGFS_DTXFSTS6_INEPTXFSPCAVAIL_V << USB_OTGFS_DTXFSTS6_INEPTXFSPCAVAIL_S)
#define USB_OTGFS_DTXFSTS6_INEPTXFSPCAVAIL_V  0x0000FFFFU
#define USB_OTGFS_DTXFSTS6_INEPTXFSPCAVAIL_S  0

/** USB_OTGFS_DIEPDMAB6_REG register
 *  Device IN Endpoint 6 Buffer Address Register  Note: This register exists for an
 *  endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGFS_DIEPDMAB6_REG(i) (DR_REG_USB_BASE(i) + 0x9dc)
/** USB_OTGFS_DIEPDMAB6_DMABUFFERADDR : RO; bitpos: [31:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress.
 *
 *  This register is present only in Scatter/Gather DMA mode. Otherwise this field is
 *  reserved.
 */
#define USB_OTGFS_DIEPDMAB6_DMABUFFERADDR    0xFFFFFFFFU
#define USB_OTGFS_DIEPDMAB6_DMABUFFERADDR_M  (USB_OTGFS_DIEPDMAB6_DMABUFFERADDR_V << USB_OTGFS_DIEPDMAB6_DMABUFFERADDR_S)
#define USB_OTGFS_DIEPDMAB6_DMABUFFERADDR_V  0xFFFFFFFFU
#define USB_OTGFS_DIEPDMAB6_DMABUFFERADDR_S  0

/** USB_OTGFS_DOEPCTL0_REG register
 *  Device Control OUT Endpoint 0 Control Register
 */
#define USB_OTGFS_DOEPCTL0_REG(i) (DR_REG_USB_BASE(i) + 0xb00)
/** USB_OTGFS_DOEPCTL0_MPS : RO; bitpos: [1:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  The maximum packet size for control OUT endpoint 0 is the same as what is
 *  programmed in control IN Endpoint 0.
 *  - 2'b00: 64 bytes
 *  - 2'b01: 32 bytes
 *  - 2'b10: 16 bytes
 *  - 2'b11: 8 bytes
 */
#define USB_OTGFS_DOEPCTL0_MPS    0x00000003U
#define USB_OTGFS_DOEPCTL0_MPS_M  (USB_OTGFS_DOEPCTL0_MPS_V << USB_OTGFS_DOEPCTL0_MPS_S)
#define USB_OTGFS_DOEPCTL0_MPS_V  0x00000003U
#define USB_OTGFS_DOEPCTL0_MPS_S  0
/** USB_OTGFS_DOEPCTL0_USBACTEP : RO; bitpos: [15]; default: 1;
 *  USB Active Endpoint (USBActEP)
 *
 *  This bit is always set to 1, indicating that a control endpoint 0 is always active
 *  in all configurations and interfaces.
 */
#define USB_OTGFS_DOEPCTL0_USBACTEP    (BIT(15))
#define USB_OTGFS_DOEPCTL0_USBACTEP_M  (USB_OTGFS_DOEPCTL0_USBACTEP_V << USB_OTGFS_DOEPCTL0_USBACTEP_S)
#define USB_OTGFS_DOEPCTL0_USBACTEP_V  0x00000001U
#define USB_OTGFS_DOEPCTL0_USBACTEP_S  15
/** USB_OTGFS_DOEPCTL0_NAKSTS : RO; bitpos: [17]; default: 0;
 *  NAK Status (NAKSts)
 *
 *  Indicates the following:
 *  - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status.
 *  - 1'b1: The core is transmitting NAK handshakes on this endpoint.
 *  When either the application or the core sets this bit, the core
 *  stops receiving data, even If there is space in the RxFIFO to
 *  accommodate the incoming packet. Irrespective of this bit's
 *  setting, the core always responds to SETUP data packets with
 *  an ACK handshake.
 */
#define USB_OTGFS_DOEPCTL0_NAKSTS    (BIT(17))
#define USB_OTGFS_DOEPCTL0_NAKSTS_M  (USB_OTGFS_DOEPCTL0_NAKSTS_V << USB_OTGFS_DOEPCTL0_NAKSTS_S)
#define USB_OTGFS_DOEPCTL0_NAKSTS_V  0x00000001U
#define USB_OTGFS_DOEPCTL0_NAKSTS_S  17
/** USB_OTGFS_DOEPCTL0_EPTYPE : RO; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *
 *  Hardcoded to 2'b00 for control.
 */
#define USB_OTGFS_DOEPCTL0_EPTYPE    0x00000003U
#define USB_OTGFS_DOEPCTL0_EPTYPE_M  (USB_OTGFS_DOEPCTL0_EPTYPE_V << USB_OTGFS_DOEPCTL0_EPTYPE_S)
#define USB_OTGFS_DOEPCTL0_EPTYPE_V  0x00000003U
#define USB_OTGFS_DOEPCTL0_EPTYPE_S  18
/** USB_OTGFS_DOEPCTL0_SNP : R/W; bitpos: [20]; default: 0;
 *  RESERVED
 */
#define USB_OTGFS_DOEPCTL0_SNP    (BIT(20))
#define USB_OTGFS_DOEPCTL0_SNP_M  (USB_OTGFS_DOEPCTL0_SNP_V << USB_OTGFS_DOEPCTL0_SNP_S)
#define USB_OTGFS_DOEPCTL0_SNP_V  0x00000001U
#define USB_OTGFS_DOEPCTL0_SNP_S  20
/** USB_OTGFS_DOEPCTL0_STALL : R/W; bitpos: [21]; default: 0;
 *  STALL Handshake (Stall)
 *
 *  The application can only set this bit, and the core clears it, when
 *  a SETUP token is received for this endpoint. If a NAK bit or
 *  Global OUT NAK is Set along with this bit, the STALL bit takes
 *  priority. Irrespective of this bit's setting, the core always
 *  responds to SETUP data packets with an ACK handshake.
 */
#define USB_OTGFS_DOEPCTL0_STALL    (BIT(21))
#define USB_OTGFS_DOEPCTL0_STALL_M  (USB_OTGFS_DOEPCTL0_STALL_V << USB_OTGFS_DOEPCTL0_STALL_S)
#define USB_OTGFS_DOEPCTL0_STALL_V  0x00000001U
#define USB_OTGFS_DOEPCTL0_STALL_S  21
/** USB_OTGFS_DOEPCTL0_CNAK : R/W; bitpos: [26]; default: 0;
 *  Clear NAK (CNAK)
 *
 *  A write to this bit clears the NAK bit for the endpoint.
 */
#define USB_OTGFS_DOEPCTL0_CNAK    (BIT(26))
#define USB_OTGFS_DOEPCTL0_CNAK_M  (USB_OTGFS_DOEPCTL0_CNAK_V << USB_OTGFS_DOEPCTL0_CNAK_S)
#define USB_OTGFS_DOEPCTL0_CNAK_V  0x00000001U
#define USB_OTGFS_DOEPCTL0_CNAK_S  26
/** USB_OTGFS_DOEPCTL0_SNAK : R/W; bitpos: [27]; default: 0;
 *  Set NAK (SNAK)
 *
 *  A write to this bit sets the NAK bit for the endpoint.
 *  Using this bit, the application can control the transmission of NAK handshakes on
 *  an endpoint.
 *  The core can also set bit on a Transfer Completed interrupt, or after a SETUP is
 *  received on the endpoint.
 */
#define USB_OTGFS_DOEPCTL0_SNAK    (BIT(27))
#define USB_OTGFS_DOEPCTL0_SNAK_M  (USB_OTGFS_DOEPCTL0_SNAK_V << USB_OTGFS_DOEPCTL0_SNAK_S)
#define USB_OTGFS_DOEPCTL0_SNAK_V  0x00000001U
#define USB_OTGFS_DOEPCTL0_SNAK_S  27
/** USB_OTGFS_DOEPCTL0_EPDIS : RO; bitpos: [30]; default: 0;
 *  Endpoint Disable (EPDis)
 *
 *  The application cannot disable control OUT endpoint 0.
 */
#define USB_OTGFS_DOEPCTL0_EPDIS    (BIT(30))
#define USB_OTGFS_DOEPCTL0_EPDIS_M  (USB_OTGFS_DOEPCTL0_EPDIS_V << USB_OTGFS_DOEPCTL0_EPDIS_S)
#define USB_OTGFS_DOEPCTL0_EPDIS_V  0x00000001U
#define USB_OTGFS_DOEPCTL0_EPDIS_S  30
/** USB_OTGFS_DOEPCTL0_EPENA : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable (EPEna)
 *  - When Scatter/Gather DMA mode is enabled, for OUT endpoints this bit indicates
 *  that the descriptor structure and data buffer to receive data is setup.
 *  - When Scatter/Gather DMA mode is disabled (such as for buffer-pointer based DMA
 *  mode)this bit indicates that the application has allocated the memory to start
 *  receiving data from the USB.
 *  - The core clears this bit before setting any of the following interrupts on this
 *  endpoint:
 *  -- SETUP Phase Done
 *  -- Endpoint Disabled
 *  -- Transfer Completed
 *  Note: In DMA mode, this bit must be set for the core to transfer SETUP data packets
 *  into memory.
 */
#define USB_OTGFS_DOEPCTL0_EPENA    (BIT(31))
#define USB_OTGFS_DOEPCTL0_EPENA_M  (USB_OTGFS_DOEPCTL0_EPENA_V << USB_OTGFS_DOEPCTL0_EPENA_S)
#define USB_OTGFS_DOEPCTL0_EPENA_V  0x00000001U
#define USB_OTGFS_DOEPCTL0_EPENA_S  31

