espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_DOEPTSIZ1_REG register
 *  Device OUT Endpoint 1 Transfer Size Register
 */
#define USB_OTGFS_DOEPTSIZ1_REG(i) (DR_REG_USB_BASE(i) + 0xb30)
/** USB_OTGFS_DOEPTSIZ1_XFERSIZE : R/W; bitpos: [15:0]; default: 0;
 *  Transfer Size (XferSize)
 *
 *  Indicates the transfer size in bytes for endpoint 0. The core
 *  interrupts the application only after it has exhausted the transfer
 *  size amount of data. The transfer size can be Set to the
 *  maximum packet size of the endpoint, to be interrupted at the
 *  end of each packet.
 *
 *  The core decrements this field every time a packet is read from
 *  the RxFIFO and written to the external memory.
 */
#define USB_OTGFS_DOEPTSIZ1_XFERSIZE    0x0000FFFFU
#define USB_OTGFS_DOEPTSIZ1_XFERSIZE_M  (USB_OTGFS_DOEPTSIZ1_XFERSIZE_V << USB_OTGFS_DOEPTSIZ1_XFERSIZE_S)
#define USB_OTGFS_DOEPTSIZ1_XFERSIZE_V  0x0000FFFFU
#define USB_OTGFS_DOEPTSIZ1_XFERSIZE_S  0
/** USB_OTGFS_DOEPTSIZ1_PKTCNT : R/W; bitpos: [25:19]; default: 0;
 *  Packet Count (PktCnt)
 *  This field is decremented to zero after a packet is written into the RxFIFO.
 */
#define USB_OTGFS_DOEPTSIZ1_PKTCNT    0x0000007FU
#define USB_OTGFS_DOEPTSIZ1_PKTCNT_M  (USB_OTGFS_DOEPTSIZ1_PKTCNT_V << USB_OTGFS_DOEPTSIZ1_PKTCNT_S)
#define USB_OTGFS_DOEPTSIZ1_PKTCNT_V  0x0000007FU
#define USB_OTGFS_DOEPTSIZ1_PKTCNT_S  19
/** USB_OTGFS_DOEPTSIZ1_RXDPID : RO; bitpos: [30:29]; default: 0;
 *  RxDPID
 *
 *  Applies to isochronous OUT endpoints only.
 *
 *  This is the data PID received in the last packet for this endpoint.
 *  - 2'b00: DATA0
 *  - 2'b01: DATA2
 *  - 2'b10: DATA1
 *  - 2'b11: MDATA
 *  SETUP Packet Count (SUPCnt)
 *
 *  Applies to control OUT Endpoints only.
 *
 *  This field specifies the number of back-to-back SETUP data
 *  packets the endpoint can receive.
 *  - 2'b01: 1 packet
 *  - 2'b10: 2 packets
 *  - 2'b11: 3 packets
 */
#define USB_OTGFS_DOEPTSIZ1_RXDPID    0x00000003U
#define USB_OTGFS_DOEPTSIZ1_RXDPID_M  (USB_OTGFS_DOEPTSIZ1_RXDPID_V << USB_OTGFS_DOEPTSIZ1_RXDPID_S)
#define USB_OTGFS_DOEPTSIZ1_RXDPID_V  0x00000003U
#define USB_OTGFS_DOEPTSIZ1_RXDPID_S  29

/** USB_OTGFS_DOEPDMA1_REG register
 *  Device OUT Endpoint 1 DMA Address Register
 */
#define USB_OTGFS_DOEPDMA1_REG(i) (DR_REG_USB_BASE(i) + 0xb34)
/** USB_OTGFS_DOEPDMA1_DMAADDR : R/W; bitpos: [31:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 *
 *  Note: For control endpoints, this field stores control OUT data packets as well as
 *  SETUP transaction data packets. When more than three SETUP packets are
 *  received back-to-back, the SETUP data packet in the memory is overwritten.
 *
 *  This register is incremented on every AHB transaction. The application can give
 *  only a DWORD-aligned address.
 *  - When Scatter/Gather DMA mode is not enabled, the application programs the start
 *  address value in this field.
 *  - When Scatter/Gather DMA mode is enabled, this field indicates the base pointer
 *  for the descriptor list.
 */
#define USB_OTGFS_DOEPDMA1_DMAADDR    0xFFFFFFFFU
#define USB_OTGFS_DOEPDMA1_DMAADDR_M  (USB_OTGFS_DOEPDMA1_DMAADDR_V << USB_OTGFS_DOEPDMA1_DMAADDR_S)
#define USB_OTGFS_DOEPDMA1_DMAADDR_V  0xFFFFFFFFU
#define USB_OTGFS_DOEPDMA1_DMAADDR_S  0

/** USB_OTGFS_DOEPDMAB1_REG register
 *  Device OUT Endpoint 1 Buffer Address Register
 */
#define USB_OTGFS_DOEPDMAB1_REG(i) (DR_REG_USB_BASE(i) + 0xb3c)
/** USB_OTGFS_DOEPDMAB1_DMABUFFERADDR : RO; bitpos: [31:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress.
 *
 *  This register is present only in Scatter/Gather DMA mode. Otherwise this field is
 *  reserved.
 */
#define USB_OTGFS_DOEPDMAB1_DMABUFFERADDR    0xFFFFFFFFU
#define USB_OTGFS_DOEPDMAB1_DMABUFFERADDR_M  (USB_OTGFS_DOEPDMAB1_DMABUFFERADDR_V << USB_OTGFS_DOEPDMAB1_DMABUFFERADDR_S)
#define USB_OTGFS_DOEPDMAB1_DMABUFFERADDR_V  0xFFFFFFFFU
#define USB_OTGFS_DOEPDMAB1_DMABUFFERADDR_S  0

/** USB_OTGFS_DOEPCTL2_REG register
 *  Device Control OUT Endpoint 2 Control Register
 */
#define USB_OTGFS_DOEPCTL2_REG(i) (DR_REG_USB_BASE(i) + 0xb40)
/** USB_OTGFS_DOEPCTL2_MPS : R/W; bitpos: [10:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  The application must program this field with the maximum packet size for the current
 *  logical endpoint. This value is in bytes.
 */
#define USB_OTGFS_DOEPCTL2_MPS    0x000007FFU
#define USB_OTGFS_DOEPCTL2_MPS_M  (USB_OTGFS_DOEPCTL2_MPS_V << USB_OTGFS_DOEPCTL2_MPS_S)
#define USB_OTGFS_DOEPCTL2_MPS_V  0x000007FFU
#define USB_OTGFS_DOEPCTL2_MPS_S  0
/** USB_OTGFS_DOEPCTL2_USBACTEP : R/W; bitpos: [15]; default: 0;
 *  USB Active Endpoint (USBActEP)
 *
 *  Indicates whether this endpoint is active in the current configuration and
 *  interface. The
 *  core clears this bit for all endpoints (other than EP 0) after detecting a USB
 *  reset. After
 *  receiving the SetConfiguration and SetInterface commands, the application must
 *  program endpoint registers accordingly and set this bit.
 */
#define USB_OTGFS_DOEPCTL2_USBACTEP    (BIT(15))
#define USB_OTGFS_DOEPCTL2_USBACTEP_M  (USB_OTGFS_DOEPCTL2_USBACTEP_V << USB_OTGFS_DOEPCTL2_USBACTEP_S)
#define USB_OTGFS_DOEPCTL2_USBACTEP_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_USBACTEP_S  15
/** USB_OTGFS_DOEPCTL2_DPID : RO; bitpos: [16]; default: 0;
 *  Endpoint Data PID (DPID)
 *
 *  Applies to interrupt/bulk IN and OUT endpoints only.
 *
 *  Contains the PID of the packet to be received or transmitted on this endpoint. The
 *  application must program the PID of the first packet to be received or transmitted
 *  on
 *  this endpoint, after the endpoint is activated. The applications use the SetD1PID
 *  and
 *  SetD0PID fields of this register to program either DATA0 or DATA1 PID.
 *  - 1'b0: DATA0
 *  - 1'b1: DATA1
 *  This field is applicable for both Scatter/Gather DMA mode and non-Scatter/Gather
 *  DMA mode.
 *
 *  Reset: 1'b0
 *
 *  Even/Odd (Micro)Frame (EO_FrNum)
 *
 *  In non-Scatter/Gather DMA mode:
 *  - Applies to isochronous IN and OUT endpoints only.
 *  - Indicates the (micro)frame number in which the core transmits/receives
 *  isochronous data for this endpoint. The application must program the even/odd
 *  (micro)frame number in which it intends to transmit/receive isochronous data for
 *  this endpoint using the SetEvnFr and SetOddFr fields in this register.
 *  -- 1'b0: Even (micro)frame
 *  -- 1'b1: Odd (micro)frame
 *  - When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
 *  in which to send data is provided in the transmit descriptor structure. The frame
 *  in which data is received is updated in receive descriptor structure.
 *  Reset: 1'b0
 */
#define USB_OTGFS_DOEPCTL2_DPID    (BIT(16))
#define USB_OTGFS_DOEPCTL2_DPID_M  (USB_OTGFS_DOEPCTL2_DPID_V << USB_OTGFS_DOEPCTL2_DPID_S)
#define USB_OTGFS_DOEPCTL2_DPID_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_DPID_S  16
/** USB_OTGFS_DOEPCTL2_NAKSTS : RO; bitpos: [17]; default: 0;
 *  NAK Status (NAKSts)
 *
 *  Indicates the following:
 *  - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status.
 *  - 1'b1: The core is transmitting NAK handshakes on this endpoint.
 *  When either the application or the core sets this bit:
 *  - The core stops receiving any data on an OUT endpoint, even if there is space in
 *  the RxFIFO to accommodate the incoming packet.
 *  - For non-isochronous IN endpoints: The core stops transmitting any data on an IN
 *  endpoint, even if there data is available in the TxFIFO.
 *  - For isochronous IN endpoints: The core sends out a zero-length data packet, even
 *  if there data is available in the TxFIFO.
 *  Irrespective of this bit's setting, the core always responds to SETUP data packets
 *  with an ACK handshake.
 */
#define USB_OTGFS_DOEPCTL2_NAKSTS    (BIT(17))
#define USB_OTGFS_DOEPCTL2_NAKSTS_M  (USB_OTGFS_DOEPCTL2_NAKSTS_V << USB_OTGFS_DOEPCTL2_NAKSTS_S)
#define USB_OTGFS_DOEPCTL2_NAKSTS_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_NAKSTS_S  17
/** USB_OTGFS_DOEPCTL2_EPTYPE : R/W; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *
 *  This is the transfer type supported by this logical endpoint.
 *  - 2'b00: Control
 *  - 2'b01: Isochronous
 *  - 2'b10: Bulk
 *  - 2'b11: Interrupt
 */
#define USB_OTGFS_DOEPCTL2_EPTYPE    0x00000003U
#define USB_OTGFS_DOEPCTL2_EPTYPE_M  (USB_OTGFS_DOEPCTL2_EPTYPE_V << USB_OTGFS_DOEPCTL2_EPTYPE_S)
#define USB_OTGFS_DOEPCTL2_EPTYPE_V  0x00000003U
#define USB_OTGFS_DOEPCTL2_EPTYPE_S  18
/** USB_OTGFS_DOEPCTL2_SNP : R/W; bitpos: [20]; default: 0;
 *  RESERVED
 */
#define USB_OTGFS_DOEPCTL2_SNP    (BIT(20))
#define USB_OTGFS_DOEPCTL2_SNP_M  (USB_OTGFS_DOEPCTL2_SNP_V << USB_OTGFS_DOEPCTL2_SNP_S)
#define USB_OTGFS_DOEPCTL2_SNP_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_SNP_S  20
/** USB_OTGFS_DOEPCTL2_STALL : R/W; bitpos: [21]; default: 0;
 *  STALL Handshake (Stall)
 *
 *  Applies to non-control, non-isochronous IN and OUT endpoints only.
 *
 *  The application sets this bit to stall all tokens from the USB host to this
 *  endpoint. If a
 *  NAK bit, Global Non-periodic IN NAK, or Global OUT NAK is set along with this bit,
 *  the
 *  STALL bit takes priority. Only the application can clear this bit, never the core.
 *
 *  Applies to control endpoints only.
 *
 *  The application can only set this bit, and the core clears it, when a SETUP token is
 *  received for this endpoint. If a NAK bit, Global Non-periodic IN NAK, or Global OUT
 *  NAK is set along with this bit, the STALL bit takes priority. Irrespective of this
 *  bit's
 *  setting, the core always responds to SETUP data packets with an ACK handshake.
 */
#define USB_OTGFS_DOEPCTL2_STALL    (BIT(21))
#define USB_OTGFS_DOEPCTL2_STALL_M  (USB_OTGFS_DOEPCTL2_STALL_V << USB_OTGFS_DOEPCTL2_STALL_S)
#define USB_OTGFS_DOEPCTL2_STALL_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_STALL_S  21
/** USB_OTGFS_DOEPCTL2_CNAK : R/W; bitpos: [26]; default: 0;
 *
 *  Clear NAK (CNAK)
 *  A write to this bit clears the NAK bit for the endpoint.
 */
#define USB_OTGFS_DOEPCTL2_CNAK    (BIT(26))
#define USB_OTGFS_DOEPCTL2_CNAK_M  (USB_OTGFS_DOEPCTL2_CNAK_V << USB_OTGFS_DOEPCTL2_CNAK_S)
#define USB_OTGFS_DOEPCTL2_CNAK_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_CNAK_S  26
/** USB_OTGFS_DOEPCTL2_SNAK : R/W; bitpos: [27]; default: 0;
 *  Set NAK (SNAK)
 *
 *  A write to this bit sets the NAK bit for the endpoint.
 *
 *  Using this bit, the application can control the transmission of NAK
 *  handshakes on an endpoint. The core can also set this bit for an
 *  endpoint after a SETUP packet is received on that endpoint.
 */
#define USB_OTGFS_DOEPCTL2_SNAK    (BIT(27))
#define USB_OTGFS_DOEPCTL2_SNAK_M  (USB_OTGFS_DOEPCTL2_SNAK_V << USB_OTGFS_DOEPCTL2_SNAK_S)
#define USB_OTGFS_DOEPCTL2_SNAK_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_SNAK_S  27
/** USB_OTGFS_DOEPCTL2_SETD0PID : R/W; bitpos: [28]; default: 0;
 *  Set DATA0 PID (SetD0PID)
 *  - Applies to interrupt/bulk IN and OUT endpoints only.
 *  - Writing to this field sets the Endpoint Data PID (DPID) field in this register to
 *  DATA0.
 *  - This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather
 *  DMA mode.
 *  Reset: 1'b0
 *
 *  In non-Scatter/Gather DMA mode: Set Even (micro)frame (SetEvenFr)
 *  - Applies to isochronous IN and OUT endpoints only.
 *  - Writing to this field sets the Even/Odd (micro)frame (EO_FrNum) field to even
 *  (micro)frame.
 *  - When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
 *  in which to send data is in the transmit descriptor structure. The frame in which
 *  to receive data is updated in receive descriptor structure.
 *  Reset: 1'b0
 */
#define USB_OTGFS_DOEPCTL2_SETD0PID    (BIT(28))
#define USB_OTGFS_DOEPCTL2_SETD0PID_M  (USB_OTGFS_DOEPCTL2_SETD0PID_V << USB_OTGFS_DOEPCTL2_SETD0PID_S)
#define USB_OTGFS_DOEPCTL2_SETD0PID_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_SETD0PID_S  28
/** USB_OTGFS_DOEPCTL2_SETD1PID : R/W; bitpos: [29]; default: 0;
 *  Set DATA1 PID (SetD1PID)
 *  - Applies to interrupt and bulk IN and OUT endpoints only.
 *  - Writing to this field sets the Endpoint Data PID (DPID) field in this register to
 *  DATA1.
 *  - This field is applicable both for scatter-gather DMA mode and non scatter-gather
 *  DMA mode.
 *  Reset: 1'b0
 *
 *  Set Odd (micro)frame (SetOddFr)
 *  - Applies to isochronous IN and OUT endpoints only.
 *  - Writing to this field sets the even and odd (micro)frame (EO_FrNum) field to odd
 *  (micro)frame.
 *  Reset: 1'b0
 */
#define USB_OTGFS_DOEPCTL2_SETD1PID    (BIT(29))
#define USB_OTGFS_DOEPCTL2_SETD1PID_M  (USB_OTGFS_DOEPCTL2_SETD1PID_V << USB_OTGFS_DOEPCTL2_SETD1PID_S)
#define USB_OTGFS_DOEPCTL2_SETD1PID_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_SETD1PID_S  29
/** USB_OTGFS_DOEPCTL2_EPDIS : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable (EPDis)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  The application sets this bit to stop transmitting/receiving data on an endpoint,
 *  even
 *  before the transfer for that endpoint is complete. The application must wait for the
 *  Endpoint Disabled interrupt before treating the endpoint as disabled. The core
 *  clears
 *  this bit before setting the Endpoint Disabled interrupt. The application must set
 *  this bit
 *  only if Endpoint Enable is already set for this endpoint.
 */
#define USB_OTGFS_DOEPCTL2_EPDIS    (BIT(30))
#define USB_OTGFS_DOEPCTL2_EPDIS_M  (USB_OTGFS_DOEPCTL2_EPDIS_V << USB_OTGFS_DOEPCTL2_EPDIS_S)
#define USB_OTGFS_DOEPCTL2_EPDIS_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_EPDIS_S  30
/** USB_OTGFS_DOEPCTL2_EPENA : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable (EPEna)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  When Scatter/Gather DMA mode is enabled,
 *  - For IN endpoints this bit indicates that the descriptor structure and data buffer
 *  with data ready to transmit is setup.
 *  - For OUT endpoint it indicates that the descriptor structure and data buffer to
 *  receive data is setup.
 *  When Scatter/Gather DMA mode is enabled such as for buffer-pointer based DMA mode:
 *  - For IN endpoints, this bit indicates that data is ready to be transmitted on the
 *  endpoint.
 *  - For OUT endpoints, this bit indicates that the application has allocated the
 *  memory to start receiving data from the USB.
 *  The core clears this bit before setting any of the following interrupts on this
 *  endpoint:
 *  - SETUP Phase Done
 *  - Endpoint Disabled
 *  - Transfer Completed
 *  Note: For control endpoints in DMA mode, this bit must be set to be able to
 *  transfer SETUP data packets in memory.
 */
#define USB_OTGFS_DOEPCTL2_EPENA    (BIT(31))
#define USB_OTGFS_DOEPCTL2_EPENA_M  (USB_OTGFS_DOEPCTL2_EPENA_V << USB_OTGFS_DOEPCTL2_EPENA_S)
#define USB_OTGFS_DOEPCTL2_EPENA_V  0x00000001U
#define USB_OTGFS_DOEPCTL2_EPENA_S  31

