espressif/esp-idf/components/soc/esp32h4/register/soc/usb_otgfs_core_ctrl_reg.h
/** USB_OTGFS_DOEPTSIZ6_REG register
 *  Device OUT Endpoint 6 Transfer Size Register
 */
#define USB_OTGFS_DOEPTSIZ6_REG(i) (DR_REG_USB_BASE(i) + 0xbd0)
/** USB_OTGFS_DOEPTSIZ6_XFERSIZE : R/W; bitpos: [15:0]; default: 0;
 *  Transfer Size (XferSize)
 *
 *  Indicates the transfer size in bytes for endpoint 0. The core
 *  interrupts the application only after it has exhausted the transfer
 *  size amount of data. The transfer size can be Set to the
 *  maximum packet size of the endpoint, to be interrupted at the
 *  end of each packet.
 *
 *  The core decrements this field every time a packet is read from
 *  the RxFIFO and written to the external memory.
 */
#define USB_OTGFS_DOEPTSIZ6_XFERSIZE    0x0000FFFFU
#define USB_OTGFS_DOEPTSIZ6_XFERSIZE_M  (USB_OTGFS_DOEPTSIZ6_XFERSIZE_V << USB_OTGFS_DOEPTSIZ6_XFERSIZE_S)
#define USB_OTGFS_DOEPTSIZ6_XFERSIZE_V  0x0000FFFFU
#define USB_OTGFS_DOEPTSIZ6_XFERSIZE_S  0
/** USB_OTGFS_DOEPTSIZ6_PKTCNT : R/W; bitpos: [25:19]; default: 0;
 *  Packet Count (PktCnt)
 *  This field is decremented to zero after a packet is written into the RxFIFO.
 */
#define USB_OTGFS_DOEPTSIZ6_PKTCNT    0x0000007FU
#define USB_OTGFS_DOEPTSIZ6_PKTCNT_M  (USB_OTGFS_DOEPTSIZ6_PKTCNT_V << USB_OTGFS_DOEPTSIZ6_PKTCNT_S)
#define USB_OTGFS_DOEPTSIZ6_PKTCNT_V  0x0000007FU
#define USB_OTGFS_DOEPTSIZ6_PKTCNT_S  19
/** USB_OTGFS_DOEPTSIZ6_RXDPID : RO; bitpos: [30:29]; default: 0;
 *  RxDPID
 *
 *  Applies to isochronous OUT endpoints only.
 *
 *  This is the data PID received in the last packet for this endpoint.
 *  - 2'b00: DATA0
 *  - 2'b01: DATA2
 *  - 2'b10: DATA1
 *  - 2'b11: MDATA
 *  SETUP Packet Count (SUPCnt)
 *
 *  Applies to control OUT Endpoints only.
 *
 *  This field specifies the number of back-to-back SETUP data
 *  packets the endpoint can receive.
 *  - 2'b01: 1 packet
 *  - 2'b10: 2 packets
 *  - 2'b11: 3 packets
 */
#define USB_OTGFS_DOEPTSIZ6_RXDPID    0x00000003U
#define USB_OTGFS_DOEPTSIZ6_RXDPID_M  (USB_OTGFS_DOEPTSIZ6_RXDPID_V << USB_OTGFS_DOEPTSIZ6_RXDPID_S)
#define USB_OTGFS_DOEPTSIZ6_RXDPID_V  0x00000003U
#define USB_OTGFS_DOEPTSIZ6_RXDPID_S  29

/** USB_OTGFS_DOEPDMA6_REG register
 *  Device OUT Endpoint 6 DMA Address Register
 */
#define USB_OTGFS_DOEPDMA6_REG(i) (DR_REG_USB_BASE(i) + 0xbd4)
/** USB_OTGFS_DOEPDMA6_DMAADDR : R/W; bitpos: [31:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 *
 *  Note: For control endpoints, this field stores control OUT data packets as well as
 *  SETUP transaction data packets. When more than three SETUP packets are
 *  received back-to-back, the SETUP data packet in the memory is overwritten.
 *
 *  This register is incremented on every AHB transaction. The application can give
 *  only a DWORD-aligned address.
 *  - When Scatter/Gather DMA mode is not enabled, the application programs the start
 *  address value in this field.
 *  - When Scatter/Gather DMA mode is enabled, this field indicates the base pointer
 *  for the descriptor list.
 */
#define USB_OTGFS_DOEPDMA6_DMAADDR    0xFFFFFFFFU
#define USB_OTGFS_DOEPDMA6_DMAADDR_M  (USB_OTGFS_DOEPDMA6_DMAADDR_V << USB_OTGFS_DOEPDMA6_DMAADDR_S)
#define USB_OTGFS_DOEPDMA6_DMAADDR_V  0xFFFFFFFFU
#define USB_OTGFS_DOEPDMA6_DMAADDR_S  0

/** USB_OTGFS_DOEPDMAB6_REG register
 *  Device OUT Endpoint 6 Buffer Address Register
 */
#define USB_OTGFS_DOEPDMAB6_REG(i) (DR_REG_USB_BASE(i) + 0xbdc)
/** USB_OTGFS_DOEPDMAB6_DMABUFFERADDR : RO; bitpos: [31:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress.
 *
 *  This register is present only in Scatter/Gather DMA mode. Otherwise this field is
 *  reserved.
 */
#define USB_OTGFS_DOEPDMAB6_DMABUFFERADDR    0xFFFFFFFFU
#define USB_OTGFS_DOEPDMAB6_DMABUFFERADDR_M  (USB_OTGFS_DOEPDMAB6_DMABUFFERADDR_V << USB_OTGFS_DOEPDMAB6_DMABUFFERADDR_S)
#define USB_OTGFS_DOEPDMAB6_DMABUFFERADDR_V  0xFFFFFFFFU
#define USB_OTGFS_DOEPDMAB6_DMABUFFERADDR_S  0

/** USB_OTGFS_PCGCCTL_REG register
 *  Power and Clock Gating Control Register
 */
#define USB_OTGFS_PCGCCTL_REG(i) (DR_REG_USB_BASE(i) + 0xe00)
/** USB_OTGFS_PCGCCTL_STOPPCLK : R/W; bitpos: [0]; default: 0;
 *  Stop Pclk (StopPclk)
 *  - The application sets this bit to stop the PHY clock (phy_clk) when the USB is
 *  suspended, the session is not valid, or the device is disconnected.
 *  - The application clears this bit when the USB is resumed or a new session starts.
 */
#define USB_OTGFS_PCGCCTL_STOPPCLK    (BIT(0))
#define USB_OTGFS_PCGCCTL_STOPPCLK_M  (USB_OTGFS_PCGCCTL_STOPPCLK_V << USB_OTGFS_PCGCCTL_STOPPCLK_S)
#define USB_OTGFS_PCGCCTL_STOPPCLK_V  0x00000001U
#define USB_OTGFS_PCGCCTL_STOPPCLK_S  0
/** USB_OTGFS_PCGCCTL_GATEHCLK : R/W; bitpos: [1]; default: 0;
 *  Gate Hclk (GateHclk)
 *  - The application sets this bit to gate hclk to modules other than the AHB Slave
 *  and Master and wakeup logic when the USB is suspended or the session is not valid.
 *  - The application clears this bit when the USB is resumed or a new session starts.
 */
#define USB_OTGFS_PCGCCTL_GATEHCLK    (BIT(1))
#define USB_OTGFS_PCGCCTL_GATEHCLK_M  (USB_OTGFS_PCGCCTL_GATEHCLK_V << USB_OTGFS_PCGCCTL_GATEHCLK_S)
#define USB_OTGFS_PCGCCTL_GATEHCLK_V  0x00000001U
#define USB_OTGFS_PCGCCTL_GATEHCLK_S  1
/** USB_OTGFS_PCGCCTL_PWRCLMP : R/W; bitpos: [2]; default: 0;
 *  Power Clamp (PwrClmp)
 *
 *  This bit is valid only in Partial Power-Down mode
 *  - The application sets this bit before the power is turned off to clamp the signals
 *  between the power-on modules and the power-off modules.
 *  - The application clears the bit to disable the clamping before the power is turned
 *  on.
 */
#define USB_OTGFS_PCGCCTL_PWRCLMP    (BIT(2))
#define USB_OTGFS_PCGCCTL_PWRCLMP_M  (USB_OTGFS_PCGCCTL_PWRCLMP_V << USB_OTGFS_PCGCCTL_PWRCLMP_S)
#define USB_OTGFS_PCGCCTL_PWRCLMP_V  0x00000001U
#define USB_OTGFS_PCGCCTL_PWRCLMP_S  2
/** USB_OTGFS_PCGCCTL_RSTPDWNMODULE : R/W; bitpos: [3]; default: 0;
 *  Reset Power-Down Modules (RstPdwnModule)
 *
 *  This bit is valid only in Partial Power-Down mode.
 *  - The application sets this bit when the power is turned off.
 *  - The application clears this bit after the power is turned on and the PHY clock is
 *  up.
 *
 *  Note: The R/W of all core registers are possible only when this bit is set to 1b0.
 */
#define USB_OTGFS_PCGCCTL_RSTPDWNMODULE    (BIT(3))
#define USB_OTGFS_PCGCCTL_RSTPDWNMODULE_M  (USB_OTGFS_PCGCCTL_RSTPDWNMODULE_V << USB_OTGFS_PCGCCTL_RSTPDWNMODULE_S)
#define USB_OTGFS_PCGCCTL_RSTPDWNMODULE_V  0x00000001U
#define USB_OTGFS_PCGCCTL_RSTPDWNMODULE_S  3
/** USB_OTGFS_PCGCCTL_PHYSLEEP : RO; bitpos: [6]; default: 0;
 *  PHY In Sleep
 *
 *  Indicates that the PHY is in Sleep State.
 */
#define USB_OTGFS_PCGCCTL_PHYSLEEP    (BIT(6))
#define USB_OTGFS_PCGCCTL_PHYSLEEP_M  (USB_OTGFS_PCGCCTL_PHYSLEEP_V << USB_OTGFS_PCGCCTL_PHYSLEEP_S)
#define USB_OTGFS_PCGCCTL_PHYSLEEP_V  0x00000001U
#define USB_OTGFS_PCGCCTL_PHYSLEEP_S  6
/** USB_OTGFS_PCGCCTL_L1SUSPENDED : RO; bitpos: [7]; default: 0;
 *  L1 Deep Sleep
 *
 *  Indicates that the PHY is in deep sleep when in L1 state.
 */
#define USB_OTGFS_PCGCCTL_L1SUSPENDED    (BIT(7))
#define USB_OTGFS_PCGCCTL_L1SUSPENDED_M  (USB_OTGFS_PCGCCTL_L1SUSPENDED_V << USB_OTGFS_PCGCCTL_L1SUSPENDED_S)
#define USB_OTGFS_PCGCCTL_L1SUSPENDED_V  0x00000001U
#define USB_OTGFS_PCGCCTL_L1SUSPENDED_S  7
/** USB_OTGFS_PCGCCTL_RESETAFTERSUSP : R/W; bitpos: [8]; default: 0;
 *  Reset after suspend
 *
 *  Applicable in Partial power-down mode
 *
 *  In partial power-down mode of operation, this bit needs to be set in host mode
 *  before
 *  clamp is removed if the host needs to issue reset after suspend. If this bit is not
 *  set,
 *  then the host issues resume after suspend.
 *
 *  This bit is not applicable in device mode and non-partial power-down mode.
 *  In Hibernation mode, this bit needs to be set at RESTORE_POINT before
 *  PCGCCTL.EssRegRestored is set. In this case, PCGCCTL.restore_mode needs to
 *  be set to wait_restore.
 */
#define USB_OTGFS_PCGCCTL_RESETAFTERSUSP    (BIT(8))
#define USB_OTGFS_PCGCCTL_RESETAFTERSUSP_M  (USB_OTGFS_PCGCCTL_RESETAFTERSUSP_V << USB_OTGFS_PCGCCTL_RESETAFTERSUSP_S)
#define USB_OTGFS_PCGCCTL_RESETAFTERSUSP_V  0x00000001U
#define USB_OTGFS_PCGCCTL_RESETAFTERSUSP_S  8

#ifdef __cplusplus
}
#endif
